Seed 0
Optimizer
{'lr': 0.0010000000474974513, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 2)             0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 2)            0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 2)             0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Origin_Input (InputLayer)    (None, 72, 2)             0         
_________________________________________________________________
Conv_0 (Conv1D)              (None, 72, 5)             100       
_________________________________________________________________
relu_0 (Activation)          (None, 72, 5)             0         
_________________________________________________________________
Conv_1 (Conv1D)              (None, 72, 18)            450       
_________________________________________________________________
relu_1 (Activation)          (None, 72, 18)            0         
_________________________________________________________________
AVG_100 (MaxPooling1D)       (None, 36, 18)            0         
_________________________________________________________________
Conv_100 (Conv1D)            (None, 36, 30)            1110      
_________________________________________________________________
relu_100 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
Conv_110 (Conv1D)            (None, 36, 30)            4530      
_________________________________________________________________
relu_110 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
AVG_101 (MaxPooling1D)       (None, 18, 30)            0         
_________________________________________________________________
Conv_101 (Conv1D)            (None, 18, 50)            3050      
_________________________________________________________________
relu_101 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_111 (Conv1D)            (None, 18, 50)            12550     
_________________________________________________________________
relu_111 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
AVG_102 (MaxPooling1D)       (None, 9, 50)             0         
_________________________________________________________________
Conv_102 (Conv1D)            (None, 9, 100)            10100     
_________________________________________________________________
relu_102 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Conv_112 (Conv1D)            (None, 9, 100)            40100     
_________________________________________________________________
relu_112 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Flatten (Flatten)            (None, 900)               0         
_________________________________________________________________
Dense_0 (Dense)              (None, 360)               324360    
_________________________________________________________________
relu_d_0 (Activation)        (None, 360)               0         
_________________________________________________________________
Dense_1 (Dense)              (None, 180)               64980     
_________________________________________________________________
relu_d_1 (Activation)        (None, 180)               0         
_________________________________________________________________
Dense_2 (Dense)              (None, 54)                9774      
_________________________________________________________________
relu_d_2 (Activation)        (None, 54)                0         
_________________________________________________________________
Reshape (Reshape)            (None, 9, 6)              0         
_________________________________________________________________
Ups_200 (UpSampling1D)       (None, 18, 6)             0         
_________________________________________________________________
Conv_200 (Conv1D)            (None, 18, 50)            950       
_________________________________________________________________
relu_200 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_210 (Conv1D)            (None, 18, 50)            10050     
_________________________________________________________________
relu_210 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Ups_201 (UpSampling1D)       (None, 36, 50)            0         
_________________________________________________________________
Conv_201 (Conv1D)            (None, 36, 100)           15100     
_________________________________________________________________
relu_201 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Conv_211 (Conv1D)            (None, 36, 100)           50100     
_________________________________________________________________
relu_211 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Ups_202 (UpSampling1D)       (None, 72, 100)           0         
_________________________________________________________________
Conv_202 (Conv1D)            (None, 72, 100)           30100     
_________________________________________________________________
relu_202 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv_212 (Conv1D)            (None, 72, 100)           60100     
_________________________________________________________________
relu_212 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv3_300 (Conv1D)           (None, 72, 10)            5000      
_________________________________________________________________
relu_300 (Activation)        (None, 72, 10)            0         
=================================================================
Total params: 642,504
Trainable params: 642,504
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_RC0 (InputLayer)          (None, 10, 72)       0                                            
__________________________________________________________________________________________________
Last_flatten (Flatten)          (None, 720)          0           Input_RC0[0][0]                  
__________________________________________________________________________________________________
Last_Dense_0 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
Last_Dense_1 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 72, 1)        0           Last_Dense_0[0][0]               
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 72, 1)        0           Last_Dense_1[0][0]               
__________________________________________________________________________________________________
Last_Concat (Concatenate)       (None, 72, 2)        0           reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
==================================================================================================
Total params: 103,824
Trainable params: 103,824
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[5, 18], [30, 30, 50, 50, 100, 100], [40, 20, 6], [50, 50, 100, 100, 100, 100], [10]]
list_of_kernel_unet =  [[10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [5]]
list_of_activation_unet =  [['relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu', 'relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu']]
loss
[0.0, 20.447325906635804, 6.058966993795011, 6.090161233281893, 3.3354012446148404, 3.9953917201163835, 2.7283056439686213, 2.431125217013889, 2.5585485387731484, 1.7164089375562628, 2.761126482928241, 2.581105424543467, 1.9352698306487912, 2.259383338959619, 1.6833076634034208, 2.315768269354424, 1.7813001091097609, 1.6509577747235082, 1.681012565706983, 1.604327292108732, 1.9170767073768646, 1.6706588179976851, 1.4715509610902135, 1.8324760782375258, 1.5309120460792824, 9188.637]
flxd_loss
[0.0, 11.645767023533951, 3.498334217463992, 3.3466010701999744, 1.6800033506542567, 2.1095184200585133, 1.425260441784015, 1.262438864374357, 1.3240264766991383, 0.8938931437676826, 1.449886620289995, 1.3048125843942902, 1.0086563801078638, 1.0870545940634646, 0.8377625265239198, 1.1986495908886317, 0.8456614929952739, 0.7744536223234953, 0.8517025920098701, 0.797134650587545, 0.9537201555668081, 0.776338867689847, 0.6844958395624356, 0.96513391816567, 0.7375713709450553, 4760.283]
flxu_loss
[0.0, 4.530329198013117, 1.5628503870081019, 1.9126009215052726, 1.0176407927838864, 1.2705959743923612, 0.7879501154393326, 0.7015239574291088, 0.813249124911587, 0.45276001353322726, 0.9163824638712063, 0.8729517430434992, 0.5798667625144676, 0.8142708986384388, 0.5305102940940072, 0.7905515191976916, 0.612355110576614, 0.5813724847487461, 0.530313562463831, 0.5134872938870403, 0.674489401986079, 0.6001522236890754, 0.5183444866918242, 0.5800343580206726, 0.514424202373489, 3238.192]
