Seed 0
Optimizer
{'lr': 0.0010000000474974513, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 2)             0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 2)            0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 2)             0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Origin_Input (InputLayer)    (None, 72, 2)             0         
_________________________________________________________________
Conv_0 (Conv1D)              (None, 72, 5)             100       
_________________________________________________________________
relu_0 (Activation)          (None, 72, 5)             0         
_________________________________________________________________
Conv_1 (Conv1D)              (None, 72, 18)            450       
_________________________________________________________________
relu_1 (Activation)          (None, 72, 18)            0         
_________________________________________________________________
AVG_100 (MaxPooling1D)       (None, 36, 18)            0         
_________________________________________________________________
Conv_100 (Conv1D)            (None, 36, 30)            1110      
_________________________________________________________________
relu_100 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
Conv_110 (Conv1D)            (None, 36, 30)            4530      
_________________________________________________________________
relu_110 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
AVG_101 (MaxPooling1D)       (None, 18, 30)            0         
_________________________________________________________________
Conv_101 (Conv1D)            (None, 18, 50)            3050      
_________________________________________________________________
relu_101 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_111 (Conv1D)            (None, 18, 50)            12550     
_________________________________________________________________
relu_111 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
AVG_102 (MaxPooling1D)       (None, 9, 50)             0         
_________________________________________________________________
Conv_102 (Conv1D)            (None, 9, 100)            10100     
_________________________________________________________________
relu_102 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Conv_112 (Conv1D)            (None, 9, 100)            40100     
_________________________________________________________________
relu_112 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Flatten (Flatten)            (None, 900)               0         
_________________________________________________________________
Dense_0 (Dense)              (None, 360)               324360    
_________________________________________________________________
relu_d_0 (Activation)        (None, 360)               0         
_________________________________________________________________
Dense_1 (Dense)              (None, 180)               64980     
_________________________________________________________________
relu_d_1 (Activation)        (None, 180)               0         
_________________________________________________________________
Dense_2 (Dense)              (None, 90)                16290     
_________________________________________________________________
relu_d_2 (Activation)        (None, 90)                0         
_________________________________________________________________
Reshape (Reshape)            (None, 9, 10)             0         
_________________________________________________________________
Ups_200 (UpSampling1D)       (None, 18, 10)            0         
_________________________________________________________________
Conv_200 (Conv1D)            (None, 18, 50)            1550      
_________________________________________________________________
relu_200 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_210 (Conv1D)            (None, 18, 50)            10050     
_________________________________________________________________
relu_210 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Ups_201 (UpSampling1D)       (None, 36, 50)            0         
_________________________________________________________________
Conv_201 (Conv1D)            (None, 36, 100)           15100     
_________________________________________________________________
relu_201 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Conv_211 (Conv1D)            (None, 36, 100)           50100     
_________________________________________________________________
relu_211 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Ups_202 (UpSampling1D)       (None, 72, 100)           0         
_________________________________________________________________
Conv_202 (Conv1D)            (None, 72, 100)           30100     
_________________________________________________________________
relu_202 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv_212 (Conv1D)            (None, 72, 100)           60100     
_________________________________________________________________
relu_212 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv3_300 (Conv1D)           (None, 72, 10)            5000      
_________________________________________________________________
relu_300 (Activation)        (None, 72, 10)            0         
=================================================================
Total params: 649,620
Trainable params: 649,620
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 10, 72)       0                                            
__________________________________________________________________________________________________
Last_flatten (Flatten)          (None, 720)          0           input_2[0][0]                    
__________________________________________________________________________________________________
Last_Dense_0 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
Last_Dense_1 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 72, 1)        0           Last_Dense_0[0][0]               
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 72, 1)        0           Last_Dense_1[0][0]               
__________________________________________________________________________________________________
Last_Concat (Concatenate)       (None, 72, 2)        0           reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
==================================================================================================
Total params: 103,824
Trainable params: 103,824
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[5, 18], [30, 30, 50, 50, 100, 100], [40, 20, 10], [50, 50, 100, 100, 100, 100], [10]]
list_of_kernel_unet =  [[10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [5]]
list_of_activation_unet =  [['relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu', 'relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu']]
loss
[0.0, 7.271165887024177, 4.8404440546232, 5.626695421006945, 3.149266874839249, 3.7857231485500256, 2.5233654132105197, 2.179515194990998, 2.2535998183513373, 1.4633422349215535, 2.449301888422711, 2.2063754360371655, 1.6340978802967463, 1.9567746762876157, 1.4372608828446503, 1.981693346313979, 1.5836798271524564, 1.4530240282600309, 1.4295712066775976, 1.3684875739454732, 1.6472620081018519, 1.430462244606803, 1.2492893046312372, 1.5063610940313144, 1.2875231833124356, 7549.5776]
flxd_loss
[0.0, 4.377736786265432, 2.7076071907953962, 3.1072769479005915, 1.5904494548530737, 2.0111121660397377, 1.3080888913001543, 1.1084337273742928, 1.1597845132458848, 0.7295713071469907, 1.2884625721370242, 1.0821702745225694, 0.8245575202345358, 0.9293211634757588, 0.6830761442459169, 1.0143052717295202, 0.7378619158709491, 0.6719526126060957, 0.7011448110572596, 0.652574076083462, 0.8122764556005658, 0.6452081625353653, 0.5775194835270383, 0.7743451781724215, 0.6017416494864004, 3815.2732]
flxu_loss
[0.0, 1.8494441028485082, 1.2735873249823173, 1.7457569263599537, 0.9427212687676826, 1.1680059236754115, 0.7001852655606996, 0.6127368314766589, 0.6767618312757202, 0.37789154052734375, 0.7739173669383359, 0.732321217226884, 0.4754978697976948, 0.6857665890038259, 0.4531557373549222, 0.650765940976241, 0.5303111763157472, 0.49219506660116064, 0.442994765293451, 0.43581220838758683, 0.5602351687082048, 0.5066188922144258, 0.41622959341041343, 0.46410002531828703, 0.42405462068785366, 2620.6033]
