Seed 0
Optimizer
{'lr': 0.0010000000474974513, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 2)             0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 2)            0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 2)             0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Origin_Input (InputLayer)    (None, 72, 2)             0         
_________________________________________________________________
Conv_0 (Conv1D)              (None, 72, 5)             100       
_________________________________________________________________
relu_0 (Activation)          (None, 72, 5)             0         
_________________________________________________________________
Conv_1 (Conv1D)              (None, 72, 18)            450       
_________________________________________________________________
relu_1 (Activation)          (None, 72, 18)            0         
_________________________________________________________________
AVG_100 (MaxPooling1D)       (None, 36, 18)            0         
_________________________________________________________________
Conv_100 (Conv1D)            (None, 36, 30)            1110      
_________________________________________________________________
relu_100 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
Conv_110 (Conv1D)            (None, 36, 30)            4530      
_________________________________________________________________
relu_110 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
AVG_101 (MaxPooling1D)       (None, 18, 30)            0         
_________________________________________________________________
Conv_101 (Conv1D)            (None, 18, 50)            3050      
_________________________________________________________________
relu_101 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_111 (Conv1D)            (None, 18, 50)            12550     
_________________________________________________________________
relu_111 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
AVG_102 (MaxPooling1D)       (None, 9, 50)             0         
_________________________________________________________________
Conv_102 (Conv1D)            (None, 9, 100)            10100     
_________________________________________________________________
relu_102 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Conv_112 (Conv1D)            (None, 9, 100)            40100     
_________________________________________________________________
relu_112 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Flatten (Flatten)            (None, 900)               0         
_________________________________________________________________
Dense_0 (Dense)              (None, 360)               324360    
_________________________________________________________________
relu_d_0 (Activation)        (None, 360)               0         
_________________________________________________________________
Dense_1 (Dense)              (None, 180)               64980     
_________________________________________________________________
relu_d_1 (Activation)        (None, 180)               0         
_________________________________________________________________
Dense_2 (Dense)              (None, 36)                6516      
_________________________________________________________________
relu_d_2 (Activation)        (None, 36)                0         
_________________________________________________________________
Reshape (Reshape)            (None, 9, 4)              0         
_________________________________________________________________
Ups_200 (UpSampling1D)       (None, 18, 4)             0         
_________________________________________________________________
Conv_200 (Conv1D)            (None, 18, 50)            650       
_________________________________________________________________
relu_200 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_210 (Conv1D)            (None, 18, 50)            10050     
_________________________________________________________________
relu_210 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Ups_201 (UpSampling1D)       (None, 36, 50)            0         
_________________________________________________________________
Conv_201 (Conv1D)            (None, 36, 100)           15100     
_________________________________________________________________
relu_201 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Conv_211 (Conv1D)            (None, 36, 100)           50100     
_________________________________________________________________
relu_211 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Ups_202 (UpSampling1D)       (None, 72, 100)           0         
_________________________________________________________________
Conv_202 (Conv1D)            (None, 72, 100)           30100     
_________________________________________________________________
relu_202 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv_212 (Conv1D)            (None, 72, 100)           60100     
_________________________________________________________________
relu_212 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv3_300 (Conv1D)           (None, 72, 10)            5000      
_________________________________________________________________
relu_300 (Activation)        (None, 72, 10)            0         
=================================================================
Total params: 638,946
Trainable params: 638,946
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_RC0 (InputLayer)          (None, 10, 72)       0                                            
__________________________________________________________________________________________________
Last_flatten (Flatten)          (None, 720)          0           Input_RC0[0][0]                  
__________________________________________________________________________________________________
Last_Dense_0 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
Last_Dense_1 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 72, 1)        0           Last_Dense_0[0][0]               
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 72, 1)        0           Last_Dense_1[0][0]               
__________________________________________________________________________________________________
Last_Concat (Concatenate)       (None, 72, 2)        0           reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
==================================================================================================
Total params: 103,824
Trainable params: 103,824
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[5, 18], [30, 30, 50, 50, 100, 100], [40, 20, 4], [50, 50, 100, 100, 100, 100], [10]]
list_of_kernel_unet =  [[10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [5]]
list_of_activation_unet =  [['relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu', 'relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu']]
loss
[0.0, 1.7926316751864713, 1.6824039412133487, 2.501499505690586, 1.5912388931086034, 2.2572569042566872, 1.5773268962593237, 1.492868808071309, 1.7498157642505787, 1.1464764630353008, 2.036342416771155, 1.900477782198431, 1.5199970512233154, 1.8373968179333848, 1.421049016002765, 1.96535903239937, 1.5103175787278165, 1.4516526210455247, 1.43741196369438, 1.5006808057243441, 1.8052954654144162, 1.4768975654256686, 1.391214755336934, 1.7420632947128987, 1.4483877425331146, 9202.214]
flxd_loss
[0.0, 0.9399647653838734, 0.8689877859358925, 1.3120179980870628, 0.7881115571952161, 1.1842662669994213, 0.8243132540227945, 0.780662756397891, 0.9289983427573624, 0.5948068124276621, 1.0851798351900077, 0.97009176874357, 0.8122979309333205, 0.9091043982486176, 0.7255806000634967, 1.0537697120949074, 0.7449942380803112, 0.7119492267875515, 0.745663301444348, 0.7804170459386253, 0.9477401545018326, 0.7092393788781186, 0.6951132566349987, 0.9685321070039223, 0.7377590603298612, 5040.0874]
flxu_loss
[0.0, 0.5636238757474923, 0.539585505983957, 0.8781426198197981, 0.5318356109744727, 0.7834860091346773, 0.4883630697619277, 0.4583721710330665, 0.5657709694693609, 0.32256144456902647, 0.6921440093115033, 0.6628961131405928, 0.47062717641822593, 0.6778286906426826, 0.46886422114117154, 0.668975830078125, 0.5191060446907954, 0.5109439112031411, 0.46198476783532666, 0.4847832824958205, 0.6247164251382459, 0.5318893620997299, 0.4788784136988008, 0.5380605061848959, 0.48010316699620625, 3142.103]
