Seed 0
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
InputLev_0 (InputLayer)         (64, 72, 8)          0                                            
__________________________________________________________________________________________________
Up_0 (UpSampling1D)             (64, 360, 8)         0           InputLev_0[0][0]                 
__________________________________________________________________________________________________
average_pooling1d_1 (AveragePoo (64, 72, 8)          0           Up_0[0][0]                       
__________________________________________________________________________________________________
Flat_0 (Flatten)                (64, 576)            0           average_pooling1d_1[0][0]        
__________________________________________________________________________________________________
InputU_1 (InputLayer)           (64, 3)              0                                            
__________________________________________________________________________________________________
Concat_0 (Concatenate)          (64, 579)            0           Flat_0[0][0]                     
                                                                 InputU_1[0][0]                   
__________________________________________________________________________________________________
Dense_0 (Dense)                 (64, 300)            174000      Concat_0[0][0]                   
__________________________________________________________________________________________________
Act_0 (Activation)              (64, 300)            0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (64, 100)            30000       Act_0[0][0]                      
__________________________________________________________________________________________________
Act_1 (Activation)              (64, 100)            0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Dense_2 (Dense)                 (64, 216)            21816       Act_1[0][0]                      
__________________________________________________________________________________________________
reshape_1 (Reshape)             (64, 72, 3)          0           Dense_2[0][0]                    
==================================================================================================
Total params: 225,816
Trainable params: 225,816
Non-trainable params: 0
__________________________________________________________________________________________________
val_loss : [179.31939270019532]
val_flxd_loss : [84.54665435791016]
val_flxu_loss : [23.22427272796631]
val_dfdts_loss : [71.54846427917481]
loss : [124.8488102722168]
flxd_loss : [69.37535011291504]
flxu_loss : [21.22322248458862]
dfdts_loss : [34.25023921966553]
