Seed 0
Optimizer
{'lr': 4.999999873689376e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_0 (InputLayer)            (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_u_1 (Conv1D)               (None, 72, 64)       19264       Input_0[0][0]                    
__________________________________________________________________________________________________
elu_u_1 (ELU)                   (None, 72, 64)       0           Conv_u_1[0][0]                   
__________________________________________________________________________________________________
Conv_u_2 (Conv1D)               (None, 72, 64)       122944      elu_u_1[0][0]                    
__________________________________________________________________________________________________
elu_u_2 (ELU)                   (None, 72, 64)       0           Conv_u_2[0][0]                   
__________________________________________________________________________________________________
Conv_u_3 (Conv1D)               (None, 72, 128)      245888      elu_u_2[0][0]                    
__________________________________________________________________________________________________
Flip_0 (Lambda)                 (None, 72, 10)       0           Input_0[0][0]                    
__________________________________________________________________________________________________
elu_u_3 (ELU)                   (None, 72, 128)      0           Conv_u_3[0][0]                   
__________________________________________________________________________________________________
Conv_d_1 (Conv1D)               (None, 72, 128)      12928       Flip_0[0][0]                     
__________________________________________________________________________________________________
Conv_u_4 (Conv1D)               (None, 72, 128)      163968      elu_u_3[0][0]                    
__________________________________________________________________________________________________
elu_d_1 (ELU)                   (None, 72, 128)      0           Conv_d_1[0][0]                   
__________________________________________________________________________________________________
elu_u_4 (ELU)                   (None, 72, 128)      0           Conv_u_4[0][0]                   
__________________________________________________________________________________________________
Conv_d_2 (Conv1D)               (None, 72, 128)      82048       elu_d_1[0][0]                    
__________________________________________________________________________________________________
Conv_u_5 (Conv1D)               (None, 72, 128)      131200      elu_u_4[0][0]                    
__________________________________________________________________________________________________
elu_d_2 (ELU)                   (None, 72, 128)      0           Conv_d_2[0][0]                   
__________________________________________________________________________________________________
elu_u_5 (ELU)                   (None, 72, 128)      0           Conv_u_5[0][0]                   
__________________________________________________________________________________________________
Conv_d_3 (Conv1D)               (None, 72, 64)       24640       elu_d_2[0][0]                    
__________________________________________________________________________________________________
Conv_u_6 (Conv1D)               (None, 72, 256)      164096      elu_u_5[0][0]                    
__________________________________________________________________________________________________
elu_d_3 (ELU)                   (None, 72, 64)       0           Conv_d_3[0][0]                   
__________________________________________________________________________________________________
elu_u_6 (ELU)                   (None, 72, 256)      0           Conv_u_6[0][0]                   
__________________________________________________________________________________________________
Flip_1 (Lambda)                 (None, 72, 64)       0           elu_d_3[0][0]                    
__________________________________________________________________________________________________
Concat_0 (Concatenate)          (None, 72, 320)      0           elu_u_6[0][0]                    
                                                                 Flip_1[0][0]                     
__________________________________________________________________________________________________
Conv_c_0 (Conv1D)               (None, 72, 512)      1638912     Concat_0[0][0]                   
__________________________________________________________________________________________________
elu_c_1 (ELU)                   (None, 72, 512)      0           Conv_c_0[0][0]                   
__________________________________________________________________________________________________
Conv_c_1 (Conv1D)               (None, 72, 256)      1048832     elu_c_1[0][0]                    
__________________________________________________________________________________________________
elu_c_2 (ELU)                   (None, 72, 256)      0           Conv_c_1[0][0]                   
__________________________________________________________________________________________________
Conv_c_2 (Conv1D)               (None, 72, 256)      327936      elu_c_2[0][0]                    
__________________________________________________________________________________________________
elu_c_3 (ELU)                   (None, 72, 256)      0           Conv_c_2[0][0]                   
__________________________________________________________________________________________________
Conv_c_3 (Conv1D)               (None, 72, 128)      98432       elu_c_3[0][0]                    
__________________________________________________________________________________________________
elu_c_4 (ELU)                   (None, 72, 128)      0           Conv_c_3[0][0]                   
__________________________________________________________________________________________________
Conv_c_4 (Conv1D)               (None, 72, 2)        770         elu_c_4[0][0]                    
__________________________________________________________________________________________________
linear_c_5 (Activation)         (None, 72, 2)        0           Conv_c_4[0][0]                   
==================================================================================================
Total params: 4,081,858
Trainable params: 4,081,858
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[64, 64, 128, 128, 256], [128, 128, 100, 100, 128, 128], [128, 128], [128, 128, 128, 128, 256, 512], [512, 256, 2]]
list_of_kernel_unet =  [[10, 10, 8, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.5, 0.0, 0.5], [0.0, 0.5, 0.0, 0.5, 0.0, 0.5], [0.5, 0.0], [0.0, 0.5, 0.0, 0.5, 0.0, 0.5], [0.5, 0, 0]]
loss
[0.0, 2.019184881767618, 2.0345648620354297, 2.0352845996495628, 2.0340067545572915, 2.00799158669303, 4866.6875]
