Seed 0
Optimizer
{'lr': 0.0010000000474974513, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Origin_Input (InputLayer)    (None, 72, 1)             0         
_________________________________________________________________
Conv_0 (Conv1D)              (None, 72, 5)             50        
_________________________________________________________________
relu_0 (Activation)          (None, 72, 5)             0         
_________________________________________________________________
Conv_1 (Conv1D)              (None, 72, 18)            450       
_________________________________________________________________
relu_1 (Activation)          (None, 72, 18)            0         
_________________________________________________________________
AVG_100 (MaxPooling1D)       (None, 36, 18)            0         
_________________________________________________________________
Conv_100 (Conv1D)            (None, 36, 30)            1110      
_________________________________________________________________
relu_100 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
Conv_110 (Conv1D)            (None, 36, 30)            4530      
_________________________________________________________________
relu_110 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
AVG_101 (MaxPooling1D)       (None, 18, 30)            0         
_________________________________________________________________
Conv_101 (Conv1D)            (None, 18, 50)            3050      
_________________________________________________________________
relu_101 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_111 (Conv1D)            (None, 18, 50)            12550     
_________________________________________________________________
relu_111 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
AVG_102 (MaxPooling1D)       (None, 9, 50)             0         
_________________________________________________________________
Conv_102 (Conv1D)            (None, 9, 100)            10100     
_________________________________________________________________
relu_102 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Conv_112 (Conv1D)            (None, 9, 100)            40100     
_________________________________________________________________
relu_112 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Flatten (Flatten)            (None, 900)               0         
_________________________________________________________________
Dense_0 (Dense)              (None, 360)               324360    
_________________________________________________________________
relu_d_0 (Activation)        (None, 360)               0         
_________________________________________________________________
Dense_1 (Dense)              (None, 180)               64980     
_________________________________________________________________
relu_d_1 (Activation)        (None, 180)               0         
_________________________________________________________________
Dense_2 (Dense)              (None, 90)                16290     
_________________________________________________________________
relu_d_2 (Activation)        (None, 90)                0         
_________________________________________________________________
Reshape (Reshape)            (None, 9, 10)             0         
_________________________________________________________________
Ups_200 (UpSampling1D)       (None, 18, 10)            0         
_________________________________________________________________
Conv_200 (Conv1D)            (None, 18, 50)            1550      
_________________________________________________________________
relu_200 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_210 (Conv1D)            (None, 18, 50)            10050     
_________________________________________________________________
relu_210 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Ups_201 (UpSampling1D)       (None, 36, 50)            0         
_________________________________________________________________
Conv_201 (Conv1D)            (None, 36, 100)           15100     
_________________________________________________________________
relu_201 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Conv_211 (Conv1D)            (None, 36, 100)           50100     
_________________________________________________________________
relu_211 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Ups_202 (UpSampling1D)       (None, 72, 100)           0         
_________________________________________________________________
Conv_202 (Conv1D)            (None, 72, 100)           30100     
_________________________________________________________________
relu_202 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv_212 (Conv1D)            (None, 72, 100)           60100     
_________________________________________________________________
relu_212 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv3_300 (Conv1D)           (None, 72, 10)            5000      
_________________________________________________________________
relu_300 (Activation)        (None, 72, 10)            0         
=================================================================
Total params: 649,570
Trainable params: 649,570
Non-trainable params: 0
_________________________________________________________________


Unet
list_of_filters_unet =  [[5, 18], [30, 30, 50, 50, 100, 100], [40, 20, 10], [50, 50, 100, 100, 100, 100], [10]]
list_of_kernel_unet =  [[10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [5]]
list_of_activation_unet =  [['relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu', 'relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu']]
loss
[0.0, 7.839281121399177, 3.1729738839859825, 3.249988194846322, 1.8063892003440072, 2.1205482011959877, 1.4096765086484053, 1.2696662557468492, 1.279116281266075, 0.9279074335294496, 1.40014547968107, 1.2056897324299125, 0.962675997259195, 1.012808466153871, 0.8790287598660944, 1.1880480605388375, 0.7920451223114391, 0.697096334072788, 0.823957403991448, 0.8075098736295975, 0.8740898728861239, 0.6872927190835584, 0.6679657987115805, 0.8863161817009066, 0.6921422510971258, 4058.547]
