Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       9600        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 72, 32)       0           elu_0[0][0]                      
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_2 (SpatialDro (None, 72, 64)       0           elu_1[0][0]                      
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_2[0][0]        
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_3 (SpatialDro (None, 72, 64)       0           elu_2[0][0]                      
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_3[0][0]        
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 72, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_4 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
elu_4 (ELU)                     (None, 72, 128)      0           Conv_4[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_5 (SpatialDro (None, 72, 128)      0           elu_4[0][0]                      
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           spatial_dropout1d_5[0][0]        
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_6 (SpatialDro (None, 36, 30)       0           elu_100[0][0]                    
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        spatial_dropout1d_6[0][0]        
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_7 (SpatialDro (None, 36, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_8 (SpatialDro (None, 18, 50)       0           elu_101[0][0]                    
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       spatial_dropout1d_8[0][0]        
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_9 (SpatialDro (None, 18, 50)       0           elu_111[0][0]                    
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_10 (SpatialDr (None, 9, 128)       0           elu_102[0][0]                    
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       spatial_dropout1d_10[0][0]       
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_11 (SpatialDr (None, 9, 128)       0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Conv1D)                (None, 9, 50)        57650       spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 9, 50)        0           Dense_0[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_12 (SpatialDr (None, 9, 50)        0           tanh_d_0[0][0]                   
__________________________________________________________________________________________________
Dense_1 (Conv1D)                (None, 9, 20)        9020        spatial_dropout1d_12[0][0]       
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 9, 20)        0           Dense_1[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_13 (SpatialDr (None, 9, 20)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 148)       0           spatial_dropout1d_13[0][0]       
                                                                 spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 148)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       28480       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_14 (SpatialDr (None, 18, 64)       0           elu_200[0][0]                    
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       spatial_dropout1d_14[0][0]       
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_15 (SpatialDr (None, 18, 64)       0           elu_210[0][0]                    
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           spatial_dropout1d_15[0][0]       
                                                                 spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_16 (SpatialDr (None, 36, 128)      0           elu_201[0][0]                    
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       spatial_dropout1d_16[0][0]       
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_17 (SpatialDr (None, 36, 128)      0           elu_211[0][0]                    
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           spatial_dropout1d_17[0][0]       
                                                                 spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_18 (SpatialDr (None, 72, 128)      0           elu_202[0][0]                    
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      196864      spatial_dropout1d_18[0][0]       
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_19 (SpatialDr (None, 72, 256)      0           elu_212[0][0]                    
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 512)      1310720     spatial_dropout1d_19[0][0]       
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 512)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_20 (SpatialDr (None, 72, 512)      0           elu_300[0][0]                    
__________________________________________________________________________________________________
Flat_0 (Flatten)                (None, 180)          0           spatial_dropout1d_13[0][0]       
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      327680      spatial_dropout1d_20[0][0]       
__________________________________________________________________________________________________
Dense_200 (Dense)               (None, 50)           9050        Flat_0[0][0]                     
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
elu_d2_0 (ELU)                  (None, 50)           0           Dense_200[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_21 (SpatialDr (None, 72, 128)      0           elu_301[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 50)           0           elu_d2_0[0][0]                   
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         spatial_dropout1d_21[0][0]       
__________________________________________________________________________________________________
Dense_201 (Dense)               (None, 1)            51          dropout_1[0][0]                  
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
__________________________________________________________________________________________________
linear_d2_1 (Activation)        (None, 1)            0           Dense_201[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_22 (SpatialDr (None, 72, 2)        0           linear_302[0][0]                 
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1)            0           linear_d2_1[0][0]                
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 72)           0           spatial_dropout1d_22[0][0]       
__________________________________________________________________________________________________
Concat (Concatenate)            (None, 73)           0           dropout_2[0][0]                  
                                                                 lambda_1[0][0]                   
==================================================================================================
Total params: 2,505,275
Trainable params: 2,505,275
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128, 128], [30, 30, 50, 50, 128, 128], [50, 20], [64, 64, 128, 128, 128, 256], [512, 128, 2], [50, 1]]
list_of_kernel_unet =  [[30, 20, 10, 10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3], []]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear'], ['elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0], [0.0, 0]]
loss
[0.0, 2323.7687757201647, 441.8918788580247, 366.3493441358025, 321.2804783950617, 293.7546617798354, 259.9275173611111, 238.63924254115227, 227.93269354423867, 205.03385416666666, 193.12663966049382, 182.8647762345679, 173.7394547325103, 164.40047903806584, 159.305764531893, 157.1565072016461, 149.8680073302469, 143.16004372427983, 138.6943158436214, 135.7237975823045, 133.09612911522635, 131.59198977623456, 125.1343074845679, 124.46023019547324, 465089.4]
Up_Down_loss
[0.0, 71.56297421553498, 48.5590719843107, 42.98589409722222, 38.75851980452675, 35.48607896090535, 32.66357421875, 30.38453052662037, 28.51394515174897, 26.493967817644034, 24.855529031635804, 23.629587432484566, 22.36670122813786, 21.395624356995885, 20.51095920138889, 20.048034416795268, 19.26982462062757, 18.389535911779834, 17.93283420138889, 17.394105259773664, 16.927219971707817, 16.507884837962962, 16.04149084522891, 15.85326344682356, 59503.625]
bias_loss
[0.0, 1544.226980452675, 204.76697530864197, 175.7666216563786, 155.93475115740742, 143.77351787551441, 126.76150977366255, 116.37446952160494, 112.06745916923869, 99.92685024434157, 93.74050765174897, 88.7445183899177, 83.93479134516461, 79.37483121141975, 77.0553867669753, 76.03473025977367, 72.6318962191358, 69.26519900977367, 66.6204748585391, 65.63684735082305, 64.18612959747942, 63.64300813400206, 60.235371656378604, 59.80875851980453, 223644.44]
{'val_loss': [473.82164009094237, 369.84107120513914, 353.5656512451172, 296.6743265762329, 343.3919600830078, 231.06302738189697, 281.8177659835815, 206.8578655090332, 202.25656658172608, 179.0406157836914, 170.78124234008789, 229.18505963897704, 162.66417609405516, 176.8109768218994, 156.4007363204956, 129.20955072784423, 147.88647188186644, 173.62941799545288, 128.8153973197937, 147.3177208328247, 116.1118928718567, 118.3752035369873, 123.85687522125244, 116.27727305984497], 'val_Up_Down_loss': [56.74100222969055, 49.50375826263428, 43.87276441383362, 39.563478324890134, 36.5235795173645, 32.88635233306885, 30.535201290130615, 28.895571132659914, 26.51269605064392, 24.983210502624512, 23.6945931596756, 22.287317478179933, 21.089323425292967, 20.497912789344788, 19.304986776351928, 18.386913083076475, 18.02180864429474, 18.037941148757934, 16.92686856651306, 16.51287363910675, 15.875708103179932, 15.83250978088379, 15.480555233955384, 15.004328166007996], 'val_bias_loss': [210.27343543815613, 181.43146334838866, 195.54574717330934, 151.20387663841248, 171.2151139957905, 114.8222799320221, 165.96333094024658, 105.423222448349, 94.6700742225647, 86.59448978042603, 79.08661657905579, 100.88060491800309, 76.34384441947937, 76.10278273797036, 67.42909374809265, 59.44113595294952, 76.21753039932251, 94.85916639137268, 61.09137158584595, 82.65732474708557, 57.07274705696106, 53.88320576381683, 52.67606750679016, 52.34523128032684], 'loss': [2323.767974896686, 441.89151862423114, 366.3499118212319, 321.2805135338395, 293.75456474053027, 259.9271947896039, 238.63928815857372, 227.93249003092447, 205.03399508382068, 193.12679558820685, 182.86475822268198, 173.73969257221302, 164.40044587727928, 159.30597151061636, 157.15631300137366, 149.8683545373595, 143.16009938373486, 138.6943041817151, 135.72368616135523, 133.09611679791422, 131.59224347911254, 125.1343766907115, 124.46030183142595, 119.62159418372951], 'Up_Down_loss': [71.56306639767477, 48.559068343766924, 42.98597645563353, 38.7585380646427, 35.486094388696884, 32.663600272847795, 30.38453717879307, 28.51393880741096, 26.493990519900382, 24.855531529879865, 23.629597523820745, 22.366712810326014, 21.3956114625244, 20.51098710960812, 20.04804120645111, 19.269837915406796, 18.38953314335258, 17.932863024527155, 17.39409670405427, 16.92722457659588, 16.507882824773162, 16.04150161159382, 15.853262190833505, 15.304439813021279], 'bias_loss': [1544.2237768143784, 204.7672633879469, 175.76663996113672, 155.93444191330255, 143.77334108617572, 126.7616423917896, 116.3743977085553, 112.06731762390568, 99.92669594435044, 93.7404211872399, 88.74469717515349, 83.93482279336011, 79.37490409367369, 77.05537355215952, 76.0346525676947, 72.63189424433335, 69.26518130547716, 66.62045483015201, 65.636842101935, 64.18610075079364, 63.64299447423637, 60.235294531402275, 59.80873334101198, 57.52174153323036]}
