Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       9600        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 72, 32)       0           elu_0[0][0]                      
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_2 (SpatialDro (None, 72, 64)       0           elu_1[0][0]                      
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_2[0][0]        
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_3 (SpatialDro (None, 72, 64)       0           elu_2[0][0]                      
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_3[0][0]        
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 72, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_4 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
elu_4 (ELU)                     (None, 72, 128)      0           Conv_4[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_5 (SpatialDro (None, 72, 128)      0           elu_4[0][0]                      
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           spatial_dropout1d_5[0][0]        
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_6 (SpatialDro (None, 36, 30)       0           elu_100[0][0]                    
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        spatial_dropout1d_6[0][0]        
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_7 (SpatialDro (None, 36, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_8 (SpatialDro (None, 18, 50)       0           elu_101[0][0]                    
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       spatial_dropout1d_8[0][0]        
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_9 (SpatialDro (None, 18, 50)       0           elu_111[0][0]                    
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_10 (SpatialDr (None, 9, 128)       0           elu_102[0][0]                    
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       spatial_dropout1d_10[0][0]       
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_11 (SpatialDr (None, 9, 128)       0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Conv1D)                (None, 9, 50)        57650       spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 9, 50)        0           Dense_0[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_12 (SpatialDr (None, 9, 50)        0           tanh_d_0[0][0]                   
__________________________________________________________________________________________________
Dense_1 (Conv1D)                (None, 9, 20)        9020        spatial_dropout1d_12[0][0]       
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 9, 20)        0           Dense_1[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_13 (SpatialDr (None, 9, 20)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 148)       0           spatial_dropout1d_13[0][0]       
                                                                 spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 148)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       28480       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_14 (SpatialDr (None, 18, 64)       0           elu_200[0][0]                    
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       spatial_dropout1d_14[0][0]       
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_15 (SpatialDr (None, 18, 64)       0           elu_210[0][0]                    
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           spatial_dropout1d_15[0][0]       
                                                                 spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_16 (SpatialDr (None, 36, 128)      0           elu_201[0][0]                    
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       spatial_dropout1d_16[0][0]       
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_17 (SpatialDr (None, 36, 128)      0           elu_211[0][0]                    
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           spatial_dropout1d_17[0][0]       
                                                                 spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_18 (SpatialDr (None, 72, 128)      0           elu_202[0][0]                    
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      196864      spatial_dropout1d_18[0][0]       
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_19 (SpatialDr (None, 72, 256)      0           elu_212[0][0]                    
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 512)      1310720     spatial_dropout1d_19[0][0]       
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 512)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_20 (SpatialDr (None, 72, 512)      0           elu_300[0][0]                    
__________________________________________________________________________________________________
Flat_0 (Flatten)                (None, 180)          0           spatial_dropout1d_13[0][0]       
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      327680      spatial_dropout1d_20[0][0]       
__________________________________________________________________________________________________
Dense_200 (Dense)               (None, 50)           9050        Flat_0[0][0]                     
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
elu_d2_0 (ELU)                  (None, 50)           0           Dense_200[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_21 (SpatialDr (None, 72, 128)      0           elu_301[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 50)           0           elu_d2_0[0][0]                   
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         spatial_dropout1d_21[0][0]       
__________________________________________________________________________________________________
Dense_201 (Dense)               (None, 1)            51          dropout_1[0][0]                  
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
__________________________________________________________________________________________________
linear_d2_1 (Activation)        (None, 1)            0           Dense_201[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_22 (SpatialDr (None, 72, 2)        0           linear_302[0][0]                 
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1)            0           linear_d2_1[0][0]                
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 72)           0           spatial_dropout1d_22[0][0]       
__________________________________________________________________________________________________
Concat (Concatenate)            (None, 73)           0           dropout_2[0][0]                  
                                                                 lambda_1[0][0]                   
==================================================================================================
Total params: 2,505,275
Trainable params: 2,505,275
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128, 128], [30, 30, 50, 50, 128, 128], [50, 20], [64, 64, 128, 128, 128, 256], [512, 128, 2], [50, 1]]
list_of_kernel_unet =  [[30, 20, 10, 10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3], []]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear'], ['elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0], [0.0, 0]]
loss
[0.0, 1830.2229938271605, 671.2155992798354, 570.7058899176955, 497.25276491769546, 438.5231802983539, 391.19782021604937, 357.2874228395062, 337.08712705761315, 300.2955568415638, 284.53793724279836, 265.37048289609055, 252.68389917695472, 243.63641332304528, 233.41981738683128, 231.4636059670782, 220.88470936213992, 208.4155574845679, 791244.56]
Up_Down_loss
[0.0, 752.6053883744856, 963.1774048353909, 961.6151620370371, 946.8793724279835, 928.8124356995885, 911.6458976337449, 882.4577546296297, 856.2515432098766, 835.1129758230453, 807.0169110082304, 785.2255015432099, 757.8346193415638, 730.3829089506173, 706.8788580246913, 677.211741255144, 652.5048225308642, 632.467399691358, 2374184.2]
bias_loss
[0.0, 70945.5390946502, 69190.69958847736, 67788.341563786, 66332.74074074074, 64925.95473251029, 63784.135802469136, 61709.02469135803, 59904.43621399177, 58394.92592592593, 56495.99176954733, 54955.818930041154, 53087.641975308645, 51163.78189300412, 49516.97530864197, 47414.633744855964, 45655.49382716049, 44251.732510288064, 166069700.0]
{'val_loss': [740.4356377868652, 554.5608473663331, 500.53510581207274, 444.23562162780763, 386.84414321899413, 352.61099767303466, 380.2281141281128, 323.9293266143799, 308.8651661834717, 390.12244201660155, 247.4940265197754, 240.37224586486818, 275.68635500335694, 247.63808471679687, 188.34335404586793, 211.72711323547364, 202.80886013793946, 224.72627723312377], 'val_Up_Down_loss': [1058.7167567138672, 1184.4339776611328, 1075.0666964111329, 1120.817419921875, 1109.0921221923827, 1058.4103623046874, 1010.2190246582031, 1025.0325467529296, 1000.6320130615235, 896.468689453125, 936.92821484375, 873.9644613037109, 865.6611564941406, 853.0438068237305, 782.1655249023438, 745.3971708984375, 741.7550567626953, 711.031053527832], 'val_bias_loss': [83090.1070859375, 81342.8729609375, 79540.20603125, 77790.9581484375, 76256.1026015625, 73883.2776953125, 71974.376203125, 69784.753078125, 67905.1711953125, 65933.178265625, 63441.3779921875, 61473.66190234375, 59204.147171875, 57223.63433203125, 55286.84421484375, 52924.26851953125, 51839.16007421875, 49665.31623828125], 'loss': [1830.2246379381345, 671.2147698265044, 570.7054764861433, 497.25313538288384, 438.52342323805567, 391.1982928539009, 357.2877313335246, 337.0878782429322, 300.2959526340657, 284.5379903336121, 265.37045080475355, 252.6840390344706, 243.63623915483922, 233.41988964532138, 231.4636203683453, 220.88466376826597, 208.4154851014722, 203.50927339463567], 'Up_Down_loss': [752.6059995619848, 963.1776767777808, 961.6161517704465, 946.8789959346316, 928.8138503243404, 911.6451084466628, 882.4577407051997, 856.2517247455111, 835.1123520180031, 807.0154728359646, 785.2256387310264, 757.833614522047, 730.3830960748618, 706.8791826193225, 677.2116595609689, 652.5060270019029, 632.467581752887, 610.6444127353622], 'bias_loss': [70945.44368991931, 69190.65937158404, 67788.33013941134, 66332.78271986722, 64925.932308746465, 63784.16342250997, 61709.09361938979, 59904.45137783726, 58394.99531109343, 56496.001738120496, 54955.867790316355, 53087.656445915316, 51163.737843203446, 49516.91910304945, 47414.65993019386, 45655.49199258938, 44251.72663132154, 42713.36783301585]}
