Seed 0
Optimizer
{'lr': 9.999999747378752e-06, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       3200        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       20480       elu_0[0][0]                      
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       20480       elu_1[0][0]                      
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      40960       elu_2[0][0]                      
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        elu_100[0][0]                    
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       elu_101[0][0]                    
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           elu_111[0][0]                    
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       elu_102[0][0]                    
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
Flatten (Flatten)               (None, 1152)         0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Dense)                 (None, 360)          415080      Flatten[0][0]                    
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 360)          0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (None, 90)           32490       tanh_d_0[0][0]                   
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 90)           0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 10)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 138)       0           Reshape[0][0]                    
                                                                 elu_112[0][0]                    
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 138)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       26560       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       elu_200[0][0]                    
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           elu_210[0][0]                    
                                                                 elu_111[0][0]                    
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       elu_201[0][0]                    
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           elu_211[0][0]                    
                                                                 elu_110[0][0]                    
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 128)      98432       elu_202[0][0]                    
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 128)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 256)      327680      elu_212[0][0]                    
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 256)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 32)       40960       elu_300[0][0]                    
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 32)       0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        192         elu_301[0][0]                    
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
==================================================================================================
Total params: 1,336,146
Trainable params: 1,336,146
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128], [30, 30, 50, 50, 128, 128], [40, 10], [64, 64, 128, 128, 128, 128], [256, 32, 2]]
list_of_kernel_unet =  [[10, 10, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0]]
loss
[0.0, 5.204876683867027, 3.069919162326389, 2.822726277166924, 2.7078905144836676, 2.616604275173611, 2.536927776572145, 2.502683035140175, 2.474537539384002, 2.405243296682099, 2.3778648847415123, 2.3632912969393005, 2.321325482654964, 2.3059476373617542, 2.306900840727881, 2.329808364679784, 2.3130957835005144, 2.2931990760834617, 2.2930752475565845, 2.272149984728652, 8804.251]
{'val_loss': [3.096005129575729, 2.7350361807346344, 2.5949850777983667, 2.519665130019188, 2.474675194978714, 2.428848788321018, 2.396243196427822, 2.4024187182784082, 2.3429394483566286, 2.333371149480343, 2.345238549143076, 2.2908061945140363, 2.2676820662915707, 2.2578400385677813, 2.2667999832332133, 2.292293477833271, 2.243487449377775, 2.25119963221252, 2.269060535430908, 2.2579228112399576], 'val_Up_Down_loss': [3.056383291363716, 2.6966838586330413, 2.5570828570127486, 2.482257323086262, 2.437721988737583, 2.392167830467224, 2.3595771926641462, 2.365961768060923, 2.3064030195474623, 2.2966663195490837, 2.308650921076536, 2.2544673609733583, 2.231165592908859, 2.2217896094322205, 2.2304400356411933, 2.2561597228944303, 2.2073706468045713, 2.215341315716505, 2.233189120709896, 2.2217348600029947], 'val_Cum_Down_loss': [31.375309623718262, 25.13516718482971, 22.83555895137787, 22.01286589050293, 24.20884378814697, 20.398099776268005, 19.929864437580108, 20.043877142429352, 19.622418597221376, 19.71479230594635, 19.015727184295653, 19.491574716567992, 18.84498379611969, 18.10359064245224, 18.252743610858918, 18.840765312194826, 17.703948968410494, 18.44526222729683, 17.74932077050209, 18.38631817150116], 'loss': [5.204877292852343, 3.0699170255427988, 2.8227281384629967, 2.70788861066103, 2.616606092686025, 2.5369267705597993, 2.502682942360517, 2.474542675348221, 2.4052484744676836, 2.3778636755245457, 2.3632933528396327, 2.321324879096614, 2.3059481576146412, 2.306902223285824, 2.329806503368381, 2.3130960737358888, 2.293198889956921, 2.2930720273114034, 2.272148339438095, 2.2644646245786926], 'Up_Down_loss': [5.163541580270593, 3.0306829271431814, 2.784419367250837, 2.669935530933088, 2.5791737826794017, 2.4997134090021804, 2.4656884647415254, 2.4376461139799637, 2.3685389473543736, 2.341366304628888, 2.3267983401753773, 2.2850435686148245, 2.2697322474554977, 2.27042880988538, 2.293343845954157, 2.2766224041335867, 2.2568183854498245, 2.2567878601758324, 2.235800737154827, 2.2283539908627668], 'Cum_Down_loss': [183.25777313934924, 33.4704078909301, 28.68255928269139, 27.01518038810526, 25.957964750964944, 25.088958865698473, 24.426145568060775, 23.950575305601205, 23.315402811201512, 22.81649477626561, 22.77801252368056, 22.197302104759608, 21.929372613567384, 21.99216388662656, 22.28455999530392, 21.916107881584285, 21.603156045999057, 21.700815718237756, 21.340737250484068, 21.488357518435507]}
