Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       9600        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 72, 32)       0           elu_0[0][0]                      
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_2 (SpatialDro (None, 72, 64)       0           elu_1[0][0]                      
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_2[0][0]        
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_3 (SpatialDro (None, 72, 64)       0           elu_2[0][0]                      
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_3[0][0]        
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 72, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_4 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
elu_4 (ELU)                     (None, 72, 128)      0           Conv_4[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_5 (SpatialDro (None, 72, 128)      0           elu_4[0][0]                      
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           spatial_dropout1d_5[0][0]        
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_6 (SpatialDro (None, 36, 30)       0           elu_100[0][0]                    
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        spatial_dropout1d_6[0][0]        
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_7 (SpatialDro (None, 36, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_8 (SpatialDro (None, 18, 50)       0           elu_101[0][0]                    
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       spatial_dropout1d_8[0][0]        
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_9 (SpatialDro (None, 18, 50)       0           elu_111[0][0]                    
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_10 (SpatialDr (None, 9, 128)       0           elu_102[0][0]                    
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       spatial_dropout1d_10[0][0]       
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_11 (SpatialDr (None, 9, 128)       0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Conv1D)                (None, 9, 50)        57650       spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 9, 50)        0           Dense_0[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_12 (SpatialDr (None, 9, 50)        0           tanh_d_0[0][0]                   
__________________________________________________________________________________________________
Dense_1 (Conv1D)                (None, 9, 20)        9020        spatial_dropout1d_12[0][0]       
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 9, 20)        0           Dense_1[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_13 (SpatialDr (None, 9, 20)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 148)       0           spatial_dropout1d_13[0][0]       
                                                                 spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 148)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       28480       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_14 (SpatialDr (None, 18, 64)       0           elu_200[0][0]                    
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       spatial_dropout1d_14[0][0]       
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_15 (SpatialDr (None, 18, 64)       0           elu_210[0][0]                    
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           spatial_dropout1d_15[0][0]       
                                                                 spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_16 (SpatialDr (None, 36, 128)      0           elu_201[0][0]                    
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       spatial_dropout1d_16[0][0]       
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_17 (SpatialDr (None, 36, 128)      0           elu_211[0][0]                    
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           spatial_dropout1d_17[0][0]       
                                                                 spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_18 (SpatialDr (None, 72, 128)      0           elu_202[0][0]                    
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      196864      spatial_dropout1d_18[0][0]       
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_19 (SpatialDr (None, 72, 256)      0           elu_212[0][0]                    
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 512)      1310720     spatial_dropout1d_19[0][0]       
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 512)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_20 (SpatialDr (None, 72, 512)      0           elu_300[0][0]                    
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      327680      spatial_dropout1d_20[0][0]       
__________________________________________________________________________________________________
Flat_0 (Flatten)                (None, 180)          0           spatial_dropout1d_13[0][0]       
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Dense_200 (Dense)               (None, 50)           9050        Flat_0[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_21 (SpatialDr (None, 72, 128)      0           elu_301[0][0]                    
__________________________________________________________________________________________________
elu_d2_0 (ELU)                  (None, 50)           0           Dense_200[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         spatial_dropout1d_21[0][0]       
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 50)           0           elu_d2_0[0][0]                   
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
__________________________________________________________________________________________________
Dense_201 (Dense)               (None, 1)            51          dropout_1[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_22 (SpatialDr (None, 72, 2)        0           linear_302[0][0]                 
__________________________________________________________________________________________________
linear_d2_1 (Activation)        (None, 1)            0           Dense_201[0][0]                  
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 72)           0           spatial_dropout1d_22[0][0]       
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1)            0           linear_d2_1[0][0]                
__________________________________________________________________________________________________
Concat (Concatenate)            (None, 73)           0           lambda_1[0][0]                   
                                                                 dropout_2[0][0]                  
==================================================================================================
Total params: 2,505,275
Trainable params: 2,505,275
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128, 128], [30, 30, 50, 50, 128, 128], [50, 20], [64, 64, 128, 128, 128, 256], [512, 128, 2], [50, 1]]
list_of_kernel_unet =  [[30, 20, 10, 10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3], []]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear'], ['elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0], [0.0, 0]]
loss
[0.0, 1789.3657407407406, 262.49508101851853, 211.84628986625515, 182.25263631687244, 163.85157857510288, 145.06635802469137, 132.48005883487653, 124.25935570987654, 112.55189846965021, 105.94945183899176, 99.72703671553498, 93.31120595421811, 88.44893743569959, 85.1643197016461, 82.47663483796296, 77.92885963220165, 74.65237590020575, 72.95172646604938, 70.19051408179013, 269910.3]
Up_Down_loss
[0.0, 96.09987461419753, 48.77843685699588, 42.869466145833336, 38.46535011574074, 34.95996897505144, 31.97312845614712, 29.531555426954732, 27.293330439814813, 25.015799816743826, 23.090683674125515, 21.680503311471192, 20.30957232188786, 19.30395809220679, 18.395656507201647, 17.819225421167694, 17.074855725951647, 16.32349537037037, 15.860177750450102, 15.39942009066358, 58120.523]
bias_loss
[0.0, 6478.619855967078, 218.2000385802469, 182.64964313271605, 161.14409722222223, 145.35119277263374, 129.0113570601852, 117.40035043724279, 111.39461966306584, 99.64420171039094, 92.76045685442386, 87.68764467592592, 81.91909400720165, 78.01953928755144, 74.78036586934157, 73.2393180941358, 69.53192515432099, 66.03804574974279, 64.02045556841564, 62.04859905478395, 236145.67]
{'val_loss': [267.9814178924561, 220.7500047531128, 220.21937857055664, 159.22184967041017, 203.15563233947753, 136.8616056213379, 162.59006760025025, 202.45264868927, 120.66991570281982, 106.31146646118164, 89.11048910522462, 127.44210442352295, 98.74712257766724, 88.5050232887268, 74.40409550476075, 88.3781513671875, 69.44385567092895, 84.39715954589843, 108.91065309906006, 70.3569896621704], 'val_Up_Down_loss': [56.97098665618896, 49.02231310653686, 43.83254043006897, 39.28048348045349, 35.59928794670105, 32.579870515823366, 29.578715047836305, 27.648771797180174, 25.01146432495117, 22.917422234535216, 21.685873805046082, 19.75638966655731, 19.879537093162536, 18.32749699306488, 16.9863360414505, 16.480609483718872, 15.806178637504578, 16.655694990158082, 14.891011464118957, 14.85724729347229], 'val_bias_loss': [284.14111280441284, 225.60652554321288, 179.01747794151305, 151.75518494081498, 228.35564584350587, 126.03596627807617, 155.56900626373292, 136.13313313293457, 95.12786908912659, 105.97277169513703, 86.82745641970635, 116.92374139404296, 80.64014994239807, 81.30456979751587, 69.23016670227051, 79.9876580734849, 64.05906730651856, 87.99617912077903, 67.41333542512358, 62.23440808224678], 'loss': [1789.3702050158026, 262.4947044780715, 211.8466706766513, 182.2526184737437, 163.85110052132313, 145.06638509452097, 132.4802396660479, 124.25921653523858, 112.55178455364558, 105.94939517876739, 99.72722249953344, 93.31115255041868, 88.44889220386867, 85.16423956700314, 82.47673803445242, 77.92884609875856, 74.65246364609204, 72.95179938632275, 70.1904353987533, 69.4213068652055], 'Up_Down_loss': [96.09979918218934, 48.77844140019437, 42.869409592553914, 38.4652865315661, 34.9599425758354, 31.973185778154757, 29.531546025609774, 27.293344697589248, 25.015791878533463, 23.090707176997338, 21.68049012437279, 20.309554096112034, 19.303960902210125, 18.39568698062818, 17.8192000080038, 17.074844986200333, 16.32350619989658, 15.860177413794238, 15.399432408588904, 14.948675529947007], 'bias_loss': [6478.624800868486, 218.2001097859669, 182.64978500550666, 161.14415156154476, 145.35112767651248, 129.0115381209448, 117.40046558360504, 111.39472420323533, 99.64402952115722, 92.76045299434858, 87.68764904570678, 81.91919198055817, 78.01971646542411, 74.7803548833225, 73.23934207875051, 69.53191375070148, 66.03803649311693, 64.02045911722223, 62.04859554963838, 60.737134892754106]}
