Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       9600        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 72, 32)       0           elu_0[0][0]                      
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_2 (SpatialDro (None, 72, 64)       0           elu_1[0][0]                      
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_2[0][0]        
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_3 (SpatialDro (None, 72, 64)       0           elu_2[0][0]                      
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_3[0][0]        
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 72, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_4 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
elu_4 (ELU)                     (None, 72, 128)      0           Conv_4[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_5 (SpatialDro (None, 72, 128)      0           elu_4[0][0]                      
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           spatial_dropout1d_5[0][0]        
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_6 (SpatialDro (None, 36, 30)       0           elu_100[0][0]                    
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        spatial_dropout1d_6[0][0]        
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_7 (SpatialDro (None, 36, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_8 (SpatialDro (None, 18, 50)       0           elu_101[0][0]                    
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       spatial_dropout1d_8[0][0]        
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_9 (SpatialDro (None, 18, 50)       0           elu_111[0][0]                    
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_10 (SpatialDr (None, 9, 128)       0           elu_102[0][0]                    
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       spatial_dropout1d_10[0][0]       
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_11 (SpatialDr (None, 9, 128)       0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Conv1D)                (None, 9, 50)        57650       spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 9, 50)        0           Dense_0[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_12 (SpatialDr (None, 9, 50)        0           tanh_d_0[0][0]                   
__________________________________________________________________________________________________
Dense_1 (Conv1D)                (None, 9, 20)        9020        spatial_dropout1d_12[0][0]       
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 9, 20)        0           Dense_1[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_13 (SpatialDr (None, 9, 20)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 148)       0           spatial_dropout1d_13[0][0]       
                                                                 spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 148)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       28480       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_14 (SpatialDr (None, 18, 64)       0           elu_200[0][0]                    
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       spatial_dropout1d_14[0][0]       
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_15 (SpatialDr (None, 18, 64)       0           elu_210[0][0]                    
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           spatial_dropout1d_15[0][0]       
                                                                 spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_16 (SpatialDr (None, 36, 128)      0           elu_201[0][0]                    
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       spatial_dropout1d_16[0][0]       
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_17 (SpatialDr (None, 36, 128)      0           elu_211[0][0]                    
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           spatial_dropout1d_17[0][0]       
                                                                 spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_18 (SpatialDr (None, 72, 128)      0           elu_202[0][0]                    
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      196864      spatial_dropout1d_18[0][0]       
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_19 (SpatialDr (None, 72, 256)      0           elu_212[0][0]                    
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 512)      1310720     spatial_dropout1d_19[0][0]       
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 512)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_20 (SpatialDr (None, 72, 512)      0           elu_300[0][0]                    
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      327680      spatial_dropout1d_20[0][0]       
__________________________________________________________________________________________________
Flat_0 (Flatten)                (None, 180)          0           spatial_dropout1d_13[0][0]       
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Dense_200 (Dense)               (None, 50)           9050        Flat_0[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_21 (SpatialDr (None, 72, 128)      0           elu_301[0][0]                    
__________________________________________________________________________________________________
elu_d2_0 (ELU)                  (None, 50)           0           Dense_200[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         spatial_dropout1d_21[0][0]       
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 50)           0           elu_d2_0[0][0]                   
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
__________________________________________________________________________________________________
Dense_201 (Dense)               (None, 1)            51          dropout_1[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_22 (SpatialDr (None, 72, 2)        0           linear_302[0][0]                 
__________________________________________________________________________________________________
linear_d2_1 (Activation)        (None, 1)            0           Dense_201[0][0]                  
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 72)           0           spatial_dropout1d_22[0][0]       
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1)            0           linear_d2_1[0][0]                
__________________________________________________________________________________________________
Concat (Concatenate)            (None, 73)           0           lambda_1[0][0]                   
                                                                 dropout_2[0][0]                  
==================================================================================================
Total params: 2,505,275
Trainable params: 2,505,275
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128, 128], [30, 30, 50, 50, 128, 128], [50, 20], [64, 64, 128, 128, 128, 256], [512, 128, 2], [50, 1]]
list_of_kernel_unet =  [[30, 20, 10, 10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3], []]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear'], ['elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0], [0.0, 0]]
loss
[0.0, 3072.0812757201647, 445.0882844650206, 371.3005401234568, 325.40544624485597, 295.9772055041152, 267.8327867798354, 245.27679719650206, 233.55148855452674, 208.1693029835391, 196.62212255658437, 186.5280028292181, 175.6409625771605, 167.87954925411523, 160.8086902006173, 161.0404931841564, 86901.414]
Full_Loss
[0.0, 3310.6262860082306, 613.1727109053498, 519.5192258230453, 458.38908179012344, 417.5952610596708, 377.36275077160496, 344.9683641975309, 328.71109825102883, 294.4782343106996, 277.0812757201646, 263.44984567901236, 248.53663515946502, 238.15247235082305, 227.67853009259258, 227.7748681841564, 123451.016]
Up_Down_loss
[0.0, 76.64874292695474, 48.89769804526749, 41.645290798611114, 37.30690586419753, 34.25131815843621, 31.857785574202676, 29.81684228716564, 27.828623328189302, 25.74340518904321, 24.062867717978396, 22.74712858474794, 21.36447884516461, 20.44185635288066, 19.51492171424897, 18.997649016203702, 10612.559]
bias_loss
[0.0, 2285.009516460905, 204.42563657407408, 179.90623392489712, 159.77932098765433, 146.53978587962962, 133.33225630144034, 122.32865547839506, 117.16440811471193, 103.20087448559671, 98.2056970164609, 93.0612622170782, 87.9289882330247, 84.00770801183127, 80.8895881558642, 81.6995563271605, 43497.332]
