Seed 0
Optimizer
{'lr': 4.999999873689376e-06, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       9600        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       elu_0[0][0]                      
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       40960       elu_1[0][0]                      
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      81920       elu_2[0][0]                      
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
Conv_4 (Conv1D)                 (None, 72, 128)      81920       elu_3[0][0]                      
__________________________________________________________________________________________________
elu_4 (ELU)                     (None, 72, 128)      0           Conv_4[0][0]                     
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           elu_4[0][0]                      
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        elu_100[0][0]                    
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       elu_101[0][0]                    
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           elu_111[0][0]                    
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       elu_102[0][0]                    
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
Flatten (Flatten)               (None, 1152)         0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Dense)                 (None, 450)          518850      Flatten[0][0]                    
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 450)          0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (None, 180)          81180       tanh_d_0[0][0]                   
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 180)          0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 20)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 148)       0           Reshape[0][0]                    
                                                                 elu_112[0][0]                    
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 148)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       28480       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       elu_200[0][0]                    
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           elu_210[0][0]                    
                                                                 elu_111[0][0]                    
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       elu_201[0][0]                    
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           elu_211[0][0]                    
                                                                 elu_110[0][0]                    
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      196864      elu_202[0][0]                    
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 512)      1310720     elu_212[0][0]                    
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 512)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      327680      elu_300[0][0]                    
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         elu_301[0][0]                    
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
==================================================================================================
Total params: 3,029,534
Trainable params: 3,029,534
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128, 128], [30, 30, 50, 50, 128, 128], [50, 20], [64, 64, 128, 128, 128, 256], [512, 128, 2]]
list_of_kernel_unet =  [[30, 20, 10, 10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0]]
loss
[0.0, 11.806507000707304, 11.644332320601851, 11.399467311278292, 11.299923241383745, 11.162454989711934, 10.914977776170268, 10.805088372878087, 10.681732052147634, 10.341751663773149, 10.11059972190072, 10.02589799543467, 9.8129681873714, 9.735641919045781, 9.576825930748457, 9.540696132330247, 9.429982880015432, 9.183763543274177, 9.068047919881687, 8.878948447145062, 8.75803956082819, 8.647740242412551, 8.474549093364198, 8.396274393968621, 8.201010119277264, 31678.299]
{'val_loss': [11.377232626914978, 11.359275594234466, 11.269707436561584, 11.525444479942323, 10.93277829360962, 10.824740744113923, 10.573110918045044, 10.397479153633117, 10.37185561132431, 10.518242580890655, 10.011946991443635, 9.764412001609802, 9.651404524803162, 9.364870394706726, 9.50914366197586, 9.128028005123138, 9.13100262928009, 8.760069003582, 8.768645913600922, 8.633595618724822, 8.420464836597443, 8.335378264427185, 8.17213847398758, 7.932257220745087, 7.812639040470123], 'val_Up_Down_loss': [11.376263356208801, 11.358305288314819, 11.268736980438232, 11.524473896026612, 10.931806638717651, 10.82376905155182, 10.572138653755188, 10.396506147384644, 10.37088222360611, 10.517268969535827, 10.010973202228547, 9.763437205791474, 9.650429185390472, 9.363894393920898, 9.508167465686798, 9.1270513548851, 9.130025068759918, 8.75909124135971, 8.767668124198913, 8.632617136478425, 8.419486117839813, 8.33439946269989, 8.171158609867096, 7.931276891708374, 7.811658044815063], 'val_Cum_Down_loss': [110.71414866828918, 110.940494140625, 114.07781712722779, 261.80912252807616, 110.77479390144349, 110.52276504898072, 151.87346770477296, 98.28879520225524, 102.58209000778199, 120.05633346557617, 95.00926588821412, 98.74083374404907, 88.30790475845338, 88.32250909423828, 119.9425901260376, 110.31544850921631, 102.06252771949768, 83.16740488815307, 91.93428996086121, 122.1089345703125, 82.3798683013916, 85.24911590576171, 82.3746541595459, 69.59971193885804, 92.5144365272522], 'loss': [11.806503062385591, 11.64433502378287, 11.399469644199183, 11.29992052728747, 11.1624353180329, 10.914978086948395, 10.805089629726645, 10.681732777337478, 10.341735170333964, 10.110594670958971, 10.02590539781645, 9.812969177102847, 9.73561676711212, 9.576837442600677, 9.540704674497553, 9.429999437781028, 9.18375846571883, 9.068038721143463, 8.878944927834189, 8.758032270726353, 8.64773528204288, 8.474554300246906, 8.396272744968105, 8.201009310873939, 8.147720789283882], 'Up_Down_loss': [11.805533517657974, 11.643364695609842, 11.398498989304397, 11.29894985399619, 11.161464348128794, 10.914006338197998, 10.80411756124516, 10.680759452498009, 10.340761736955171, 10.109621017558094, 10.024931622753417, 9.811995064402804, 9.734641515055802, 9.575861896507043, 9.539728408733023, 9.429022919003366, 9.182781104197717, 9.06706119503504, 8.877967227694919, 8.757054352956544, 8.646756649323942, 8.473575615711173, 8.395293569920485, 8.200029108014126, 8.146740216041298], 'Cum_Down_loss': [134.53728104324497, 131.41625974502094, 127.0867928418603, 127.00550857885385, 125.81282382246889, 120.6276615656943, 118.04935541761265, 116.86295496289132, 112.7376732585852, 110.88601718027405, 109.75093534797307, 106.18343276889236, 104.04525168344317, 101.47964525124664, 100.30940304322498, 99.42777129259619, 95.56568810282421, 94.29371481226305, 92.95333792594235, 89.92286285353296, 89.03778803986286, 86.74533710411056, 85.34849481082257, 83.70977257455817, 84.1009057387403]}
