Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

o3 : type : Level_Normalizer 
fitted : True 
values : [ 1.5178547   0.4859575   0.13512056  0.00546122 -0.12304485 -0.2245656
 -0.28646666 -0.30685493 -0.29715014 -0.25675038 -0.18726334 -0.08862133
  0.04254093  0.20168397  0.396791    0.6326498   0.89178973  1.164369
  1.4541614   1.7227275   1.9611518   2.1315734   2.1997576   2.1855445
  2.1296737   2.0289721   1.8617861   1.6176039   1.3109899   0.9857326
  0.669009    0.3587962   0.07577984 -0.1339541  -0.30950537 -0.4462536
 -0.5478872  -0.60752857 -0.6411809  -0.6589909  -0.67667884 -0.69653
 -0.71816367 -0.7356652  -0.7453311  -0.7489238  -0.7501921  -0.75091916
 -0.75141084 -0.75185525 -0.7523236  -0.75278234 -0.7532052  -0.75363714
 -0.7539908  -0.754272   -0.7545589  -0.7548432  -0.7551413  -0.75541395
 -0.7556355  -0.7558373  -0.75604194 -0.75624406 -0.75643086 -0.75659657
 -0.75673807 -0.75684655 -0.7569279  -0.75699836 -0.7570599  -0.7571092 ] 
  
pl : type : Level_Normalizer 
fitted : True 
values : [-0.8469185  -0.8469151  -0.8469045  -0.84675324 -0.8467394  -0.8466971
 -0.84667975 -0.84662426 -0.8464538  -0.8459983  -0.8457733  -0.84564656
 -0.84500474 -0.84466666 -0.84376764 -0.84284407 -0.8418144  -0.84059626
 -0.83887076 -0.83691293 -0.8342804  -0.83134115 -0.82805306 -0.8235312
 -0.81843543 -0.81251466 -0.80543023 -0.7968753  -0.78686637 -0.7750721
 -0.7609886  -0.74478245 -0.7255684  -0.70310795 -0.67676324 -0.646176
 -0.61043346 -0.56877786 -0.51962286 -0.46191353 -0.39400518 -0.3140806
 -0.22035415 -0.11040513  0.01675914  0.13593628  0.23868622  0.34139135
  0.44405127  0.5466785   0.6492845   0.7518655   0.8544333   0.95698667
  1.042439    1.1107923   1.1791455   1.2474941   1.3158385   1.377349
  1.4251871   1.466188    1.5071874   1.5481895   1.5891905   1.6301885
  1.6711955   1.7121851   1.753188    1.7941831   1.835184    1.8762577 ] 
  
q : type : Level_Normalizer 
fitted : True 
values : [8.30325589e-05 9.93670474e-05 1.30244924e-04 1.53031724e-04
 1.66769518e-04 1.74681161e-04 1.80740142e-04 1.85819561e-04
 1.90293300e-04 1.94039778e-04 1.96783760e-04 1.98227193e-04
 1.98072798e-04 1.94902255e-04 1.89183353e-04 1.85522964e-04
 1.81042313e-04 1.76802831e-04 1.72134460e-04 1.67060280e-04
 1.61786709e-04 1.57398987e-04 1.54074020e-04 1.51035871e-04
 1.48050196e-04 1.45007260e-04 1.42327626e-04 1.40182528e-04
 1.38545467e-04 1.37245821e-04 1.35919297e-04 1.34164351e-04
 1.31694411e-04 1.28424886e-04 1.23427075e-04 1.19225697e-04
 1.19097116e-04 1.32865360e-04 1.77492111e-04 3.13013385e-04
 6.48844929e-04 1.42204168e-03 3.06227198e-03 6.15908206e-03
 1.13856578e-02 1.80197209e-02 2.53234413e-02 3.42310555e-02
 4.55139615e-02 5.96591048e-02 7.63898268e-02 9.44102332e-02
 1.13610178e-01 1.35784507e-01 1.56229064e-01 1.73917443e-01
 1.92157611e-01 2.11400241e-01 2.33589292e-01 2.57347316e-01
 2.80018628e-01 3.03705007e-01 3.30073327e-01 3.57465535e-01
 3.84411752e-01 4.10704106e-01 4.33816880e-01 4.52279001e-01
 4.66513813e-01 4.78091329e-01 4.89531875e-01 5.03859699e-01] 
  

type : Var Supression 
 values : ['ts', 'ri', 'rl', 'frocean', 'frlake', 'frland', 'frlandice', 'frseaice'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 72, 8)             0         
_________________________________________________________________
up_sampling1d_3 (UpSampling1 (None, 360, 8)            0         
_________________________________________________________________
average_pooling1d_3 (Average (None, 72, 8)             0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 8)        0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       2560        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       20480       elu_0[0][0]                      
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       20480       elu_1[0][0]                      
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      40960       elu_2[0][0]                      
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        elu_100[0][0]                    
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       elu_101[0][0]                    
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           elu_111[0][0]                    
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       elu_102[0][0]                    
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
Flatten (Flatten)               (None, 1152)         0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Dense)                 (None, 360)          415080      Flatten[0][0]                    
__________________________________________________________________________________________________
sigmoid_d_0 (Activation)        (None, 360)          0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (None, 90)           32490       sigmoid_d_0[0][0]                
__________________________________________________________________________________________________
sigmoid_d_1 (Activation)        (None, 90)           0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 10)        0           sigmoid_d_1[0][0]                
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 138)       0           Reshape[0][0]                    
                                                                 elu_112[0][0]                    
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 138)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       26560       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       elu_200[0][0]                    
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           elu_210[0][0]                    
                                                                 elu_111[0][0]                    
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       elu_201[0][0]                    
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           elu_211[0][0]                    
                                                                 elu_110[0][0]                    
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 128)      98432       elu_202[0][0]                    
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 128)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 150)      192000      elu_212[0][0]                    
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 150)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 32)       24000       elu_300[0][0]                    
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 32)       0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 10)       1600        elu_301[0][0]                    
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 10)       0           Conv3_302[0][0]                  
==================================================================================================
Total params: 1,184,274
Trainable params: 1,184,274
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_RC0 (InputLayer)          (None, 10, 72)       0                                            
__________________________________________________________________________________________________
Last_flatten (Flatten)          (None, 720)          0           Input_RC0[0][0]                  
__________________________________________________________________________________________________
Last_Dense_0 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
Last_Dense_1 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 72, 1)        0           Last_Dense_0[0][0]               
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 72, 1)        0           Last_Dense_1[0][0]               
__________________________________________________________________________________________________
Last_Concat (Concatenate)       (None, 72, 2)        0           reshape_3[0][0]                  
                                                                 reshape_4[0][0]                  
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 72)           0           Last_Concat[0][0]                
==================================================================================================
Total params: 103,824
Trainable params: 0
Non-trainable params: 103,824
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128], [30, 30, 50, 50, 128, 128], [40, 10], [64, 64, 128, 128, 128, 128], [150, 32, 10]]
list_of_kernel_unet =  [[10, 10, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 5]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['sigmoid', 'sigmoid', 'sigmoid'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
loss
[0.0, 38.49616206918724, 27.31572305812757, 22.636027520576132, 20.381530510545268, 18.531374582047324, 16.447899586869855, 15.312536168981481, 14.551192169817387, 13.594344778806585, 12.972129790380658, 12.776514877507717, 12.126898871527779, 11.51221406410751, 11.34445529513889, 10.89013571405607, 10.500795717592593, 10.10157355163323, 9.707647127379115, 9.510319211355453, 9.252122918274177, 8.898523903677983, 8.688509717399691, 8.671432934670781, 8.430735395769032, 8.031303751125257, 7.840732904128086, 7.724436065297068, 7.609042446309156, 7.447882507073046, 7.05456743907536, 6.900709615322788, 6.762956532921811, 6.559953100887346, 6.400237911522634, 6.41295582963606, 6.278783978748714, 6.085750124582047, 6.110620820473251, 5.989324624646348, 5.874984427244084, 5.741897645801183, 5.574471430523405, 5.563399201067387, 5.450150101273148, 5.305340551054527, 5.22022890946502, 5.2772317266268, 5.203736858603395, 4.9461594569830245, 4.865069605195473, 4.847233776202418, 4.845148533950617, 4.768617480870628, 4.554743762860082, 4.492147312242798, 4.4251528139467595, 4.367755152070473, 4.288547594360854, 4.313444412294238, 4.2455778396669235, 4.153794779208462, 4.189824108233668, 4.164996865354938, 4.102163306970165, 4.065639166184414, 3.9754711512184926, 3.977997202932099, 3.9419774184992282, 3.865009574733153, 3.8245801886413324, 3.891027631092464, 3.888043690120242, 7219.7734]
