Seed 0
Optimizer
{'lr': 4.999999873689376e-06, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       9600        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       elu_0[0][0]                      
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       40960       elu_1[0][0]                      
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      81920       elu_2[0][0]                      
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
Conv_4 (Conv1D)                 (None, 72, 128)      81920       elu_3[0][0]                      
__________________________________________________________________________________________________
elu_4 (ELU)                     (None, 72, 128)      0           Conv_4[0][0]                     
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           elu_4[0][0]                      
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        elu_100[0][0]                    
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       elu_101[0][0]                    
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           elu_111[0][0]                    
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       elu_102[0][0]                    
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
Flatten (Flatten)               (None, 1152)         0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Dense)                 (None, 450)          518850      Flatten[0][0]                    
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 450)          0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (None, 180)          81180       tanh_d_0[0][0]                   
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 180)          0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 20)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 148)       0           Reshape[0][0]                    
                                                                 elu_112[0][0]                    
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 148)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       28480       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       elu_200[0][0]                    
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           elu_210[0][0]                    
                                                                 elu_111[0][0]                    
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       elu_201[0][0]                    
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           elu_211[0][0]                    
                                                                 elu_110[0][0]                    
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      196864      elu_202[0][0]                    
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 512)      1310720     elu_212[0][0]                    
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 512)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      327680      elu_300[0][0]                    
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         elu_301[0][0]                    
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
==================================================================================================
Total params: 3,029,534
Trainable params: 3,029,534
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128, 128], [30, 30, 50, 50, 128, 128], [50, 20], [64, 64, 128, 128, 128, 256], [512, 128, 2]]
list_of_kernel_unet =  [[30, 20, 10, 10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0]]
loss
[0.0, 7.9883852358217595, 7.861611448688271, 7.744241094393004, 7.646881731449331, 7.542151933834877, 7.387043266139403, 7.338322141042953, 7.248824508101852, 7.055766541280864, 6.907411928530093, 6.868912559477881, 6.731674382716049, 6.711935663419496, 6.63439338589892, 6.658973222897377, 6.555524410043724, 6.456606264467593, 6.384711371527778, 6.29651079845036, 6.2766901965985085, 6.2161076549639915, 6.124461484053498, 6.123454278388632, 6.015727981127829, 23216.564]
{'val_loss': [7.735585604190827, 7.641739126682282, 7.468446480751037, 7.281039821147918, 7.341735629558563, 7.20786092710495, 7.321633090972901, 6.975209864139557, 6.945722956657409, 6.79105478811264, 6.801239586353302, 6.927204980373382, 6.698606163501739, 6.437862922668457, 6.40463458776474, 6.32750915145874, 6.453868988990783, 6.331275618553161, 6.18570559835434, 6.417973138332367, 6.082853655338288, 6.132085028171539, 6.0903403854370115, 5.86705194568634, 5.790507119655609], 'val_Up_Down_loss': [7.734603952884674, 7.640756860256195, 7.4674638719558715, 7.280056912899017, 7.34075236082077, 7.20687729883194, 7.320648899078369, 6.974225306510926, 6.944738080024719, 6.790069286823273, 6.800253801822662, 6.926218593120575, 6.697619773387909, 6.436875842571259, 6.403646845340729, 6.326520761966705, 6.45288030910492, 6.3302868452072145, 6.184716609477997, 6.416984121799469, 6.081864256858825, 6.131095240592956, 6.089350158691406, 5.8660613641738895, 5.789516017913819], 'val_Cum_Down_loss': [68.2908248910904, 81.79049817276001, 73.98846877384186, 64.12984665203095, 65.96066541290283, 71.19298327636719, 104.39041066741943, 79.88172129821777, 82.75036839675903, 61.23045641899109, 63.86138330078125, 117.2393427810669, 104.71644804382325, 60.94621314811707, 60.78363680267334, 59.60124359893799, 61.958492406845096, 84.43620750808716, 54.257494209289554, 90.00612886810303, 64.29388195419311, 127.43818980407715, 52.66983121490478, 51.33898589134216, 52.47477195739746], 'loss': [7.988387469646862, 7.8616019369030194, 7.744240295065283, 7.646874029695252, 7.542146872039194, 7.387043312743858, 7.338319449390403, 7.248834690071428, 7.055769405553861, 6.907415766468264, 6.8689038995116825, 6.731682532854041, 6.711942678064476, 6.634395052314786, 6.65897008230902, 6.555520507901784, 6.456611648140621, 6.384713623749376, 6.296503478055628, 6.276699635410996, 6.216106376652855, 6.124463268022969, 6.123451624326255, 6.015729141026858, 5.971341521161083], 'Up_Down_loss': [7.9874060862226255, 7.860619775368353, 7.743257844031103, 7.64589108759729, 7.541163752721661, 7.386059965800356, 7.337335573792948, 7.247850306056164, 7.054784660722002, 6.906430683999395, 6.867918048130632, 6.730696404176484, 6.710956398535658, 6.633408506098108, 6.657982761538569, 6.554532272886838, 6.455622961123784, 6.383724795386134, 6.295514614309794, 6.275710664352272, 6.215117203294004, 6.123473438767739, 6.122461497722339, 6.014738674333066, 5.9703506366215615], 'Cum_Down_loss': [80.94652147646303, 79.67554196555919, 78.5263436458729, 78.434024609656, 76.6383092089445, 76.18855262244189, 75.34565498210766, 75.14080206504084, 71.55777760788247, 70.9638687347679, 71.50737802383831, 67.62036492010203, 67.35938430911719, 66.84242187704078, 68.4273734136864, 66.10578944751755, 65.10344239664667, 63.98969204288451, 63.97768368544402, 64.16888323732854, 64.14030364462377, 63.27843778859441, 61.37678614221973, 61.89302915212058, 60.42536662880776]}
