Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

o3 : type : Level_Normalizer 
fitted : True 
values : [ 2.42217422e+00  9.24125612e-01  4.75480229e-01  3.11320782e-01
  1.30965859e-01  7.19414966e-04 -1.23632155e-01 -1.83308631e-01
 -2.02526107e-01 -1.85861558e-01 -1.38955668e-01 -6.56622425e-02
  3.76508534e-02  1.80276036e-01  3.67828816e-01  6.11078620e-01
  8.91765058e-01  1.19877410e+00  1.52268636e+00  1.80458307e+00
  2.05593038e+00  2.23631430e+00  2.34924626e+00  2.39463472e+00
  2.37606001e+00  2.28428960e+00  2.08414674e+00  1.77662921e+00
  1.42999542e+00  1.05131233e+00  6.64941192e-01  2.94635981e-01
 -5.15950285e-02 -2.73875922e-01 -4.31293458e-01 -5.57385623e-01
 -6.62754536e-01 -7.13258326e-01 -7.31015861e-01 -7.38590360e-01
 -7.42724001e-01 -7.45705962e-01 -7.47994781e-01 -7.49416590e-01
 -7.50233948e-01 -7.50710130e-01 -7.50854611e-01 -7.50991166e-01
 -7.51276791e-01 -7.51505256e-01 -7.51703441e-01 -7.52009094e-01
 -7.52501547e-01 -7.53056049e-01 -7.53487170e-01 -7.53832042e-01
 -7.54189849e-01 -7.54623592e-01 -7.55039573e-01 -7.55385160e-01
 -7.55642891e-01 -7.55875170e-01 -7.56070495e-01 -7.56251574e-01
 -7.56433308e-01 -7.56590784e-01 -7.56747723e-01 -7.56884634e-01
 -7.56984890e-01 -7.57067204e-01 -7.57141352e-01 -7.57198274e-01] 
  
pl : type : Level_Normalizer 
fitted : True 
values : [-0.8469185  -0.8469151  -0.8469045  -0.84675324 -0.8467394  -0.8466971
 -0.84667975 -0.84662426 -0.8464538  -0.8459983  -0.8457733  -0.84564656
 -0.84500474 -0.84466666 -0.84376764 -0.84284407 -0.8418144  -0.84059626
 -0.83887076 -0.83691293 -0.8342804  -0.83134115 -0.82805306 -0.8235312
 -0.81843543 -0.81251466 -0.80543023 -0.7968753  -0.78686637 -0.7750721
 -0.7609886  -0.74478245 -0.7255684  -0.70310795 -0.67676324 -0.646176
 -0.61043346 -0.56877786 -0.51962286 -0.46191353 -0.39400518 -0.31397694
 -0.21985923 -0.10910022  0.01928124  0.13977328  0.24375807  0.3477493
  0.45174775  0.5557492   0.6597545   0.76376635  0.8677766   0.9717917
  1.0584728   1.1278173   1.1971599   1.2665088   1.3358529   1.3982637
  1.4468046   1.4884142   1.5300219   1.5716268   1.613241    1.6548504
  1.6964579   1.7380639   1.7796797   1.8212864   1.8628889   1.9044914 ] 
  
q : type : Level_Normalizer 
fitted : True 
values : [9.64008213e-05 1.15149000e-04 1.49862753e-04 1.72607164e-04
 1.83536627e-04 1.86961610e-04 1.89538434e-04 1.92899111e-04
 1.96497756e-04 1.99281902e-04 2.00791314e-04 2.01066534e-04
 1.99597460e-04 1.94965716e-04 1.88140999e-04 1.83874814e-04
 1.78577582e-04 1.73695400e-04 1.68224782e-04 1.62051525e-04
 1.55872054e-04 1.50902677e-04 1.47468119e-04 1.44380392e-04
 1.41199809e-04 1.38613483e-04 1.36194387e-04 1.34281843e-04
 1.32939575e-04 1.31994486e-04 1.31205714e-04 1.29929133e-04
 1.27395295e-04 1.23310601e-04 1.18561446e-04 1.16535302e-04
 1.19192067e-04 1.30298606e-04 1.76435598e-04 3.33299336e-04
 7.38349918e-04 1.70944678e-03 3.51290568e-03 6.83512399e-03
 1.28570125e-02 1.98492836e-02 2.71870811e-02 3.65700424e-02
 4.99990433e-02 6.56701475e-02 8.16732049e-02 9.60484222e-02
 1.18296258e-01 1.46796480e-01 1.71541035e-01 1.95240378e-01
 2.25715622e-01 2.66342998e-01 3.08438092e-01 3.44530195e-01
 3.76314938e-01 4.12581891e-01 4.47522134e-01 4.81431156e-01
 5.14726698e-01 5.42658687e-01 5.68924010e-01 5.92190325e-01
 6.10210598e-01 6.24749184e-01 6.39783323e-01 6.59200311e-01] 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 64)       6400        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 64)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 72, 64)       0           elu_0[0][0]                      
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       dropout_1[0][0]                  
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 72, 64)       0           elu_1[0][0]                      
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       20480       dropout_2[0][0]                  
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 72, 64)       0           elu_2[0][0]                      
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 256)      81920       dropout_3[0][0]                  
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 256)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 72, 256)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 256)      0           dropout_4[0][0]                  
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 60)       30780       AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 60)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 36, 60)       0           elu_100[0][0]                    
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 60)       18060       dropout_5[0][0]                  
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 60)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 36, 60)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 60)       0           dropout_6[0][0]                  
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 100)      12100       AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 100)      0           Conv_101[0][0]                   
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 18, 100)      0           elu_101[0][0]                    
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 100)      50100       dropout_7[0][0]                  
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 100)      0           Conv_111[0][0]                   
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 18, 100)      0           elu_111[0][0]                    
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 100)       0           dropout_8[0][0]                  
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 256)       51456       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 256)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 9, 256)       0           elu_102[0][0]                    
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 256)       262400      dropout_9[0][0]                  
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 256)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 9, 256)       0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Conv1D)                (None, 9, 150)       345750      dropout_10[0][0]                 
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 9, 150)       0           Dense_0[0][0]                    
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 9, 150)       0           tanh_d_0[0][0]                   
__________________________________________________________________________________________________
Dense_1 (Conv1D)                (None, 9, 100)       135100      dropout_11[0][0]                 
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 9, 100)       0           Dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 9, 100)       0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 356)       0           dropout_12[0][0]                 
                                                                 dropout_10[0][0]                 
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 356)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 128)      136832      Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 128)      0           Conv_200[0][0]                   
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 18, 128)      0           elu_200[0][0]                    
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 128)      65664       dropout_13[0][0]                 
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 128)      0           Conv_210[0][0]                   
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 18, 128)      0           elu_210[0][0]                    
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 228)      0           dropout_14[0][0]                 
                                                                 dropout_8[0][0]                  
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 228)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 256)      175360      Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 256)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 36, 256)      0           elu_201[0][0]                    
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 256)      327936      dropout_15[0][0]                 
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 256)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 36, 256)      0           elu_211[0][0]                    
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 316)      0           dropout_16[0][0]                 
                                                                 dropout_6[0][0]                  
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 316)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 256)      242944      Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 256)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 72, 256)      0           elu_202[0][0]                    
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      393472      dropout_17[0][0]                 
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 72, 256)      0           elu_212[0][0]                    
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 256)      655360      dropout_18[0][0]                 
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 256)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 72, 256)      0           elu_300[0][0]                    
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      163840      dropout_19[0][0]                 
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
dropout_20 (Dropout)            (None, 72, 128)      0           elu_301[0][0]                    
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         dropout_20[0][0]                 
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
__________________________________________________________________________________________________
dropout_21 (Dropout)            (None, 72, 2)        0           linear_302[0][0]                 
==================================================================================================
Total params: 3,217,682
Trainable params: 3,217,682
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[64, 64, 64, 256], [60, 60, 100, 100, 256, 256], [150, 100], [128, 128, 256, 256, 256, 256], [256, 128, 2]]
list_of_kernel_unet =  [[10, 10, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
list_of_dropout =  [[0.5, 0.5, 0.5, 0.5], [0.5, 0.5, 0.5, 0.5, 0.5, 0.5], [0.5, 0.5], [0.5, 0.5, 0.5, 0.5, 0.5, 0.5], [0.5, 0, 0]]
loss
[0.0, 15.070683232060185, 11.909826710390947, 17.43261316872428, 14.672165356545781, 17.621393148791153, 14.182466483410494, 11.523315932034466, 11.358315047903806, 9.524619020061728, 14.601398734889404, 16.59840273759002, 11.482630851337449, 15.382727101015947, 13.381882153420781, 11.758021476337449, 13.269567418981481, 12.907158243312757, 11.263553321116255, 13.840881598829732, 11.825319894547325, 12.57764777038323, 11.12378130626286, 12.910751028806585, 14.242109133873457, 67814.03]
