Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       9600        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_1 (SpatialDro (None, 72, 32)       0           elu_0[0][0]                      
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_1[0][0]        
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_2 (SpatialDro (None, 72, 64)       0           elu_1[0][0]                      
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       40960       spatial_dropout1d_2[0][0]        
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_3 (SpatialDro (None, 72, 64)       0           elu_2[0][0]                      
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_3[0][0]        
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_4 (SpatialDro (None, 72, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_4 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_4[0][0]        
__________________________________________________________________________________________________
elu_4 (ELU)                     (None, 72, 128)      0           Conv_4[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_5 (SpatialDro (None, 72, 128)      0           elu_4[0][0]                      
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           spatial_dropout1d_5[0][0]        
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_6 (SpatialDro (None, 36, 30)       0           elu_100[0][0]                    
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        spatial_dropout1d_6[0][0]        
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_7 (SpatialDro (None, 36, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_8 (SpatialDro (None, 18, 50)       0           elu_101[0][0]                    
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       spatial_dropout1d_8[0][0]        
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_9 (SpatialDro (None, 18, 50)       0           elu_111[0][0]                    
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_10 (SpatialDr (None, 9, 128)       0           elu_102[0][0]                    
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       spatial_dropout1d_10[0][0]       
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_11 (SpatialDr (None, 9, 128)       0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Conv1D)                (None, 9, 50)        57650       spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 9, 50)        0           Dense_0[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_12 (SpatialDr (None, 9, 50)        0           tanh_d_0[0][0]                   
__________________________________________________________________________________________________
Dense_1 (Conv1D)                (None, 9, 20)        9020        spatial_dropout1d_12[0][0]       
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 9, 20)        0           Dense_1[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_13 (SpatialDr (None, 9, 20)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 148)       0           spatial_dropout1d_13[0][0]       
                                                                 spatial_dropout1d_11[0][0]       
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 148)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       28480       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_14 (SpatialDr (None, 18, 64)       0           elu_200[0][0]                    
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       spatial_dropout1d_14[0][0]       
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_15 (SpatialDr (None, 18, 64)       0           elu_210[0][0]                    
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           spatial_dropout1d_15[0][0]       
                                                                 spatial_dropout1d_9[0][0]        
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_16 (SpatialDr (None, 36, 128)      0           elu_201[0][0]                    
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       spatial_dropout1d_16[0][0]       
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_17 (SpatialDr (None, 36, 128)      0           elu_211[0][0]                    
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           spatial_dropout1d_17[0][0]       
                                                                 spatial_dropout1d_7[0][0]        
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_18 (SpatialDr (None, 72, 128)      0           elu_202[0][0]                    
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      196864      spatial_dropout1d_18[0][0]       
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_19 (SpatialDr (None, 72, 256)      0           elu_212[0][0]                    
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 512)      1310720     spatial_dropout1d_19[0][0]       
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 512)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_20 (SpatialDr (None, 72, 512)      0           elu_300[0][0]                    
__________________________________________________________________________________________________
Flat_0 (Flatten)                (None, 180)          0           spatial_dropout1d_13[0][0]       
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      327680      spatial_dropout1d_20[0][0]       
__________________________________________________________________________________________________
Dense_200 (Dense)               (None, 50)           9050        Flat_0[0][0]                     
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
elu_d2_0 (ELU)                  (None, 50)           0           Dense_200[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_21 (SpatialDr (None, 72, 128)      0           elu_301[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 50)           0           elu_d2_0[0][0]                   
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         spatial_dropout1d_21[0][0]       
__________________________________________________________________________________________________
Dense_201 (Dense)               (None, 1)            51          dropout_1[0][0]                  
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
__________________________________________________________________________________________________
linear_d2_1 (Activation)        (None, 1)            0           Dense_201[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_22 (SpatialDr (None, 72, 2)        0           linear_302[0][0]                 
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1)            0           linear_d2_1[0][0]                
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 72)           0           spatial_dropout1d_22[0][0]       
__________________________________________________________________________________________________
Concat (Concatenate)            (None, 73)           0           dropout_2[0][0]                  
                                                                 lambda_1[0][0]                   
==================================================================================================
Total params: 2,505,275
Trainable params: 2,505,275
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128, 128], [30, 30, 50, 50, 128, 128], [50, 20], [64, 64, 128, 128, 128, 256], [512, 128, 2], [50, 1]]
list_of_kernel_unet =  [[30, 20, 10, 10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3], []]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear'], ['elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0], [0.0, 0]]
loss
[0.0, 11822.09670781893, 420.79340277777777, 347.5522762345679, 305.07169495884773, 272.4371784979424, 247.17671360596708, 226.8188978909465, 218.31103716563786, 197.6767618312757, 187.5991512345679, 176.82336676954733, 168.10143389917695, 161.77491640946502, 156.0010127314815, 153.41293724279836, 146.50512795781893, 139.57973251028807, 137.10069444444446, 132.70982831790124, 129.44592335390948, 127.51226530349794, 123.6139805169753, 120.3411779835391, 453689.78]
Full_Loss
[0.0, 12082.915637860082, 581.1390174897119, 485.82249871399176, 427.9202996399177, 382.8668659979424, 346.9753086419753, 319.4550218621399, 307.3922003600823, 279.31089248971193, 263.45044045781896, 248.75200938786008, 236.19683963477365, 227.92354681069958, 219.22387795781893, 216.51742541152262, 207.1707015174897, 197.31306262860082, 194.05137602880657, 187.61263824588477, 182.46521347736626, 180.20482896090536, 174.225485468107, 169.7090245627572, 641286.06]
Up_Down_loss
[0.0, 64.43881012088477, 46.38352784207819, 39.97949620627572, 35.64812805426955, 32.38240057548868, 29.681923948688272, 27.455713091563787, 25.495959121013374, 23.51909923161008, 22.114649643132715, 21.048896444187243, 19.970855838477366, 19.26338453253601, 18.552099408436213, 18.124483587319958, 17.538421505272634, 16.818007732124485, 16.58787555459105, 16.127315819508745, 15.830182613168724, 15.529525945216049, 15.175946019804528, 14.874564967528292, 56264.273]
bias_loss
[0.0, 11103.631687242798, 194.35352366255145, 162.08420138888889, 144.56221064814815, 130.73237364969137, 118.94543306327161, 108.60072659465021, 106.17697884516461, 96.37340052726337, 90.5916361239712, 85.98850630144032, 81.21719071502058, 78.37437307098766, 75.53468203446502, 74.37801408179013, 71.08567226080247, 67.65204636059671, 66.39740869341564, 64.4037784529321, 62.53073961548354, 61.984511638374485, 59.631417984825106, 58.02583670910494, 219256.97]


{'val_loss': [475.1293890533447, 373.5701576080322, 286.85865713500976, 266.1439527053833, 259.21893482971194, 240.17590186309815, 207.51186245727538, 218.32024015045167, 181.33410399627687, 188.12751338577272, 154.4390861930847, 170.37631324768066, 176.373639251709, 150.74122370529176, 142.08909312438965, 138.0358530845642, 132.8883429069519, 154.41059311676025, 116.9671194038391, 122.48420071792603, 110.59608241271972, 111.36988851547241, 131.71902899169922, 117.83561288070679], 'val_Full_Loss': [657.3522562561035, 517.9967529449463, 408.53483920288085, 384.39177848815916, 361.374725151062, 336.76293006896975, 299.4813417434692, 310.8590431137085, 262.39461030578616, 271.0028853530884, 216.88927189636232, 233.15633205413818, 232.64841864013673, 216.25931348609924, 197.8377211380005, 198.40925629806517, 187.2626431274414, 216.3441399383545, 163.60735152816773, 171.43850731658935, 153.95639835739135, 156.95395233154298, 183.37864273834228, 160.84027549362182], 'val_Up_Down_loss': [54.97606370353699, 46.54388884162903, 39.616268257141115, 35.6219654712677, 32.001964798927304, 29.22709819602966, 27.24835287666321, 25.86091066265106, 23.300721440315247, 21.98364093494415, 21.380169684410095, 19.55761158466339, 19.86142434692383, 18.51848624897003, 17.610603316307067, 17.03734689617157, 16.431840977668763, 16.937307312965395, 15.631577363967896, 15.22747825908661, 15.824130634307862, 14.577983182907104, 14.763299042701721, 14.557767166137696], 'val_bias_loss': [245.22470680249484, 199.35078050231934, 140.54788153839112, 141.71498159980774, 130.02154377155006, 117.72601319122315, 105.32516234016418, 117.55508351135254, 95.29423148441315, 96.91893351769447, 75.50662172222137, 75.72442729377747, 90.69980784988404, 80.20379175376893, 67.1528954114914, 73.54976775455475, 71.14447139549256, 73.81697558832168, 58.3850103263855, 63.82488285064697, 54.111296036720276, 53.965055527091025, 59.41475308609009, 55.55025191783905], 'loss': [11822.100753835199, 420.79308637179463, 347.55217040615315, 305.07155946448995, 272.4372052616543, 247.17667244883722, 226.81884229232256, 218.31134387887553, 197.6765887541045, 187.59906700020466, 176.82333247651778, 168.10186095394715, 161.77502717304623, 156.0008809635178, 153.41300856331247, 146.50502577534428, 139.57967003480888, 137.1005322310169, 132.7098543173001, 129.44593180158012, 127.51218239760694, 123.61417279223846, 120.34129463056478, 116.68989525410373], 'Full_Loss': [12082.895422303627, 581.1385990032934, 485.82221052774184, 427.9200773768955, 382.86695393613337, 346.9751220200778, 319.45472953447097, 307.39120424529654, 279.3108549353517, 263.4505793979629, 248.75178009198035, 236.1970318550926, 227.92353327676594, 219.22358915246562, 216.51734662448428, 207.17048409446278, 197.3127181284712, 194.05128116470306, 187.61253363114815, 182.46504057189566, 180.20476961724552, 174.22552657961356, 169.70887045801422, 164.93960998774557], 'Up_Down_loss': [64.43884083223932, 46.38351334760218, 39.9794731483538, 35.64812351107107, 32.38236403955844, 29.6819293790884, 27.455705003728593, 25.495966260570558, 23.51909835642748, 22.11466881007324, 21.048902710892044, 19.970858119397498, 19.26338099893719, 18.552115856497377, 18.12447870427689, 17.53840193949609, 16.818005902409062, 16.58786840963756, 16.127322354311804, 15.830187806867277, 15.529524082877508, 15.175972273688258, 14.87456346649692, 14.471273124585917], 'bias_loss': [11103.620876406447, 194.35338659934055, 162.08430435873353, 144.56211029207756, 130.73230759670705, 118.94541025897603, 108.60077900013316, 106.17715035789789, 96.37358588053857, 90.59165017202558, 85.98847013343999, 81.21715543986348, 78.37428987222444, 75.5345979735194, 74.3780095138177, 71.08562697525377, 67.6519856320487, 66.3974086701134, 64.4038015645718, 62.53070716406583, 61.98459228860988, 59.63142106537956, 58.02585757992886, 56.393228196803435]}
