Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Prodkernel 
variable : [('pl', 'ts')] 
params :   
  
o3 : type : Level_Normalizer 
fitted : True 
values : [ 1.3379468   0.38102475  0.06353182 -0.05932377 -0.1731465  -0.25606525
 -0.31187984 -0.32667944 -0.31265014 -0.26980487 -0.19822446 -0.09672831
  0.03696018  0.19774304  0.3921527   0.62555397  0.8818321   1.1526628
  1.4434904   1.7214584   1.9730718   2.156912    2.2279098   2.2104425
  2.1459632   2.0345016   1.8674462   1.6226867   1.3132231   0.9981195
  0.6793648   0.36627322  0.0837587  -0.13883986 -0.311114   -0.43777886
 -0.53762805 -0.595551   -0.6277697  -0.64457977 -0.6645848  -0.6872374
 -0.712153   -0.73389876 -0.7447418  -0.7488739  -0.7499801  -0.7506243
 -0.75127846 -0.7518282  -0.7522486  -0.7527888  -0.7531913  -0.7535806
 -0.75397176 -0.754285   -0.75454295 -0.7547917  -0.75503755 -0.7552829
 -0.75548875 -0.75568855 -0.7559155  -0.7561267  -0.7562777  -0.75639576
 -0.75650644 -0.7566031  -0.75668705 -0.75677043 -0.75684774 -0.7569085 ] 
  
pl : type : Level_Normalizer 
fitted : True 
values : [-0.847027   -0.8469964  -0.8469551  -0.84690964 -0.8468512  -0.84677476
 -0.84668    -0.84655666 -0.84638894 -0.846177   -0.84590304 -0.8455533
 -0.8451117  -0.8445571  -0.843856   -0.8429841  -0.84189206 -0.8405566
 -0.83890134 -0.8368865  -0.8344393  -0.8314783  -0.8279117  -0.82365465
 -0.81858957 -0.81257236 -0.80540085 -0.7968893  -0.7868192  -0.7749473
 -0.76098955 -0.74464446 -0.7254945  -0.7030496  -0.6768038  -0.6461783
 -0.61051464 -0.56877244 -0.5196687  -0.46189922 -0.39393768 -0.31401035
 -0.2200732  -0.10966848  0.01818342  0.13810328  0.24155085  0.3449823
  0.44839802  0.55180234  0.6551988   0.7585869   0.8619691   0.9653476
  1.0514921   1.1204064   1.1893196   1.2582303   1.3271403   1.3891596
  1.4373955   1.4787403   1.5200844   1.5614276   1.6027714   1.6441154
  1.6854585   1.7268021   1.7681446   1.8094889   1.8508303   1.892204  ] 
  
q : type : Level_Normalizer 
fitted : True 
values : [8.10725687e-05 9.71861591e-05 1.26949250e-04 1.49905973e-04
 1.62716096e-04 1.70703075e-04 1.77006033e-04 1.82785079e-04
 1.88073245e-04 1.92475636e-04 1.95670873e-04 1.97522953e-04
 1.97656191e-04 1.94734661e-04 1.89224942e-04 1.85782759e-04
 1.81164651e-04 1.76954331e-04 1.72245214e-04 1.67093312e-04
 1.62175274e-04 1.57690898e-04 1.54014881e-04 1.50865017e-04
 1.48091654e-04 1.45020982e-04 1.42610545e-04 1.40377670e-04
 1.38310526e-04 1.36564398e-04 1.35192327e-04 1.33399255e-04
 1.30768720e-04 1.27434119e-04 1.22998114e-04 1.18709133e-04
 1.16378054e-04 1.29786815e-04 1.74436849e-04 3.15015262e-04
 6.56066346e-04 1.43675390e-03 3.11536319e-03 6.51066657e-03
 1.20852832e-02 1.84639692e-02 2.64084972e-02 3.64954025e-02
 4.81710844e-02 6.30261451e-02 8.10555369e-02 1.00159004e-01
 1.24167480e-01 1.48035482e-01 1.71104535e-01 1.90802440e-01
 2.08388731e-01 2.29148149e-01 2.48549506e-01 2.68017262e-01
 2.88754821e-01 3.12299550e-01 3.43684018e-01 3.73235583e-01
 3.98205698e-01 4.22297150e-01 4.43750918e-01 4.60411131e-01
 4.71899599e-01 4.83120501e-01 4.95991319e-01 5.11261821e-01] 
  

type : Var Supression 
 values : ['pl', 'rl', 'ri', 'ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 72, 8)             0         
_________________________________________________________________
up_sampling1d_3 (UpSampling1 (None, 360, 8)            0         
_________________________________________________________________
average_pooling1d_3 (Average (None, 72, 8)             0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 8)        0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       2560        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       20480       elu_0[0][0]                      
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       20480       elu_1[0][0]                      
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      40960       elu_2[0][0]                      
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        elu_100[0][0]                    
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       elu_101[0][0]                    
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           elu_111[0][0]                    
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       elu_102[0][0]                    
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
Flatten (Flatten)               (None, 1152)         0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Dense)                 (None, 360)          415080      Flatten[0][0]                    
__________________________________________________________________________________________________
sigmoid_d_0 (Activation)        (None, 360)          0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (None, 90)           32490       sigmoid_d_0[0][0]                
__________________________________________________________________________________________________
sigmoid_d_1 (Activation)        (None, 90)           0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 10)        0           sigmoid_d_1[0][0]                
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 138)       0           Reshape[0][0]                    
                                                                 elu_112[0][0]                    
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 138)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       26560       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       elu_200[0][0]                    
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           elu_210[0][0]                    
                                                                 elu_111[0][0]                    
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       elu_201[0][0]                    
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           elu_211[0][0]                    
                                                                 elu_110[0][0]                    
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 128)      98432       elu_202[0][0]                    
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 128)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 150)      192000      elu_212[0][0]                    
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 150)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 32)       24000       elu_300[0][0]                    
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 32)       0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 10)       1600        elu_301[0][0]                    
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 10)       0           Conv3_302[0][0]                  
==================================================================================================
Total params: 1,184,274
Trainable params: 1,184,274
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_RC0 (InputLayer)          (None, 10, 72)       0                                            
__________________________________________________________________________________________________
Last_flatten (Flatten)          (None, 720)          0           Input_RC0[0][0]                  
__________________________________________________________________________________________________
Last_Dense_0 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
Last_Dense_1 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 72, 1)        0           Last_Dense_0[0][0]               
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 72, 1)        0           Last_Dense_1[0][0]               
__________________________________________________________________________________________________
Last_Concat (Concatenate)       (None, 72, 2)        0           reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
==================================================================================================
Total params: 103,824
Trainable params: 0
Non-trainable params: 103,824
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128], [30, 30, 50, 50, 128, 128], [40, 10], [64, 64, 128, 128, 128, 128], [150, 32, 10]]
list_of_kernel_unet =  [[10, 10, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 5]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['sigmoid', 'sigmoid', 'sigmoid'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
flxu_loss
[0.0, 7.611250261220422, 7.4932077666859565, 7.398950898598251, 7.497451091499485, 7.427984041441615, 7.393889752925669, 7.328023525913066, 7.435041011606224, 7.436064794720936, 7.38318775318287, 7.335912382651749, 7.413135669849537, 7.344783830054013, 7.2484914520640435, 7.098839277102623, 7.205235861947016, 7.210083510159465, 7.115175098058128, 7.05834659529321, 6.9652375900205765, 69.24269]
flxd_loss
[0.0, 17.198565698945472, 17.05246913580247, 17.42650462962963, 16.998631606867285, 16.951111593364196, 17.08277874228395, 17.016647778420783, 17.111211580504115, 17.043798627186213, 17.017140078446502, 16.74469220196759, 16.725205158500515, 16.47315859696502, 17.167775848765434, 16.920848202803498, 16.96560128922325, 16.954748585390945, 16.882925025720166, 16.56352880658436, 16.662204820923353, 162.07924]
loss
[0.0, 24.99002338927469, 24.724213525591562, 25.006673177083332, 24.676689493312757, 24.559719007201647, 24.657312966177983, 24.525848765432098, 24.72853772826646, 24.661709506815843, 24.582913371270575, 24.263352382330247, 24.321682902520575, 24.001422646604937, 24.601409786522634, 24.204326613940328, 24.356147923096707, 24.34957320601852, 24.183937355324073, 23.80979335455247, 23.81493939686214, 233.18561]
