Seed 0
Optimizer
{'lr': 4.999999873689376e-06, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       9600        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       elu_0[0][0]                      
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       40960       elu_1[0][0]                      
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      81920       elu_2[0][0]                      
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
Conv_4 (Conv1D)                 (None, 72, 128)      81920       elu_3[0][0]                      
__________________________________________________________________________________________________
elu_4 (ELU)                     (None, 72, 128)      0           Conv_4[0][0]                     
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           elu_4[0][0]                      
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        elu_100[0][0]                    
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       elu_101[0][0]                    
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           elu_111[0][0]                    
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       elu_102[0][0]                    
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
Flatten (Flatten)               (None, 1152)         0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Dense)                 (None, 450)          518850      Flatten[0][0]                    
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 450)          0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (None, 180)          81180       tanh_d_0[0][0]                   
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 180)          0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 20)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 148)       0           Reshape[0][0]                    
                                                                 elu_112[0][0]                    
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 148)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       28480       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       elu_200[0][0]                    
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           elu_210[0][0]                    
                                                                 elu_111[0][0]                    
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       elu_201[0][0]                    
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           elu_211[0][0]                    
                                                                 elu_110[0][0]                    
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      196864      elu_202[0][0]                    
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 512)      1310720     elu_212[0][0]                    
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 512)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      327680      elu_300[0][0]                    
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         elu_301[0][0]                    
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
==================================================================================================
Total params: 3,029,534
Trainable params: 3,029,534
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128, 128], [30, 30, 50, 50, 128, 128], [50, 20], [64, 64, 128, 128, 128, 256], [512, 128, 2]]
list_of_kernel_unet =  [[30, 20, 10, 10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0]]
loss
[0.0, 62.613932291666664, 41.3392248585391, 32.550596386316876, 26.712524916409464, 22.96242444701646, 20.57764475630144, 19.0806065940072, 18.013133359053498, 17.00440859696502, 16.244168756430042, 15.770551014338992, 15.266477985146604, 14.89699877829218, 14.457334667566872, 14.37379135320216, 14.05127857349537, 13.623333212770062, 13.412514266653806, 13.19603286554784, 12.93457433127572, 12.74923944669496, 12.490987895447532, 12.36599593299897, 12.07640496399177, 46667.85]
{'val_loss': [50.30966862106323, 39.64543779945374, 31.128137117385865, 25.62617943954468, 22.101825379371643, 19.81822653388977, 18.686437390327452, 17.88344814014435, 16.927748148918152, 16.504027676582336, 15.761454046249389, 15.156400771141053, 15.055003001213073, 14.806872966766358, 13.777192494392395, 13.67918848991394, 13.221559514045715, 12.858453573703766, 12.639534031391143, 12.453055418968201, 12.57704645061493, 12.131401860237121, 11.786264417648315, 11.868639018058778, 11.603001804351807], 'val_Up_Down_loss': [50.30872263908386, 39.64448746109009, 31.127184968948363, 25.625225942611696, 22.10087064266205, 19.81727173423767, 18.68548118877411, 17.882491790771486, 16.926789929389955, 16.503068232536314, 15.760494084358216, 15.155440594673157, 15.05404228401184, 14.805911098480225, 13.776229303359985, 13.678224185943604, 13.220595042228698, 12.857488279819488, 12.638568632602691, 12.452089066505431, 12.576079156875611, 12.130434405326843, 11.785296365737915, 11.867670167922974, 11.602032800674438], 'val_Cum_Down_loss': [375.00410388183593, 246.6196973876953, 222.9487371520996, 198.08128617858887, 192.59761031723022, 199.72494752502442, 170.91595043563842, 232.78519789123536, 181.56632775878907, 157.95815585327148, 154.30356393432618, 144.89303493881226, 145.20891500091554, 173.6464518966675, 127.78073491287232, 184.97528747558593, 125.70415857505799, 125.04808055114746, 170.96434226989746, 120.79216231536866, 130.99718340682983, 128.87456504058838, 110.90844285774232, 128.28026219940185, 120.22382556152344], 'loss': [62.61389739376037, 41.33923736325017, 32.55060318124638, 26.712545206762634, 22.962394778865846, 20.577607934121733, 19.080614889354862, 18.01311859365844, 17.004427664441828, 16.24414455130267, 15.770555611255238, 15.266497063906595, 14.897000963673179, 14.457324357189759, 14.373791257049811, 14.051267710364895, 13.623336591225103, 13.412510591524619, 13.196049925844365, 12.934579797365048, 12.749227064995118, 12.490987282721594, 12.36598059032189, 12.076399263899022, 12.003064830975278], 'Up_Down_loss': [62.61295417257788, 41.338288549533104, 32.549651659074634, 26.71159165239138, 22.961440055213348, 20.57665274638698, 19.079659428616118, 18.012162334634443, 17.003470071794563, 16.243184973428278, 15.76959550687315, 15.265536945052599, 14.896040550720544, 14.456363196480911, 14.372828972192458, 14.050303975495781, 13.622371901332595, 13.41154571582751, 13.195084398911323, 12.933613211897665, 12.74826026833597, 12.490019529444691, 12.365012584154497, 12.075429897985341, 12.002095414287268], 'Cum_Down_loss': [2389.975652694702, 301.86437555006995, 250.64554287278602, 229.6527678034433, 219.60995441012912, 211.29282239238913, 202.45461136519663, 199.6396026336607, 191.387598542029, 184.8163347607287, 179.27437922689649, 174.4863439705146, 170.41587991675232, 165.8391547075515, 166.43841801945564, 162.6058787573512, 155.33624500109826, 153.0923487757459, 153.98292149634028, 148.84742046579902, 148.24297101213116, 142.01975158114493, 141.93678300959584, 138.77812426571003, 136.03530392332823]}
