Seed 0
Optimizer
{'lr': 4.999999873689376e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_3 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_3 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 64)       6400        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 64)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_21 (SpatialDr (None, 72, 64)       0           elu_0[0][0]                      
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_21[0][0]       
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 128)      0           Conv_1[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_22 (SpatialDr (None, 72, 128)      0           elu_1[0][0]                      
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 256)      262144      spatial_dropout1d_22[0][0]       
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 256)      0           Conv_2[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_23 (SpatialDr (None, 72, 256)      0           elu_2[0][0]                      
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 256)      0           spatial_dropout1d_23[0][0]       
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 128)      65664       AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 128)      0           Conv_100[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_24 (SpatialDr (None, 36, 128)      0           elu_100[0][0]                    
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 128)      82048       spatial_dropout1d_24[0][0]       
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 128)      0           Conv_110[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_25 (SpatialDr (None, 36, 128)      0           elu_110[0][0]                    
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 128)      0           spatial_dropout1d_25[0][0]       
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 100)      25700       AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 100)      0           Conv_101[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_26 (SpatialDr (None, 18, 100)      0           elu_101[0][0]                    
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 100)      50100       spatial_dropout1d_26[0][0]       
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 100)      0           Conv_111[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_27 (SpatialDr (None, 18, 100)      0           elu_111[0][0]                    
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 100)       0           spatial_dropout1d_27[0][0]       
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 64)        12864       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 64)        0           Conv_102[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_28 (SpatialDr (None, 9, 64)        0           elu_102[0][0]                    
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 64)        16448       spatial_dropout1d_28[0][0]       
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 64)        0           Conv_112[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_29 (SpatialDr (None, 9, 64)        0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Conv1D)                (None, 9, 128)       73856       spatial_dropout1d_29[0][0]       
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 9, 128)       0           Dense_0[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_30 (SpatialDr (None, 9, 128)       0           tanh_d_0[0][0]                   
__________________________________________________________________________________________________
Dense_1 (Conv1D)                (None, 9, 128)       147584      spatial_dropout1d_30[0][0]       
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 9, 128)       0           Dense_1[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_31 (SpatialDr (None, 9, 128)       0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 192)       0           spatial_dropout1d_31[0][0]       
                                                                 spatial_dropout1d_29[0][0]       
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 192)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       36928       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_32 (SpatialDr (None, 18, 64)       0           elu_200[0][0]                    
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       spatial_dropout1d_32[0][0]       
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_33 (SpatialDr (None, 18, 64)       0           elu_210[0][0]                    
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 164)      0           spatial_dropout1d_33[0][0]       
                                                                 spatial_dropout1d_27[0][0]       
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 164)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      63104       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_34 (SpatialDr (None, 36, 128)      0           elu_201[0][0]                    
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       spatial_dropout1d_34[0][0]       
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_35 (SpatialDr (None, 36, 128)      0           elu_211[0][0]                    
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 256)      0           spatial_dropout1d_35[0][0]       
                                                                 spatial_dropout1d_25[0][0]       
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 256)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 256)      196864      Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 256)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_36 (SpatialDr (None, 72, 256)      0           elu_202[0][0]                    
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      393472      spatial_dropout1d_36[0][0]       
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_37 (SpatialDr (None, 72, 256)      0           elu_212[0][0]                    
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 256)      655360      spatial_dropout1d_37[0][0]       
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 256)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_38 (SpatialDr (None, 72, 256)      0           elu_300[0][0]                    
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      163840      spatial_dropout1d_38[0][0]       
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_39 (SpatialDr (None, 72, 128)      0           elu_301[0][0]                    
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         spatial_dropout1d_39[0][0]       
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_40 (SpatialDr (None, 72, 2)        0           linear_302[0][0]                 
==================================================================================================
Total params: 2,433,560
Trainable params: 2,433,560
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[64, 128, 256], [128, 128, 100, 100, 64, 64], [128, 128], [64, 64, 128, 128, 256, 256], [256, 128, 2]]
list_of_kernel_unet =  [[10, 10, 8, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0]]
loss
[0.0, 3.4310674471129117, 3.3784654405381946, 3.359429504645705, 3.3169038246688527, 3.3110195834940845, 3.2403423795974793, 3.229100356867284, 3.2214850280510547, 3.135266213750643, 3.092744552549511, 3.0699666341145835, 3.0228678385416665, 3.0272533275462963, 2.9927152154867542, 3.0197706183288324, 3.0054612650302213, 2.955214512201003, 2.9583185140978654, 2.925036018277392, 2.900666162310314, 2.884846502861368, 2.8649342226884, 2.893017176247428, 2.8192063319830245, 10865.378]
{'val_loss': [3.6521029484272005, 3.527001155376434, 3.4776180858612062, 3.5147338186502455, 3.5140478564500808, 3.453651862382889, 3.4210714964866638, 3.31046080160141, 3.4290071620941163, 3.3019631292819978, 3.219461789250374, 3.294068623304367, 3.3335335609912873, 3.199367831349373, 3.1549671026468276, 3.311958866715431, 3.137723802804947, 3.1560357291698455, 3.0805556672811507, 3.0842094883918763, 3.0964310316443444, 3.059962375640869, 3.148132821261883, 3.0617409077882765, 3.103530415773392], 'val_Up_Down_loss': [3.6100806274414063, 3.4856060853004456, 3.435918527364731, 3.4729144496917725, 3.4727976117134096, 3.413517494916916, 3.3819953268766403, 3.2695186333060264, 3.389403320848942, 3.2620615915060043, 3.179549348115921, 3.254922103524208, 3.29281581056118, 3.1606325228214263, 3.1163246730566025, 3.27277672290802, 3.099152241230011, 3.1168396302461625, 3.042107838153839, 3.0463656837940216, 3.058270783960819, 3.0212975335121155, 3.1092557237148286, 3.0237512115240097, 3.0663823827505112], 'val_Cum_Down_loss': [39.69874825763702, 33.219276876449584, 31.040017382144928, 62.71404795455933, 46.218481719970704, 28.541826448440553, 51.51084600830078, 30.087563203811644, 29.096641075611114, 30.792025923728943, 29.353459119796753, 29.77577930402756, 31.47435067844391, 25.34394652223587, 28.200216973304748, 37.47764645957947, 49.27873002719879, 31.42104469585419, 27.780819925785064, 30.113922193527223, 27.348017179489137, 24.356002507209777, 33.29312791919708, 34.997315546035765, 33.031967675209046], 'loss': [3.4310624178790263, 3.378463966120418, 3.3594298432332006, 3.316901944730998, 3.3110177383562664, 3.2403432817002873, 3.2291013671414843, 3.22147627386414, 3.135265322931019, 3.092744235332611, 3.069967738670822, 3.022870354446364, 3.027253371697885, 2.992711787238533, 3.019769434820968, 3.005461094985283, 2.9552169934589676, 2.95831918691902, 2.925034268923993, 2.9006682091350418, 2.8848516707741676, 2.864933542355343, 2.893019879443778, 2.819209215817628, 2.794594099737489], 'Up_Down_loss': [3.3894146883193357, 3.337165106900435, 3.3184038544142687, 3.2758474891752374, 3.2704869796955047, 3.1999495849319937, 3.1889662108548875, 3.1814741690953574, 3.095482707851463, 3.0532686606417467, 3.0305371847111013, 2.9836845515993398, 2.9882002312521383, 2.953490148417253, 2.9806131065934283, 2.9661991216334296, 2.9161466816018637, 2.9193756554291084, 2.885900198493475, 2.8620067987851647, 2.8462725716792505, 2.8265142037299436, 2.8545196954728156, 2.781054746068309, 2.75634819554326], 'Cum_Down_loss': [35.78245475360886, 34.695763716236556, 34.86222519330037, 34.74107217555674, 35.22551369691582, 34.128676992139695, 33.819657542577986, 33.75099633652487, 33.365489757600635, 32.84716386265225, 32.128011571036446, 32.14998448900725, 32.14746896830606, 32.18907199425952, 31.9127899361736, 31.950013826658697, 31.047366954416894, 32.049405400399806, 31.37402427024802, 30.536274506231393, 31.030433628784778, 30.46998836817565, 30.7839946264838, 30.720219370759565, 29.846340905491708]}
