Seed 0
Optimizer
{'lr': 0.009999999776482582, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9886218, 0.010341728) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.5845794e-06, 4.9694586e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30379.072, 35854.098) 
  
q : type : Zero_One 
fitted : True 
values : (0.022093592, 1.197073e-11) 
  
qi : type : Zero_One 
fitted : True 
values : (0.001, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.001, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.000103479186, 1.5e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.1e-05, 5e-06) 
  
t : type : Normalizer 
fitted : True 
values : (245.35608, 29.160812) 
  
ts : type : Normalizer 
fitted : True 
values : (289.15628, 14.642823) 
  

o3 : type : Level_Normalizer 
fitted : True 
values : [ 1.4553609   0.48792553  0.13557605  0.00503222 -0.11889538 -0.20802428
 -0.26823843 -0.2862055  -0.2753249  -0.23575401 -0.16868284 -0.0730777
  0.0528666   0.20652083  0.39211524  0.6161079   0.86335456  1.1249632
  1.4043502   1.6641656   1.8956245   2.060759    2.124324    2.1047857
  2.045195    1.9480469   1.7911777   1.5558113   1.2606618   0.95473653
  0.6569599   0.35947934  0.09029569 -0.11206095 -0.2802537  -0.40866306
 -0.50548023 -0.56337    -0.5959855  -0.6136642  -0.63217604 -0.651869
 -0.6733493  -0.6910257  -0.70031583 -0.70377845 -0.7050106  -0.705706
 -0.70616895 -0.70654565 -0.7069909  -0.7074806  -0.7079136  -0.7083068
 -0.70862424 -0.7088845  -0.709149   -0.7094118  -0.7096988  -0.7099686
 -0.7101777  -0.7103781  -0.71058464 -0.71078634 -0.7109646  -0.7111204
 -0.7112459  -0.71134263 -0.7114232  -0.71149385 -0.7115568  -0.7116004 ] 
  
pl : type : Level_Normalizer 
fitted : True 
values : [-0.8475162  -0.847511   -0.84750915 -0.84721285 -0.84720594 -0.8471839
 -0.8471022  -0.84707445 -0.8462867  -0.8461813  -0.8458439  -0.8457102
 -0.84556437 -0.8451131  -0.843868   -0.84329766 -0.8419104  -0.8404309
 -0.8392832  -0.8373213  -0.83444244 -0.83188313 -0.8280967  -0.8237629
 -0.818474   -0.81250197 -0.80518264 -0.7968455  -0.786632   -0.7747852
 -0.7603902  -0.7441401  -0.7246519  -0.70242137 -0.6757812  -0.6447137
 -0.60918236 -0.5670708  -0.51756585 -0.45920125 -0.39070114 -0.31038013
 -0.21592747 -0.10510714  0.02309071  0.1432499   0.2468558   0.35041916
  0.4539388   0.55743647  0.6609046   0.76435417  0.8677928   0.97122496
  1.0573947   1.126334    1.1952766   1.2642035   1.333133    1.3951566
  1.4434047   1.484753    1.5261105   1.5674587   1.6088225   1.6501657
  1.6915184   1.7328719   1.7742093   1.8155581   1.856898    1.8983355 ] 
  
q : type : Level_Normalizer 
fitted : True 
values : [7.52727428e-05 9.02807078e-05 1.18578944e-04 1.39499301e-04
 1.51822067e-04 1.58944036e-04 1.64536177e-04 1.69385981e-04
 1.73806417e-04 1.77349852e-04 1.79880706e-04 1.81306998e-04
 1.81194875e-04 1.78413131e-04 1.73392677e-04 1.70180574e-04
 1.66151221e-04 1.62192766e-04 1.57890885e-04 1.53177316e-04
 1.48218518e-04 1.44126752e-04 1.40988253e-04 1.38218034e-04
 1.35477429e-04 1.32766872e-04 1.30370434e-04 1.28400236e-04
 1.26850500e-04 1.25586550e-04 1.24341561e-04 1.22755257e-04
 1.20493147e-04 1.17421063e-04 1.12945585e-04 1.09025794e-04
 1.08523418e-04 1.21086843e-04 1.62132172e-04 2.86743947e-04
 5.95531659e-04 1.29120564e-03 2.76515470e-03 5.58861997e-03
 1.03337234e-02 1.62967555e-02 2.28770580e-02 3.10707893e-02
 4.14330587e-02 5.36584519e-02 6.82275519e-02 8.42544287e-02
 1.02092437e-01 1.21898428e-01 1.40262872e-01 1.57028556e-01
 1.74337506e-01 1.92816228e-01 2.13806897e-01 2.35662028e-01
 2.55799592e-01 2.77592123e-01 3.02847773e-01 3.28738719e-01
 3.53381455e-01 3.76131803e-01 3.96743804e-01 4.13593143e-01
 4.26420361e-01 4.36681390e-01 4.46245611e-01 4.59003448e-01] 
  

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 11)            0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 11)           0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 11)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 11)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       3520        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       20480       elu_0[0][0]                      
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       20480       elu_1[0][0]                      
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      40960       elu_2[0][0]                      
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        elu_100[0][0]                    
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       elu_101[0][0]                    
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           elu_111[0][0]                    
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       elu_102[0][0]                    
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
Flatten (Flatten)               (None, 1152)         0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Dense)                 (None, 540)          622620      Flatten[0][0]                    
__________________________________________________________________________________________________
relu_d_0 (Activation)           (None, 540)          0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (None, 450)          243450      relu_d_0[0][0]                   
__________________________________________________________________________________________________
relu_d_1 (Activation)           (None, 450)          0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Dense_2 (Dense)                 (None, 360)          162360      relu_d_1[0][0]                   
__________________________________________________________________________________________________
relu_d_2 (Activation)           (None, 360)          0           Dense_2[0][0]                    
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 40)        0           relu_d_2[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 168)       0           Reshape[0][0]                    
                                                                 elu_112[0][0]                    
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 168)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       32320       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       elu_200[0][0]                    
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           elu_210[0][0]                    
                                                                 elu_111[0][0]                    
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       elu_201[0][0]                    
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           elu_211[0][0]                    
                                                                 elu_110[0][0]                    
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 128)      98432       elu_202[0][0]                    
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 128)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 150)      192000      elu_212[0][0]                    
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 150)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 32)       24000       elu_300[0][0]                    
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 32)       0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 10)       1600        elu_301[0][0]                    
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 10)       0           Conv3_302[0][0]                  
==================================================================================================
Total params: 1,771,854
Trainable params: 1,771,854
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_RC0 (InputLayer)          (None, 10, 72)       0                                            
__________________________________________________________________________________________________
Last_flatten (Flatten)          (None, 720)          0           Input_RC0[0][0]                  
__________________________________________________________________________________________________
Last_Dense_0 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
Last_Dense_1 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 72, 1)        0           Last_Dense_0[0][0]               
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 72, 1)        0           Last_Dense_1[0][0]               
__________________________________________________________________________________________________
Last_Concat (Concatenate)       (None, 72, 2)        0           reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
==================================================================================================
Total params: 103,824
Trainable params: 103,824
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128], [30, 30, 50, 50, 128, 128], [60, 50, 40], [64, 64, 128, 128, 128, 128], [150, 32, 10]]
list_of_kernel_unet =  [[10, 10, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 5]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['relu', 'relu', 'relu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
flxu_loss
[0.0, 11728883.358024692, 1.6382448301797517e+29, 1.403613701207042e+30, 5.737825973270036e+30, 2.4614742200040303e+30, 1.6127518581962984e+30, 2.6184979032612715e+30, 1.5946044786929316e+30, 1.792310953531858e+30, 1.5678195381335633e+30, 2.0795857970953917e+30, 2.0931443926877037e+30, 2.47212422962441e+30, 1.6065667748030017e+30, 2.437823133569319e+30, 2.21126937629282e+31, 2.1825122329563584e+31, 2.3485155346215058e+30, 1.7439453239414446e+30, 2.248325812295947e+30, 2.180262512551117e+30, 2.2474786130015716e+31, 1.6962441956015426e+30, 1.704841160630021e+30, 3.6702972e+33]
flxd_loss
[0.0, 12600766.683127573, 1.6746082243330177e+29, 1.439606139208811e+30, 5.978963192753676e+30, 2.455169099729352e+30, 1.6506340014792298e+30, 2.609188676949902e+30, 1.6262725641629225e+30, 1.821558082960515e+30, 1.5997686117940554e+30, 2.1096852839019207e+30, 2.114042590856041e+30, 2.468964585082268e+30, 1.6423661030738482e+30, 2.5081854420728062e+30, 2.3027381167058203e+31, 2.2730739148344013e+31, 2.4158167434496615e+30, 1.7823677923907e+30, 2.3113290958102408e+30, 2.2490681623992374e+30, 2.342394736231792e+31, 1.7349342794322328e+30, 1.7430483905333514e+30, 3.7304005e+33]
loss
[0.0, 24395247.14403292, 3.312854945014051e+29, 2.843220318016177e+30, 1.1716798081229756e+31, 4.916646344535433e+30, 3.2633904764786584e+30, 5.22768228180826e+30, 3.22088118205866e+30, 3.6138625092879477e+30, 3.1675883091277266e+30, 4.189275697800442e+30, 4.2071860283430974e+30, 4.941092476309161e+30, 3.248935425078577e+30, 4.9460079388416935e+30, 4.514009276039849e+31, 4.455593279955595e+31, 4.764334825272894e+30, 3.526312320331605e+30, 4.55965474890608e+30, 4.4293373613548875e+30, 4.5898797172376815e+31, 3.431178475033775e+30, 3.447890347163912e+30, 7.400713e+33]
