Seed 0
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
InputLev_0 (InputLayer)         (64, 72, 8)          0                                            
__________________________________________________________________________________________________
Up_0 (UpSampling1D)             (64, 360, 8)         0           InputLev_0[0][0]                 
__________________________________________________________________________________________________
AVG_1 (AveragePooling1D)        (64, 72, 8)          0           Up_0[0][0]                       
__________________________________________________________________________________________________
Flat_0 (Flatten)                (64, 576)            0           AVG_1[0][0]                      
__________________________________________________________________________________________________
InputU_1 (InputLayer)           (64, 3)              0                                            
__________________________________________________________________________________________________
Concat_0 (Concatenate)          (64, 579)            0           Flat_0[0][0]                     
                                                                 InputU_1[0][0]                   
__________________________________________________________________________________________________
Dense_0 (Dense)                 (64, 300)            174000      Concat_0[0][0]                   
__________________________________________________________________________________________________
Act_0 (Activation)              (64, 300)            0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (64, 150)            45150       Act_0[0][0]                      
__________________________________________________________________________________________________
Act_1 (Activation)              (64, 150)            0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Dense_2 (Dense)                 (64, 64)             9664        Act_1[0][0]                      
__________________________________________________________________________________________________
Act_2 (Activation)              (64, 64)             0           Dense_2[0][0]                    
__________________________________________________________________________________________________
Dense_3 (Dense)                 (64, 25)             1625        Act_2[0][0]                      
__________________________________________________________________________________________________
Act_3 (Activation)              (64, 25)             0           Dense_3[0][0]                    
__________________________________________________________________________________________________
Dense_4 (Dense)                 (64, 64)             1664        Act_3[0][0]                      
__________________________________________________________________________________________________
Act_4 (Activation)              (64, 64)             0           Dense_4[0][0]                    
__________________________________________________________________________________________________
Dense_5 (Dense)                 (64, 150)            9750        Act_4[0][0]                      
__________________________________________________________________________________________________
Act_5 (Activation)              (64, 150)            0           Dense_5[0][0]                    
__________________________________________________________________________________________________
Dense_6 (Dense)                 (64, 216)            32400       Act_5[0][0]                      
==================================================================================================
Total params: 274,253
Trainable params: 274,253
Non-trainable params: 0
__________________________________________________________________________________________________
val_loss : [82.05296524047851, 152.30243774414063, 145.0253176879883, 86.37551147460937, 65.82655578613281, 114.35939987182617, 69.28183074951171, 64.5546028137207, 129.85781524658202, 55.11520446777344, 57.88906143188476, 133.31014434814452, 79.49602569580078, 105.5652700805664, 75.34121673583985, 79.39473022460938, 98.76250213623047, 94.74757431030274, 68.77312721252441, 134.09646072387696, 156.1037860107422, 69.44201820373536, 64.883583984375, 55.00991790771484, 87.30366149902343, 86.82033843994141, 75.44024185180665, 53.63788619995117, 56.39189521789551, 72.1924057006836, 65.58434913635254, 94.71096466064454, 72.83129287719727, 53.22568283081055, 54.87455047607422, 71.37327041625977, 58.75045913696289, 78.76242218017578, 126.02529602050781, 78.90323501586914, 71.24824478149414, 124.90147552490234, 69.58009826660157, 88.22081344604493, 74.9233088684082, 71.27691635131836, 69.28544342041016, 58.80708076477051, 135.6993409729004, 72.62353210449218, 90.46212982177734, 68.94423469543457, 73.94939086914063, 132.1687370300293, 76.63017059326172, 97.84815536499023, 54.32397773742676, 61.460058517456055, 64.86848167419434, 61.853169479370116, 126.9128189086914, 70.59933776855469, 67.58137229919434, 55.42090156555176, 108.63112106323243, 88.97934143066406, 55.69742317199707, 53.53306365966797, 127.64594436645508, 62.66946846008301, 123.38168869018554, 80.56721923828125, 74.53296081542969, 83.45964324951171, 79.75013473510742, 77.28790802001953, 80.85923919677734, 60.8444002532959, 91.23053558349609, 77.14680419921875, 124.23072784423829, 65.95908447265624, 62.56257026672363, 128.75350387573243, 129.77981475830077, 135.84956649780273, 72.15952529907227, 73.35374801635743, 60.855703125, 56.96044136047363, 54.22065780639648, 66.80761985778808, 61.50415855407715, 65.61693756103516, 66.32058792114258, 73.36491035461425, 70.62926910400391, 66.06883094787598, 76.03674972534179, 103.91782272338867, 66.59112846374512, 133.55700866699217, 126.61516708374023, 70.75304313659667, 123.68773391723633, 68.05786071777344, 76.30513259887695, 65.67997695922851, 65.45061309814453, 112.86867858886718, 67.60252876281739, 73.96976150512695, 80.88193405151367, 58.117178726196286, 66.60270614624024, 74.55667938232422, 129.1234976196289, 136.55608444213868, 122.2675114440918, 55.17350677490234, 55.820127716064455, 99.67124267578124, 62.08926010131836, 58.1288020324707, 105.90228820800782, 72.08665390014649, 78.73585189819336, 106.07379425048828, 60.80005714416504, 65.6207283782959, 73.07715560913086, 76.50997146606446, 62.999184646606444, 62.54505973815918, 83.52296081542968, 108.8153353881836, 57.51689201354981, 64.45316635131836, 125.37869903564453, 64.11894508361816, 61.36782897949219, 74.94163284301757, 108.86354293823243, 71.69905067443848, 60.98578666687012, 89.89735885620117, 120.26134185791015, 115.34154067993164, 60.86315032958984, 71.08386978149414]
val_flxd_loss_fc : [37.35731842041016, 63.45759391784668, 59.198279571533206, 33.297639236450195, 35.79964637756348, 40.683491439819335, 36.39693817138672, 35.19699718475342, 58.38650505065918, 28.237625617980957, 28.087568130493164, 59.63961761474609, 32.58779411315918, 44.19294387817383, 37.37866096496582, 36.821466522216795, 39.572718658447265, 40.745033798217776, 36.905159606933594, 44.30721046447754, 40.773561325073246, 33.7405277633667, 35.15291213989258, 30.690895385742188, 47.25512771606445, 38.47349235534668, 36.553087615966795, 27.465928955078127, 28.10586742401123, 34.77860614776611, 30.784350776672362, 40.75600479125976, 31.927104721069338, 27.57393913269043, 27.580385856628418, 32.48613613128662, 29.071169929504393, 36.57816177368164, 58.77508102416992, 37.64066421508789, 32.435056610107424, 58.39395500183105, 35.56748050689697, 36.851001586914066, 42.10357635498047, 35.86659156799316, 33.37372943878174, 33.213146743774416, 60.77849250793457, 35.86636489868164, 39.48085609436035, 36.62284034729004, 32.25170234680176, 57.592442932128904, 36.18339279174805, 50.30312942504883, 28.25258991241455, 31.83362552642822, 32.81883094787597, 33.789008140563965, 56.95754173278809, 38.61923889160156, 32.73503227233887, 31.151435508728028, 55.430211791992186, 39.710683822631836, 27.600068778991698, 29.41135414123535, 59.027970733642576, 31.98099266052246, 57.553657379150394, 36.859524993896486, 35.49707191467285, 37.56774215698242, 37.80160797119141, 36.604109115600586, 35.25687175750733, 34.32365139007568, 38.15088081359863, 34.954389877319336, 56.89621223449707, 34.112389678955076, 31.722467803955077, 57.372052612304685, 56.71103530883789, 58.10972373962402, 33.838237838745115, 36.7049681854248, 30.802391204833985, 27.471295013427735, 28.128225746154786, 32.400576972961424, 33.268052101135254, 36.26526824951172, 32.42431274414062, 33.97578262329102, 32.247848434448244, 32.78452465057373, 36.902186431884765, 55.073596725463865, 32.74379409790039, 57.76668304443359, 57.41779487609863, 32.23799777984619, 58.02544204711914, 34.91283893585205, 35.87193428039551, 33.64382507324219, 36.38011489868164, 37.17885574340821, 30.474285736083985, 37.629296951293945, 32.38346424102783, 29.449535026550294, 31.300519638061523, 42.18181838989258, 58.26926452636719, 57.6043197631836, 57.277281265258786, 30.383960151672362, 28.058554153442383, 37.34797134399414, 32.2312919998169, 29.196918411254885, 41.5603263092041, 36.122104530334475, 38.02856178283692, 40.68243812561035, 30.384050369262695, 32.40162315368652, 33.287645721435545, 37.45299980163574, 31.897826080322265, 33.78669097900391, 37.415359344482425, 55.52495849609375, 32.38004974365234, 31.93782958984375, 59.15783790588379, 36.03611240386963, 30.826239776611327, 35.649837493896484, 55.231330947875975, 33.322054138183596, 33.275218391418456, 36.83069808959961, 57.82618423461914, 56.77163719177246, 33.42090114593506, 35.617768173217776]
val_flxu_loss_fc : [15.661365203857422, 23.343515739440917, 20.362471961975096, 11.810205402374267, 16.032410411834718, 17.012860412597657, 16.334293804168702, 15.396121311187745, 18.6157165145874, 14.232764415740967, 9.171393880844116, 19.05004608154297, 11.974705753326417, 24.17113826751709, 15.194754619598388, 17.964209480285646, 16.56598819732666, 17.58319538116455, 16.295040378570558, 20.021331939697266, 16.885505847930908, 16.69950954437256, 14.343190612792968, 12.868791408538819, 19.29647096633911, 19.34994831085205, 14.904332141876221, 8.574963912963867, 9.172207307815551, 18.74130069732666, 10.065938568115234, 21.612917556762696, 10.667361736297607, 8.733437614440918, 8.914915685653687, 12.408626384735108, 9.86317024230957, 15.874230918884278, 18.947921447753906, 15.484371166229248, 10.603980159759521, 19.06366943359375, 16.195562744140624, 15.307497882843018, 18.18074535369873, 17.832653999328613, 11.793925857543945, 13.757182693481445, 20.3893123626709, 17.99654874801636, 16.357788734436035, 14.62216770172119, 13.101171627044678, 18.51170669555664, 17.764160614013672, 23.529326171875, 8.981472463607789, 12.370331783294677, 16.206215534210205, 15.190242538452148, 18.43824670791626, 15.21796459197998, 16.51423101425171, 12.801333198547363, 16.816566352844237, 18.77832830429077, 8.883750820159912, 12.8860888671875, 19.343533515930176, 15.50263916015625, 18.365466499328612, 15.8794891166687, 14.375632514953613, 19.831772956848145, 16.169111194610597, 13.164060039520264, 18.585409698486327, 14.858187618255615, 17.976145782470702, 12.938489818572998, 18.586040496826172, 16.850145530700683, 12.061603317260742, 18.465107727050782, 18.369591484069826, 18.674283599853517, 11.371778450012208, 14.655881328582764, 15.584140300750732, 9.05169186592102, 9.056045513153077, 12.240306968688964, 15.354919757843017, 15.498483333587647, 16.312255897521972, 16.89487117767334, 11.55510311126709, 11.427865524291992, 15.570432720184327, 16.83416837692261, 10.427448711395265, 19.589112548828126, 19.25866989135742, 10.374710321426392, 19.127438011169435, 15.016720066070556, 14.591523532867432, 17.646232776641845, 15.021331825256347, 16.359560794830323, 10.235880012512206, 14.919891357421875, 9.911552267074585, 14.822650508880615, 11.273567276000977, 17.072528705596923, 17.95830041885376, 18.002671737670898, 17.85457025527954, 13.22220308303833, 9.213338565826415, 18.32156597137451, 14.66364465713501, 14.953242530822754, 21.501494903564453, 16.19453685760498, 17.875689868927, 22.906697387695313, 15.497254180908204, 16.580960998535158, 10.414175472259522, 15.621860122680664, 15.906191749572754, 14.18940086364746, 17.269871597290038, 16.950593719482423, 13.717993202209472, 15.651871967315675, 18.789087772369385, 14.6536887550354, 15.91733850479126, 15.449483165740967, 16.75616638183594, 14.804623012542725, 15.604748630523682, 16.245693588256835, 18.737730541229247, 18.561182384490966, 14.890796394348145, 16.88948196411133]
val_dfdts_loss_fc : [28.64423698425293, 65.00620819091797, 64.87839828491211, 40.566472091674804, 13.29907070159912, 55.89014488220215, 15.793739852905274, 13.177809772491456, 52.02961677551269, 11.761971759796143, 19.787209892272948, 53.76094017028809, 34.16992233276367, 36.516380043029784, 22.09335361480713, 23.94947784423828, 42.00772895812988, 35.76507129669189, 14.952290897369386, 69.15327972412109, 97.83655654907227, 18.384022064208985, 14.832385749816895, 10.853120555877686, 20.14427478790283, 28.368097915649415, 23.38253387451172, 16.97723051071167, 18.472161388397218, 18.05492998123169, 24.151127891540526, 31.756897735595704, 29.636478309631347, 16.328801174163818, 17.749561252593995, 25.82672134399414, 19.145233879089357, 25.67097770690918, 47.684235916137695, 25.15648094177246, 27.570420379638673, 46.84612014770508, 17.211341361999512, 35.453115158081054, 14.005626640319825, 16.940724906921385, 23.450885391235353, 11.181444320678711, 53.86509574890137, 18.084227390289307, 33.97210243225098, 17.12518274307251, 28.022237701416017, 55.48872123718262, 22.12412925720215, 23.45421485900879, 16.497885551452637, 16.646847324371336, 15.234126930236817, 12.24623046875, 50.86938949584961, 16.136363353729248, 17.69429407119751, 10.866843929290772, 35.78893703460693, 29.896624336242677, 18.5874778175354, 10.617594032287597, 48.641352310180665, 14.55580156326294, 46.83368309020996, 27.19163158416748, 24.027671546936034, 25.436202392578124, 25.139064178466796, 26.929079093933105, 26.44736198425293, 11.082817497253417, 34.52001586914062, 28.675495071411135, 48.16666656494141, 14.439128894805908, 18.19906276702881, 52.32379379272461, 54.132364425659176, 58.481180114746095, 26.346290588378906, 21.410599136352538, 13.884407482147218, 19.841015434265138, 16.433328094482423, 21.60541706085205, 12.307777366638184, 13.276130275726318, 17.001992454528807, 21.894935874938966, 26.243562088012695, 21.3025345993042, 22.987813606262208, 31.442772903442382, 22.834848365783692, 55.66186149597168, 49.38942260742188, 27.573402175903322, 45.94385948181152, 17.5527862739563, 25.260580291748045, 13.852956047058106, 13.483297176361084, 58.7697607421875, 26.327239952087403, 20.861970443725586, 38.05903221130371, 13.290354766845702, 23.487503318786622, 14.75265697479248, 52.34448745727539, 60.391505584716796, 46.564881820678714, 10.989797286987304, 17.98312473297119, 43.43141471862793, 14.600124683380127, 13.371952285766602, 42.23771385192871, 19.166413192749022, 22.27366958618164, 41.925461273193356, 14.331815738677978, 16.07024139404297, 28.797087326049805, 22.86923286437988, 14.660708332061768, 14.0331880569458, 28.315467414855956, 35.80590847015381, 10.910372734069824, 16.326937122344972, 46.92429000854492, 12.920039405822754, 14.111560592651367, 23.309573554992674, 36.35163875579834, 23.045265350341797, 11.55092845916748, 36.26038177490234, 43.13550849914551, 39.44172035217285, 11.977302684783936, 18.02621868133545]
loss : [640.0834217453003, 53.02655979919434, 41.68387610244751, 69.7663530883789, 59.528956901550295, 56.98699275970459, 58.964252502441404, 56.70696264648438, 55.44744171905518, 56.8548148727417, 55.127019599914554, 55.77708720397949, 108.0175731048584, 53.537495346069335, 57.43282308959961, 66.32463571929932, 56.29358056640625, 52.703242988586425, 57.39162740325928, 55.67952753448486, 29.205086669921876, 57.193999626159666, 29.633159942626953, 43.326199081420896, 47.46630027770996, 44.41408826828003, 57.52258483123779, 54.4835241317749, 52.02604549407959, 111.1493849029541, 56.92526261138916, 55.67901461029053, 109.35836064147949, 56.590749145507814, 53.92482758331299, 33.585529190063475, 32.76023154449463, 105.80737762451172, 45.38586287689209, 105.44339204406738, 102.47824081420899, 51.9616640548706, 55.56503229141235, 69.53011070251465, 65.62009185791015, 43.3683469657898, 62.35396018981933, 59.1700532913208, 44.132069190979, 42.45691205596924, 106.31969946289063, 29.91715205001831, 50.53604240417481, 54.305737716674805, 108.08162957763672, 45.07186660003662, 55.88035443115234, 62.46636932373047, 54.38184181976318, 52.409824012756346, 53.04070826721191, 63.28841187286377, 50.704778045654294, 44.30642548370361, 106.62294309997559, 53.301883842468264, 52.24067218017578, 49.90514722442627, 47.99233208084107, 37.6312407913208, 66.83415542602539, 56.41074557495117, 53.1291435623169, 107.72669506835938, 56.12868692779541, 45.262354679107666, 109.30819841003418, 54.76421440887451, 36.70236916351318, 106.65520797729492, 54.78680982208252, 72.03294246673585, 66.01892639160157, 64.8487877883911, 52.26608006286621, 37.24126948547363, 64.33453520965575, 57.21492527770996, 56.34132799530029, 54.90477490997314, 53.33317476654053, 107.73508656311036, 56.51869260406494, 64.68176722717286, 55.17889910888672, 52.92708613586426, 59.1732663192749, 108.93534497070313, 54.85261116027832, 105.82417143249512, 65.57735799407959, 29.27591752243042, 43.85491618728638, 65.22355883789062, 62.5675129699707, 56.893504959106444, 50.55090165710449, 110.07457981872558, 65.07602062988282, 57.207213607788084, 44.06009704589844, 57.74044092559814, 108.76167724609375, 53.87961520385742, 52.986918159484865, 44.883455940246584, 53.37019474029541, 64.02550601196289, 58.67842179107666, 49.80796717071533, 53.33097094345093, 37.45518681716919, 52.80672492980957, 54.52539022064209, 53.02734185791016, 34.87482660675049, 111.32273146057129, 58.354320755004885, 54.65648425292969, 107.58621144104004, 56.2139379196167, 56.3517268371582, 45.12159447097778, 28.243079261779783, 110.50271533203124, 107.07474369812012, 45.41073097229004, 54.429204147338865, 68.33175415802002, 37.92178629302978, 43.93262585067749, 55.809295387268065, 109.87605203247071, 51.11050065612793, 53.607182556152345, 36.68056919097901, 65.84213259887696, 63.36208053588867, 56.47878659057617, 110.42462156677246]
flxd_loss_fc : [40.000030574798586, 26.860172786712646, 19.93984174156189, 34.834644680023196, 30.621431228637697, 29.361085933685303, 29.63639331817627, 29.22539665222168, 28.556305904388427, 28.63367193222046, 27.59812850189209, 28.626846256256105, 55.38489238739014, 28.644619598388672, 29.270585189819336, 33.91464209747314, 31.634653476715087, 28.867180221557618, 29.514442459106444, 29.063939228057862, 14.425910234451294, 29.0012481880188, 14.646913850784301, 23.39593105697632, 21.026889881134032, 23.922289196014404, 28.82494549560547, 27.845730838775633, 26.74724486732483, 56.11714042663574, 29.83538227081299, 31.61381987762451, 55.552080238342285, 29.274243148803713, 27.72490947341919, 15.932956525802613, 15.691421905517577, 54.81427278137207, 20.839853782653808, 54.86532546234131, 53.509113342285154, 28.291970386505128, 28.799099395751952, 33.65583592605591, 33.5773112373352, 20.3352977809906, 32.227090496063234, 30.81924430847168, 20.288436124801635, 19.726728391647338, 55.06015493011475, 14.641249839782715, 28.3107423248291, 27.718336849212648, 55.694966049194335, 20.75229141998291, 29.000345111846922, 32.370930381774905, 30.417773567199706, 26.84648902320862, 27.138155994415282, 32.61690717315674, 26.485225830078125, 23.70482286643982, 53.845813354492186, 29.26615510559082, 26.753528144836427, 27.145353981018065, 26.025716119766237, 18.63077116394043, 33.73502251815796, 29.538943035125733, 27.178617794036864, 54.98559464263916, 28.959188117980958, 20.58162072753906, 55.9752693862915, 28.594906089782715, 18.178012969970702, 54.800533088684084, 30.129882759094237, 34.237255207061764, 33.66993112945557, 32.842152153015135, 28.756696922302247, 18.35014303588867, 32.761993267059324, 29.770862609863283, 29.584667610168456, 28.433814456939697, 28.02036326980591, 55.80841687774658, 29.438891971588134, 33.21879809570312, 29.015404483795166, 27.729689331054686, 30.365557579040527, 55.79645705413818, 28.89757803726196, 55.1811893081665, 33.985911937713624, 14.480498710632324, 23.75058080291748, 33.07576117706299, 31.749033462524412, 29.702138736724855, 27.512880867004395, 55.26290470123291, 33.16583847808838, 29.54555438995361, 23.41910904312134, 29.226210556030274, 55.2190803527832, 28.237249698638916, 29.09989987564087, 20.66333490562439, 27.450392917633057, 32.97224533462524, 30.08624835205078, 27.22217795944214, 27.436770500183105, 18.562157398223878, 27.575747123718262, 28.18744667816162, 29.30133713912964, 16.50645755004883, 56.16986038970947, 30.228029109954836, 28.72836944580078, 54.88103402709961, 29.380962615966798, 29.017956344604492, 24.42060562515259, 14.021600349426269, 55.34113561248779, 54.7095546875, 24.64803968811035, 30.322433280944825, 34.14759075927734, 18.574296070098878, 23.669113592147827, 28.953105163574218, 54.74076181793213, 27.819620250701906, 28.039500621795654, 18.211897262573242, 32.86687286376953, 32.05054155349731, 29.243885166168212, 55.41971601867676]
flxu_loss_fc : [16.36547188949585, 14.462915312767029, 11.29049739265442, 13.188956650733948, 15.849921613693237, 15.015215423583985, 8.573228048801422, 15.067699982643127, 14.860843970298767, 14.853775579452515, 8.625880815029145, 15.184960690498352, 17.074072277069092, 13.501412105560302, 9.17289361190796, 12.73535006904602, 13.029217259407044, 12.621862634658813, 8.559637444019318, 15.138097025871277, 7.624884070396424, 8.565350719928741, 7.845427314758301, 11.278099785804748, 9.525579927444458, 11.440529797554015, 8.62134982585907, 8.36645860004425, 8.04975959444046, 17.69026392555237, 15.094751100540162, 12.895353375434876, 17.024433500289916, 8.733222990512848, 8.62386345386505, 6.0456337952613834, 5.852595193386078, 16.95187950897217, 9.75374983215332, 17.096156326293944, 16.37846188545227, 13.155325820922851, 8.5466112408638, 11.622775859832764, 12.555356435775757, 9.506428039550782, 11.96674597454071, 15.330853753089905, 9.43819518852234, 9.280408975601196, 17.14819998550415, 8.120438919067382, 12.427779515266419, 8.648812441825866, 17.215433731079102, 9.76430890750885, 9.224405641555785, 12.496745295524597, 12.74966716003418, 8.410108124256134, 8.594953055858612, 12.352460312843323, 7.98228843832016, 11.573976711273193, 16.917114088058472, 13.066650235176086, 8.40629580116272, 12.587901101112365, 12.166004346847535, 10.12345718574524, 12.08107276916504, 14.983662396430969, 8.448427083015442, 16.99142395591736, 15.024071279525756, 9.66822849369049, 17.37070728302002, 14.657026925086974, 9.930594336032867, 16.946657178878784, 13.592514181137085, 11.964345154762269, 12.363772032737732, 12.038123768806457, 12.919050409317016, 10.06873831653595, 12.039556540489198, 8.847001182079316, 15.195989974021911, 8.769310578346252, 8.25494907426834, 17.54687272644043, 15.206693867683411, 12.059510029792786, 8.873764307975769, 8.546834707260132, 15.544480478286744, 17.659004867553712, 8.559887718200683, 17.126013027191163, 12.683192918777467, 7.884257126331329, 11.519336510658265, 11.90147592163086, 11.917368389129638, 8.546741394042968, 12.663264523506164, 17.508270851135254, 12.37418881225586, 15.160392723083497, 11.912007153511047, 8.627629437446593, 17.188073848724365, 14.452383311271667, 13.161320253372192, 9.52714905834198, 8.702160057067871, 12.084202756881714, 15.14947537612915, 12.660930904388428, 8.517101356506348, 10.175788910865784, 14.226337213516235, 14.831365550994873, 13.094393829345703, 6.463700871944427, 17.614041282653808, 15.203147804260254, 14.84048967552185, 16.927223693847655, 15.152019810676574, 9.297855422019959, 11.975077004432679, 7.57748477935791, 17.239848293304444, 16.698405935287475, 12.223801845550538, 13.245561644554138, 12.29470266532898, 10.178498546600341, 11.653987906455994, 14.861319366455078, 17.25601460647583, 13.002962034225463, 14.575256426811219, 10.029059927940368, 12.478443461418152, 12.083073135375976, 15.046450778007507, 17.37105853843689]
dfdts_loss_fc : [583.4835055370331, 11.290894625663757, 9.918421122550964, 21.098121669769288, 12.392446194648743, 11.873750043869018, 20.005137588500975, 11.649349296569824, 11.228027073860169, 12.513944620132447, 18.05528468132019, 11.128752857208251, 34.76219901275635, 10.69094391822815, 18.32737465286255, 19.01981160736084, 11.01926065158844, 10.577157950401306, 18.69924009513855, 10.873898379325867, 6.552849934577942, 19.020693239212036, 6.571234862804413, 8.07784533405304, 16.321089448928834, 8.436784927368164, 19.476096088409424, 17.660426645278932, 16.598999238967895, 36.72193240737915, 11.412381625175476, 10.593302229881287, 36.194327098846436, 17.998180904388427, 16.966898841857912, 10.966705276489257, 10.555110603332519, 33.395246524810794, 14.171354471206666, 32.87238125228882, 31.962244926452637, 9.904181164741516, 17.623744707107544, 23.650288175582887, 18.868438388824462, 12.89042639541626, 17.50704851913452, 12.37751181793213, 13.74494540977478, 12.777671147346497, 33.46104670715332, 6.548850792884827, 9.228013571739197, 17.37368831253052, 34.612867900848386, 14.000043603897094, 17.08689790534973, 17.006966886520384, 10.612474763870239, 16.54001877593994, 16.669558067321777, 17.68715559387207, 15.61144465637207, 8.42028851699829, 35.26927618789673, 10.379013055801392, 16.476383152008058, 9.554285367965699, 9.176971920967102, 8.251348911762237, 20.394320222854613, 11.261526469230652, 16.87791358947754, 35.12605201721191, 11.514515934944153, 14.402654899597168, 35.39364904403686, 10.94125756072998, 8.014621647834778, 34.332961040496826, 10.487087999343872, 25.268786712646484, 19.419274822235106, 19.383017877578734, 10.019281856536866, 8.247801237583161, 18.94103220176697, 18.012476607322693, 10.982300809860229, 17.113924816131593, 16.457624654769898, 33.808214504241946, 11.308828340530395, 18.833235059738158, 16.716173243522643, 16.05956526184082, 12.68277663898468, 34.922668033599855, 16.83186343574524, 32.95291464233399, 18.33312747001648, 6.361696659564972, 8.04436121225357, 19.69015069961548, 18.321912603378294, 18.06929717254639, 9.794345749855042, 36.75605294418335, 18.98339354133606, 11.944039953231812, 8.16536852645874, 19.329142669677733, 35.82261839675903, 10.648489780426026, 10.181008871078491, 14.151130945205688, 16.675146961212157, 18.41552392959595, 12.885389316558838, 9.350941786766052, 16.817203397750855, 8.154747766017914, 10.422764067649842, 10.906680730819701, 10.027586943626403, 11.310902061462402, 36.96587564468384, 12.367038854598999, 10.516282653808593, 35.20534672927857, 11.110077395439149, 17.46952908229828, 8.183148365974427, 6.1107427334785465, 37.39709017562866, 35.13966254043579, 8.032787586212159, 10.338076634407043, 21.371591087341308, 8.667378881454468, 8.099776743888855, 11.475980523109437, 37.35760940933228, 9.767783739089966, 10.449503063201904, 7.883249358177185, 19.935584463119508, 18.664732540130615, 11.622191972732544, 37.08005185317993]


flxu_loss
flxd_loss
dfdts_loss
loss
