Seed 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 11)            0         
_________________________________________________________________
model_1 (Model)              (None, 72, 50)            37148     
_________________________________________________________________
model_2 (Model)              (None, 72, 3)             2525805   
=================================================================
Total params: 2,562,953
Trainable params: 2,562,953
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 50)       0                                            
__________________________________________________________________________________________________
AVG_1 (AveragePooling1D)        (None, 36, 50)       0           Origin_Input[0][0]               
__________________________________________________________________________________________________
Conv1_1 (Conv1D)                (None, 36, 50)       25050       AVG_1[0][0]                      
__________________________________________________________________________________________________
AVG_2 (AveragePooling1D)        (None, 18, 50)       0           Conv1_1[0][0]                    
__________________________________________________________________________________________________
Conv1_2 (Conv1D)                (None, 18, 75)       18825       AVG_2[0][0]                      
__________________________________________________________________________________________________
AVG_3 (AveragePooling1D)        (None, 9, 75)        0           Conv1_2[0][0]                    
__________________________________________________________________________________________________
Conv1_3 (Conv1D)                (None, 9, 100)       22600       AVG_3[0][0]                      
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 900)          0           Conv1_3[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2430)         2189430     flatten_1[0][0]                  
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 270)       0           dense_1[0][0]                    
__________________________________________________________________________________________________
Concat_1 (Concatenate)          (None, 9, 370)       0           Reshape[0][0]                    
                                                                 Conv1_3[0][0]                    
__________________________________________________________________________________________________
Ups_1 (UpSampling1D)            (None, 18, 370)      0           Concat_1[0][0]                   
__________________________________________________________________________________________________
Conv2_1 (Conv1D)                (None, 18, 50)       185050      Ups_1[0][0]                      
__________________________________________________________________________________________________
Concat_2 (Concatenate)          (None, 18, 125)      0           Conv2_1[0][0]                    
                                                                 Conv1_2[0][0]                    
__________________________________________________________________________________________________
Ups_2 (UpSampling1D)            (None, 36, 125)      0           Concat_2[0][0]                   
__________________________________________________________________________________________________
Conv2_2 (Conv1D)                (None, 36, 75)       46950       Ups_2[0][0]                      
__________________________________________________________________________________________________
Concat_3 (Concatenate)          (None, 36, 125)      0           Conv2_2[0][0]                    
                                                                 Conv1_1[0][0]                    
__________________________________________________________________________________________________
Ups_3 (UpSampling1D)            (None, 72, 125)      0           Concat_3[0][0]                   
__________________________________________________________________________________________________
Conv2_3 (Conv1D)                (None, 72, 100)      37600       Ups_3[0][0]                      
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 72, 3)        300         Conv2_3[0][0]                    
==================================================================================================
Total params: 2,525,805
Trainable params: 2,525,805
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_0 (InputLayer)            (None, 72, 11)       0                                            
__________________________________________________________________________________________________
Up_0 (UpSampling1D)             (None, 360, 11)      0           Input_0[0][0]                    
__________________________________________________________________________________________________
AVG_p (AveragePooling1D)        (None, 72, 11)       0           Up_0[0][0]                       
__________________________________________________________________________________________________
Flip_0 (Lambda)                 (None, 72, 11)       0           AVG_p[0][0]                      
__________________________________________________________________________________________________
Conv_d_1 (Conv1D)               (None, 72, 32)       3552        Flip_0[0][0]                     
__________________________________________________________________________________________________
Conv_u_1 (Conv1D)               (None, 72, 64)       7104        AVG_p[0][0]                      
__________________________________________________________________________________________________
Conv_d_2 (Conv1D)               (None, 72, 20)       3220        Conv_d_1[0][0]                   
__________________________________________________________________________________________________
Conv_u_2 (Conv1D)               (None, 72, 32)       10272       Conv_u_1[0][0]                   
__________________________________________________________________________________________________
Flip_1 (Lambda)                 (None, 72, 20)       0           Conv_d_2[0][0]                   
__________________________________________________________________________________________________
Concat_0 (Concatenate)          (None, 72, 52)       0           Conv_u_2[0][0]                   
                                                                 Flip_1[0][0]                     
__________________________________________________________________________________________________
Conv_conc_0 (Conv1D)            (None, 72, 50)       13000       Concat_0[0][0]                   
==================================================================================================
Total params: 37,148
Trainable params: 37,148
Non-trainable params: 0
__________________________________________________________________________________________________
val_loss : [46.230538730031434, 45.11769648974704, 43.212147006791895, 42.541816888396276, 56.30234657759519, 47.74439909826849]
val_flxd_loss : [22.42294830046978, 21.589945132953606, 21.137732865146756, 20.92331426512335, 24.92816357317659, 22.782119996768913]
val_flxu_loss : [11.175064598407943, 10.747670695216385, 10.717682143093384, 10.288828398026142, 12.728113925088312, 10.412945041214067]
val_dfdts_loss : [12.632525788877428, 12.78008071515978, 11.35673188266066, 11.329674179283614, 18.646069078347118, 14.549334027349335]
loss : [31.844346104048057, 31.208735709692156, 30.898757538320314, 30.61279041547063, 30.319078446534856, 30.25510253396755]
flxd_loss : [15.995569255147382, 15.62944147853484, 15.452485841807023, 15.304910493843138, 15.148124574679336, 15.118988801541573]
flxu_loss : [7.650757664091653, 7.510294303835875, 7.45127527489864, 7.395192910474164, 7.337747099312315, 7.337453605410704]
dfdts_loss : [8.198019182242273, 8.068999928018753, 7.994996423310633, 7.9126870089772865, 7.8332067689480045, 7.798660133051073]


Bdc
[[64, 32], [32, 20], [50]]
[[10, 5], [10, 5], [5]]
Unet
[[50, 75, 100], [270], [50, 75, 100]]
[[10, 5, 3], [], [10, 5, 3]]
flxu_loss
flxd_loss
dfdts_loss
loss
