Seed 0
Optimizer
{'lr': 0.0010000000474974513, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 2)             0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 2)            0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 2)             0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Origin_Input (InputLayer)    (None, 72, 2)             0         
_________________________________________________________________
Conv_0 (Conv1D)              (None, 72, 5)             100       
_________________________________________________________________
relu_0 (Activation)          (None, 72, 5)             0         
_________________________________________________________________
Conv_1 (Conv1D)              (None, 72, 18)            450       
_________________________________________________________________
relu_1 (Activation)          (None, 72, 18)            0         
_________________________________________________________________
AVG_100 (MaxPooling1D)       (None, 36, 18)            0         
_________________________________________________________________
Conv_100 (Conv1D)            (None, 36, 30)            1110      
_________________________________________________________________
relu_100 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
Conv_110 (Conv1D)            (None, 36, 30)            4530      
_________________________________________________________________
relu_110 (Activation)        (None, 36, 30)            0         
_________________________________________________________________
AVG_101 (MaxPooling1D)       (None, 18, 30)            0         
_________________________________________________________________
Conv_101 (Conv1D)            (None, 18, 50)            3050      
_________________________________________________________________
relu_101 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_111 (Conv1D)            (None, 18, 50)            12550     
_________________________________________________________________
relu_111 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
AVG_102 (MaxPooling1D)       (None, 9, 50)             0         
_________________________________________________________________
Conv_102 (Conv1D)            (None, 9, 100)            10100     
_________________________________________________________________
relu_102 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Conv_112 (Conv1D)            (None, 9, 100)            40100     
_________________________________________________________________
relu_112 (Activation)        (None, 9, 100)            0         
_________________________________________________________________
Flatten (Flatten)            (None, 900)               0         
_________________________________________________________________
Dense_0 (Dense)              (None, 360)               324360    
_________________________________________________________________
relu_d_0 (Activation)        (None, 360)               0         
_________________________________________________________________
Dense_1 (Dense)              (None, 180)               64980     
_________________________________________________________________
relu_d_1 (Activation)        (None, 180)               0         
_________________________________________________________________
Dense_2 (Dense)              (None, 9)                 1629      
_________________________________________________________________
relu_d_2 (Activation)        (None, 9)                 0         
_________________________________________________________________
Reshape (Reshape)            (None, 9, 1)              0         
_________________________________________________________________
Ups_200 (UpSampling1D)       (None, 18, 1)             0         
_________________________________________________________________
Conv_200 (Conv1D)            (None, 18, 50)            200       
_________________________________________________________________
relu_200 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Conv_210 (Conv1D)            (None, 18, 50)            10050     
_________________________________________________________________
relu_210 (Activation)        (None, 18, 50)            0         
_________________________________________________________________
Ups_201 (UpSampling1D)       (None, 36, 50)            0         
_________________________________________________________________
Conv_201 (Conv1D)            (None, 36, 100)           15100     
_________________________________________________________________
relu_201 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Conv_211 (Conv1D)            (None, 36, 100)           50100     
_________________________________________________________________
relu_211 (Activation)        (None, 36, 100)           0         
_________________________________________________________________
Ups_202 (UpSampling1D)       (None, 72, 100)           0         
_________________________________________________________________
Conv_202 (Conv1D)            (None, 72, 100)           30100     
_________________________________________________________________
relu_202 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv_212 (Conv1D)            (None, 72, 100)           60100     
_________________________________________________________________
relu_212 (Activation)        (None, 72, 100)           0         
_________________________________________________________________
Conv3_300 (Conv1D)           (None, 72, 10)            5000      
_________________________________________________________________
relu_300 (Activation)        (None, 72, 10)            0         
=================================================================
Total params: 633,609
Trainable params: 633,609
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_RC0 (InputLayer)          (None, 10, 72)       0                                            
__________________________________________________________________________________________________
Last_flatten (Flatten)          (None, 720)          0           Input_RC0[0][0]                  
__________________________________________________________________________________________________
Last_Dense_0 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
Last_Dense_1 (Dense)            (None, 72)           51912       Last_flatten[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 72, 1)        0           Last_Dense_0[0][0]               
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 72, 1)        0           Last_Dense_1[0][0]               
__________________________________________________________________________________________________
Last_Concat (Concatenate)       (None, 72, 2)        0           reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
==================================================================================================
Total params: 103,824
Trainable params: 103,824
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[5, 18], [30, 30, 50, 50, 100, 100], [40, 20, 1], [50, 50, 100, 100, 100, 100], [10]]
list_of_kernel_unet =  [[10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [5]]
list_of_activation_unet =  [['relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu', 'relu', 'relu'], ['relu', 'relu', 'relu', 'relu', 'relu', 'relu'], ['relu']]
loss
[0.0, 22.57177734375, 8.785883648405349, 11.983745056905864, 7.153722190072016, 10.128031161586934, 7.681239249774949, 5.931950573077418, 7.684626073013117, 4.650965812274949, 7.637995715985082, 8.26829849054784, 5.558034637827932, 6.164962203414352, 4.96398322964892, 6.401515882201646, 5.563050069926698, 4.8113124517746915, 4.574682918595679, 5.214424792631172, 5.896315084072788, 5.084950388213734, 4.825735837834362, 6.414805471161266, 5.169297960069445, 36939.652]
flxd_loss
[0.0, 13.206263663837449, 5.620250811792696, 7.466161908436214, 4.29151696727109, 6.432143474311985, 4.735014487686471, 3.6814828880529835, 4.763910489808385, 2.95251062966178, 4.958897468975051, 4.944740829153806, 3.466309096096965, 3.638522175604424, 3.179553624533822, 4.215775603620113, 3.337887359744727, 2.8249730239679782, 2.88611543129501, 3.383001382458848, 3.828080039946631, 2.899843820328575, 2.9030467845775463, 4.28516529224537, 3.208469720534336, 24317.117]
flxu_loss
[0.0, 5.109276539994856, 2.125334060731739, 3.5431541160300926, 2.0583217291184415, 2.79889317893197, 1.9331265673225309, 1.47232306837545, 1.9879730601369598, 1.0539101180716306, 2.0240010077080117, 2.4390010127314814, 1.4702011547952032, 1.8753231346852495, 1.2399948810844263, 1.6470118393132716, 1.6549281995482896, 1.488403822659465, 1.1832735038097995, 1.3204202534239968, 1.558314193913966, 1.641340718838413, 1.4381849500868056, 1.585088408042374, 1.4200701929414223, 10130.999]
