Seed 0
Optimizer
{'lr': 4.999999873689376e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_3 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_3 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 64)       6400        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 64)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_41 (SpatialDr (None, 72, 64)       0           elu_0[0][0]                      
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 128)      81920       spatial_dropout1d_41[0][0]       
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 128)      0           Conv_1[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_42 (SpatialDr (None, 72, 128)      0           elu_1[0][0]                      
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 256)      262144      spatial_dropout1d_42[0][0]       
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 256)      0           Conv_2[0][0]                     
__________________________________________________________________________________________________
spatial_dropout1d_43 (SpatialDr (None, 72, 256)      0           elu_2[0][0]                      
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 256)      0           spatial_dropout1d_43[0][0]       
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 128)      65664       AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 128)      0           Conv_100[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_44 (SpatialDr (None, 36, 128)      0           elu_100[0][0]                    
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 128)      82048       spatial_dropout1d_44[0][0]       
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 128)      0           Conv_110[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_45 (SpatialDr (None, 36, 128)      0           elu_110[0][0]                    
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 128)      0           spatial_dropout1d_45[0][0]       
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 100)      25700       AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 100)      0           Conv_101[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_46 (SpatialDr (None, 18, 100)      0           elu_101[0][0]                    
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 100)      50100       spatial_dropout1d_46[0][0]       
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 100)      0           Conv_111[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_47 (SpatialDr (None, 18, 100)      0           elu_111[0][0]                    
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 100)       0           spatial_dropout1d_47[0][0]       
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 64)        12864       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 64)        0           Conv_102[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_48 (SpatialDr (None, 9, 64)        0           elu_102[0][0]                    
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 64)        16448       spatial_dropout1d_48[0][0]       
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 64)        0           Conv_112[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_49 (SpatialDr (None, 9, 64)        0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Conv1D)                (None, 9, 128)       73856       spatial_dropout1d_49[0][0]       
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 9, 128)       0           Dense_0[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_50 (SpatialDr (None, 9, 128)       0           tanh_d_0[0][0]                   
__________________________________________________________________________________________________
Dense_1 (Conv1D)                (None, 9, 128)       147584      spatial_dropout1d_50[0][0]       
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 9, 128)       0           Dense_1[0][0]                    
__________________________________________________________________________________________________
spatial_dropout1d_51 (SpatialDr (None, 9, 128)       0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 192)       0           spatial_dropout1d_51[0][0]       
                                                                 spatial_dropout1d_49[0][0]       
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 192)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       36928       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_52 (SpatialDr (None, 18, 64)       0           elu_200[0][0]                    
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       spatial_dropout1d_52[0][0]       
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_53 (SpatialDr (None, 18, 64)       0           elu_210[0][0]                    
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 164)      0           spatial_dropout1d_53[0][0]       
                                                                 spatial_dropout1d_47[0][0]       
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 164)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      63104       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_54 (SpatialDr (None, 36, 128)      0           elu_201[0][0]                    
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       spatial_dropout1d_54[0][0]       
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_55 (SpatialDr (None, 36, 128)      0           elu_211[0][0]                    
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 256)      0           spatial_dropout1d_55[0][0]       
                                                                 spatial_dropout1d_45[0][0]       
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 256)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 256)      196864      Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 256)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_56 (SpatialDr (None, 72, 256)      0           elu_202[0][0]                    
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      393472      spatial_dropout1d_56[0][0]       
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
spatial_dropout1d_57 (SpatialDr (None, 72, 256)      0           elu_212[0][0]                    
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 256)      655360      spatial_dropout1d_57[0][0]       
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 256)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_58 (SpatialDr (None, 72, 256)      0           elu_300[0][0]                    
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      163840      spatial_dropout1d_58[0][0]       
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_59 (SpatialDr (None, 72, 128)      0           elu_301[0][0]                    
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         spatial_dropout1d_59[0][0]       
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
__________________________________________________________________________________________________
spatial_dropout1d_60 (SpatialDr (None, 72, 2)        0           linear_302[0][0]                 
==================================================================================================
Total params: 2,433,560
Trainable params: 2,433,560
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[64, 128, 256], [128, 128, 100, 100, 64, 64], [128, 128], [64, 64, 128, 128, 256, 256], [256, 128, 2]]
list_of_kernel_unet =  [[10, 10, 8, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
list_of_dropout =  [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0, 0.0, 0.0], [0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0, 0]]
loss
[0.0, 29.89501350308642, 17.059170444315843, 14.88476160622428, 13.487472471386317, 12.216649184992283, 11.03146801858282, 10.265743553883745, 9.536899393968621, 8.798921561535494, 8.162780008198302, 7.737636236496914, 7.247901194380144, 6.9295378006044235, 6.655291019643776, 6.472751193576389, 6.266098713188015, 5.943873778292181, 5.833871849279835, 5.638490025398663, 5.460373364358282, 5.2978842150527266, 5.182612666377315, 19683.818]
{'val_loss': [18.684763975143433, 16.669462578773498, 14.134622832298279, 12.95214218044281, 12.336158180236817, 10.71294526052475, 9.79169117832184, 9.847487582206726, 8.520765202522277, 8.22697253894806, 7.69987299823761, 7.170742857933044, 7.013695457220077, 6.462013030052185, 6.561975869178772, 6.404237754821778, 5.921004296779633, 5.627772491693497, 5.7192721271514895, 5.1947389693260195, 5.2487583303451535, 5.237379389286041, 5.201755452632904], 'val_Up_Down_loss': [18.41451117324829, 16.459908847808837, 13.967981325149536, 12.799130875587464, 12.205320721626281, 10.604109800815582, 9.685474454879762, 9.749041827201843, 8.431014420986175, 8.147091913223267, 7.6238955016136165, 7.09518565750122, 6.943963133573532, 6.392433418989182, 6.4972063944339755, 6.343320184469223, 5.861242147684098, 5.568904334068298, 5.661984092235565, 5.139684178590775, 5.193122624397278, 5.182485200405121, 5.149610622406006], 'val_Cum_Down_loss': [169.25646018981934, 272.38618702697755, 139.47246450042724, 118.16575620269775, 153.76231771087646, 133.5871718902588, 80.86814363479614, 73.00980164527893, 69.04275159454346, 69.9192175283432, 56.41965689849854, 88.0206576271057, 51.71456055831909, 51.305448659896854, 65.50994187545777, 56.589046493530276, 48.54631720161438, 45.482681940078734, 46.367851470947265, 41.30895970916748, 44.319702337265014, 58.83076845932007, 54.97429899215698], 'loss': [29.895060391828356, 17.059169717899564, 14.88477114615617, 13.487458057241675, 12.216644765172965, 11.031459383390567, 10.26574716425727, 9.536904506354665, 8.798926566118075, 8.16278017192711, 7.737641516781638, 7.247904937269756, 6.929538266158398, 6.65528347701938, 6.472752004371259, 6.266088979418385, 5.943874237284739, 5.833870748126948, 5.638486576791653, 5.4603763832844825, 5.297881276703175, 5.182610358291693, 5.062709700423504], 'Up_Down_loss': [29.644054200668883, 16.831543331038315, 14.702491673299805, 13.332563102122688, 12.082464055269343, 10.911982264415718, 10.158702005574733, 9.439181435439322, 8.709662420330224, 8.079610077687251, 7.659617945183943, 7.174593788912757, 6.859461115466224, 6.587487909712909, 6.407643302048675, 6.203546263492156, 5.883225005227352, 5.774878801141747, 5.580947345053708, 5.404039220125587, 5.242881579838172, 5.128979045361158, 5.009953327752926], 'Cum_Down_loss': [686.7170162161682, 192.80004621042636, 162.91731587457068, 144.1936871171488, 127.05854398870665, 111.16632232450164, 102.55935135643178, 93.80789176328683, 85.41400361796956, 79.05086541617358, 75.69475626307751, 70.96534998377655, 66.18156554326109, 63.33615583475725, 62.45505819546342, 59.859826423994306, 56.53462392754025, 56.043097555882646, 55.35187520191012, 53.22251866580037, 51.712188758967834, 51.092363252806564, 49.87708177267279]}
