Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

type : Var Supression 
 values : ['ts'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_2 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_2 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 64)       6400        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 64)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 72, 64)       0           elu_0[0][0]                      
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       40960       dropout_1[0][0]                  
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 72, 64)       0           elu_1[0][0]                      
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       20480       dropout_2[0][0]                  
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 72, 64)       0           elu_2[0][0]                      
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 256)      81920       dropout_3[0][0]                  
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 256)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 72, 256)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 256)      0           dropout_4[0][0]                  
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 60)       30780       AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 60)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 36, 60)       0           elu_100[0][0]                    
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 60)       18060       dropout_5[0][0]                  
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 60)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 36, 60)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 60)       0           dropout_6[0][0]                  
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 100)      12100       AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 100)      0           Conv_101[0][0]                   
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 18, 100)      0           elu_101[0][0]                    
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 100)      50100       dropout_7[0][0]                  
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 100)      0           Conv_111[0][0]                   
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 18, 100)      0           elu_111[0][0]                    
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 100)       0           dropout_8[0][0]                  
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 256)       51456       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 256)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 9, 256)       0           elu_102[0][0]                    
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 512)       524800      dropout_9[0][0]                  
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 512)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 9, 512)       0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Conv1D)                (None, 9, 150)       691350      dropout_10[0][0]                 
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 9, 150)       0           Dense_0[0][0]                    
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 9, 150)       0           tanh_d_0[0][0]                   
__________________________________________________________________________________________________
Dense_1 (Conv1D)                (None, 9, 100)       135100      dropout_11[0][0]                 
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 9, 100)       0           Dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 9, 100)       0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 612)       0           dropout_12[0][0]                 
                                                                 dropout_10[0][0]                 
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 612)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 128)      235136      Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 128)      0           Conv_200[0][0]                   
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 18, 128)      0           elu_200[0][0]                    
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 128)      65664       dropout_13[0][0]                 
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 128)      0           Conv_210[0][0]                   
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 18, 128)      0           elu_210[0][0]                    
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 228)      0           dropout_14[0][0]                 
                                                                 dropout_8[0][0]                  
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 228)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 256)      175360      Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 256)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 36, 256)      0           elu_201[0][0]                    
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 256)      327936      dropout_15[0][0]                 
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 256)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 36, 256)      0           elu_211[0][0]                    
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 316)      0           dropout_16[0][0]                 
                                                                 dropout_6[0][0]                  
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 316)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 256)      242944      Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 256)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 72, 256)      0           elu_202[0][0]                    
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 256)      393472      dropout_17[0][0]                 
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 256)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 72, 256)      0           elu_212[0][0]                    
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 256)      655360      dropout_18[0][0]                 
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 256)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 72, 256)      0           elu_300[0][0]                    
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 128)      163840      dropout_19[0][0]                 
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 128)      0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
dropout_20 (Dropout)            (None, 72, 128)      0           elu_301[0][0]                    
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        768         dropout_20[0][0]                 
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
__________________________________________________________________________________________________
dropout_21 (Dropout)            (None, 72, 2)        0           linear_302[0][0]                 
==================================================================================================
Total params: 3,923,986
Trainable params: 3,923,986
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[64, 64, 64, 256], [60, 60, 100, 100, 256, 512], [150, 100], [128, 128, 256, 256, 256, 256], [256, 128, 2]]
list_of_kernel_unet =  [[10, 10, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
list_of_dropout =  [[0.5, 0.5, 0.5, 0.5], [0.5, 0.5, 0.5, 0.5, 0.5, 0.5], [0.5, 0.5], [0.5, 0.5, 0.5, 0.5, 0.5, 0.5], [0, 0, 0]]
loss
[0.0, 45.42995273919753, 24.86080568415638, 36.83483233667695, 27.27730959040638, 30.096818335262345, 22.004754211676953, 16.4555865001286, 16.487450368119855, 12.433530454282407, 21.215846434542183, 22.45483297968107, 14.463714474022634, 19.473295235339506, 15.69750775623714, 15.248011710712449, 16.228942619920268, 15.140815891846708, 13.018692330568415, 15.783881293402779, 14.194888519161523, 13.926601080246913, 12.53615190168467, 15.05761819219393, 16.619993610146604, 77726.69]
