Seed 0
Optimizer
{'lr': 0.0010000000474974513, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 9.999999974752427e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 72, 2)             0         
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 360, 2)            0         
_________________________________________________________________
average_pooling1d_1 (Average (None, 72, 2)             0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Origin_Input (InputLayer)    (None, 72, 2)             0         
_________________________________________________________________
Conv_0 (Conv1D)              (None, 72, 10)            200       
_________________________________________________________________
elu_0 (ELU)                  (None, 72, 10)            0         
_________________________________________________________________
spatial_dropout1d_1 (Spatial (None, 72, 10)            0         
_________________________________________________________________
Conv_1 (Conv1D)              (None, 72, 18)            900       
_________________________________________________________________
elu_1 (ELU)                  (None, 72, 18)            0         
_________________________________________________________________
spatial_dropout1d_2 (Spatial (None, 72, 18)            0         
_________________________________________________________________
AVG_100 (MaxPooling1D)       (None, 36, 18)            0         
_________________________________________________________________
Conv_100 (Conv1D)            (None, 36, 30)            1110      
_________________________________________________________________
elu_100 (ELU)                (None, 36, 30)            0         
_________________________________________________________________
spatial_dropout1d_3 (Spatial (None, 36, 30)            0         
_________________________________________________________________
Conv_110 (Conv1D)            (None, 36, 30)            4530      
_________________________________________________________________
elu_110 (ELU)                (None, 36, 30)            0         
_________________________________________________________________
spatial_dropout1d_4 (Spatial (None, 36, 30)            0         
_________________________________________________________________
AVG_101 (MaxPooling1D)       (None, 18, 30)            0         
_________________________________________________________________
Conv_101 (Conv1D)            (None, 18, 50)            3050      
_________________________________________________________________
elu_101 (ELU)                (None, 18, 50)            0         
_________________________________________________________________
spatial_dropout1d_5 (Spatial (None, 18, 50)            0         
_________________________________________________________________
Conv_111 (Conv1D)            (None, 18, 50)            12550     
_________________________________________________________________
elu_111 (ELU)                (None, 18, 50)            0         
_________________________________________________________________
spatial_dropout1d_6 (Spatial (None, 18, 50)            0         
_________________________________________________________________
AVG_102 (MaxPooling1D)       (None, 9, 50)             0         
_________________________________________________________________
Conv_102 (Conv1D)            (None, 9, 150)            15150     
_________________________________________________________________
elu_102 (ELU)                (None, 9, 150)            0         
_________________________________________________________________
spatial_dropout1d_7 (Spatial (None, 9, 150)            0         
_________________________________________________________________
Conv_112 (Conv1D)            (None, 9, 150)            90150     
_________________________________________________________________
elu_112 (ELU)                (None, 9, 150)            0         
_________________________________________________________________
spatial_dropout1d_8 (Spatial (None, 9, 150)            0         
_________________________________________________________________
Dense_0 (Conv1D)             (None, 9, 40)             54040     
_________________________________________________________________
elu_d_0 (ELU)                (None, 9, 40)             0         
_________________________________________________________________
spatial_dropout1d_9 (Spatial (None, 9, 40)             0         
_________________________________________________________________
Dense_1 (Conv1D)             (None, 9, 20)             7220      
_________________________________________________________________
elu_d_1 (ELU)                (None, 9, 20)             0         
_________________________________________________________________
spatial_dropout1d_10 (Spatia (None, 9, 20)             0         
_________________________________________________________________
Dense_2 (Conv1D)             (None, 9, 10)             1810      
_________________________________________________________________
elu_d_2 (ELU)                (None, 9, 10)             0         
_________________________________________________________________
spatial_dropout1d_11 (Spatia (None, 9, 10)             0         
_________________________________________________________________
Ups_200 (UpSampling1D)       (None, 18, 10)            0         
_________________________________________________________________
Conv_200 (Conv1D)            (None, 18, 100)           3100      
_________________________________________________________________
elu_200 (ELU)                (None, 18, 100)           0         
_________________________________________________________________
spatial_dropout1d_12 (Spatia (None, 18, 100)           0         
_________________________________________________________________
Conv_210 (Conv1D)            (None, 18, 100)           40100     
_________________________________________________________________
elu_210 (ELU)                (None, 18, 100)           0         
_________________________________________________________________
spatial_dropout1d_13 (Spatia (None, 18, 100)           0         
_________________________________________________________________
Ups_201 (UpSampling1D)       (None, 36, 100)           0         
_________________________________________________________________
Conv_201 (Conv1D)            (None, 36, 150)           45150     
_________________________________________________________________
elu_201 (ELU)                (None, 36, 150)           0         
_________________________________________________________________
spatial_dropout1d_14 (Spatia (None, 36, 150)           0         
_________________________________________________________________
Conv_211 (Conv1D)            (None, 36, 150)           112650    
_________________________________________________________________
elu_211 (ELU)                (None, 36, 150)           0         
_________________________________________________________________
spatial_dropout1d_15 (Spatia (None, 36, 150)           0         
_________________________________________________________________
Ups_202 (UpSampling1D)       (None, 72, 150)           0         
_________________________________________________________________
Conv_202 (Conv1D)            (None, 72, 150)           67650     
_________________________________________________________________
elu_202 (ELU)                (None, 72, 150)           0         
_________________________________________________________________
spatial_dropout1d_16 (Spatia (None, 72, 150)           0         
_________________________________________________________________
Conv_212 (Conv1D)            (None, 72, 150)           135150    
_________________________________________________________________
elu_212 (ELU)                (None, 72, 150)           0         
_________________________________________________________________
spatial_dropout1d_17 (Spatia (None, 72, 150)           0         
_________________________________________________________________
Conv3_300 (Conv1D)           (None, 72, 20)            15000     
_________________________________________________________________
elu_300 (ELU)                (None, 72, 20)            0         
_________________________________________________________________
spatial_dropout1d_18 (Spatia (None, 72, 20)            0         
=================================================================
Total params: 609,510
Trainable params: 609,510
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_RC0 (InputLayer)          (None, 20, 72)       0                                            
__________________________________________________________________________________________________
Last_flatten (Flatten)          (None, 1440)         0           Input_RC0[0][0]                  
__________________________________________________________________________________________________
Last_Dense_0 (Dense)            (None, 72)           103752      Last_flatten[0][0]               
__________________________________________________________________________________________________
Last_Dense_1 (Dense)            (None, 72)           103752      Last_flatten[0][0]               
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 72, 1)        0           Last_Dense_0[0][0]               
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 72, 1)        0           Last_Dense_1[0][0]               
__________________________________________________________________________________________________
Last_Concat (Concatenate)       (None, 72, 2)        0           reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
==================================================================================================
Total params: 207,504
Trainable params: 207,504
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[10, 18], [30, 30, 50, 50, 150, 150], [40, 20, 10], [100, 100, 150, 150, 150, 150], [20]]
list_of_kernel_unet =  [[10, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [5]]
list_of_activation_unet =  [['elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu']]
loss
[0.0, 54.857052147633745, 190111.44]
flxd_loss
[0.0, 39.86819219393004, 141774.94]
flxu_loss
[0.0, 14.81564569669496, 48000.156]
