Seed 0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 72, 11)            0         
_________________________________________________________________
model_10 (Model)             (None, 72, 50)            119972    
_________________________________________________________________
model_11 (Model)             (None, 72, 3)             2500625   
=================================================================
Total params: 2,620,597
Trainable params: 2,620,597
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 50)       0                                            
__________________________________________________________________________________________________
AVG_1 (AveragePooling1D)        (None, 36, 50)       0           Origin_Input[0][0]               
__________________________________________________________________________________________________
Conv1_1 (Conv1D)                (None, 36, 30)       15030       AVG_1[0][0]                      
__________________________________________________________________________________________________
AVG_2 (AveragePooling1D)        (None, 18, 30)       0           Conv1_1[0][0]                    
__________________________________________________________________________________________________
Conv1_2 (Conv1D)                (None, 18, 75)       11325       AVG_2[0][0]                      
__________________________________________________________________________________________________
AVG_3 (AveragePooling1D)        (None, 9, 75)        0           Conv1_2[0][0]                    
__________________________________________________________________________________________________
Conv1_3 (Conv1D)                (None, 9, 100)       22600       AVG_3[0][0]                      
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 900)          0           Conv1_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 2430)         2189430     flatten_4[0][0]                  
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 270)       0           dense_4[0][0]                    
__________________________________________________________________________________________________
Concat_1 (Concatenate)          (None, 9, 370)       0           Reshape[0][0]                    
                                                                 Conv1_3[0][0]                    
__________________________________________________________________________________________________
Ups_1 (UpSampling1D)            (None, 18, 370)      0           Concat_1[0][0]                   
__________________________________________________________________________________________________
Conv2_1 (Conv1D)                (None, 18, 100)      185100      Ups_1[0][0]                      
__________________________________________________________________________________________________
Concat_2 (Concatenate)          (None, 18, 175)      0           Conv2_1[0][0]                    
                                                                 Conv1_2[0][0]                    
__________________________________________________________________________________________________
Ups_2 (UpSampling1D)            (None, 36, 175)      0           Concat_2[0][0]                   
__________________________________________________________________________________________________
Conv2_2 (Conv1D)                (None, 36, 40)       56040       Ups_2[0][0]                      
__________________________________________________________________________________________________
Concat_3 (Concatenate)          (None, 36, 70)       0           Conv2_2[0][0]                    
                                                                 Conv1_1[0][0]                    
__________________________________________________________________________________________________
Ups_3 (UpSampling1D)            (None, 72, 70)       0           Concat_3[0][0]                   
__________________________________________________________________________________________________
Conv2_3 (Conv1D)                (None, 72, 25)       21025       Ups_3[0][0]                      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 72, 3)        75          Conv2_3[0][0]                    
==================================================================================================
Total params: 2,500,625
Trainable params: 2,500,625
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_0 (InputLayer)            (None, 72, 11)       0                                            
__________________________________________________________________________________________________
Up_0 (UpSampling1D)             (None, 360, 11)      0           Input_0[0][0]                    
__________________________________________________________________________________________________
AVG_p (AveragePooling1D)        (None, 72, 11)       0           Up_0[0][0]                       
__________________________________________________________________________________________________
Flip_0 (Lambda)                 (None, 72, 11)       0           AVG_p[0][0]                      
__________________________________________________________________________________________________
Conv_d_1 (Conv1D)               (None, 72, 64)       7104        Flip_0[0][0]                     
__________________________________________________________________________________________________
Conv_u_1 (Conv1D)               (None, 72, 128)      14208       AVG_p[0][0]                      
__________________________________________________________________________________________________
Conv_d_2 (Conv1D)               (None, 72, 16)       5136        Conv_d_1[0][0]                   
__________________________________________________________________________________________________
Conv_u_2 (Conv1D)               (None, 72, 64)       41024       Conv_u_1[0][0]                   
__________________________________________________________________________________________________
Flip_1 (Lambda)                 (None, 72, 16)       0           Conv_d_2[0][0]                   
__________________________________________________________________________________________________
Concat_0 (Concatenate)          (None, 72, 80)       0           Conv_u_2[0][0]                   
                                                                 Flip_1[0][0]                     
__________________________________________________________________________________________________
Conv_conc_0 (Conv1D)            (None, 72, 50)       40000       Concat_0[0][0]                   
__________________________________________________________________________________________________
Conv_conc_1 (Conv1D)            (None, 72, 50)       12500       Conv_conc_0[0][0]                
==================================================================================================
Total params: 119,972
Trainable params: 119,972
Non-trainable params: 0
__________________________________________________________________________________________________
val_loss : [80.49984100341797, 55.52270111083985, 37.10724514007568, 40.97248420715332]
val_flxd_loss : [41.869252853393554, 26.08604331970215, 17.085715427398682, 18.64162525177002]
val_flxu_loss : [14.723964233398437, 11.366327400207519, 7.494144668579102, 7.875715217590332]
val_dfdts_loss : [23.906623878479003, 18.070330848693846, 12.527384757995605, 14.455143508911133]
loss : [37.517604757084136, 34.4636138102435, 33.3845970259422, 32.524953396091874]
flxd_loss : [18.951306330891374, 17.314115397937854, 16.687271479296026, 16.224004712096388]
flxu_loss : [8.985907247079112, 8.314690186329479, 8.024646781876394, 7.8082815314814455]
dfdts_loss : [9.580391175532467, 8.834808218209341, 8.672678758010383, 8.49266717002225]


Bdc
[[128, 64], [64, 16], [50, 50]]
[[10, 5], [10, 5], [10, 5]]
Unet
[[30, 75, 100], [270], [100, 40, 25]]
[[10, 5, 3], [], [5, 8, 12]]
flxu_loss
flxd_loss
dfdts_loss
loss
