Seed 0
Optimizer
{'lr': 9.999999747378752e-05, 'beta_1': 0.8999999761581421, 'beta_2': 0.9990000128746033, 'decay': 1.0000000116860974e-07, 'epsilon': 1e-07, 'amsgrad': False}
Prepross
emis : type : Normalizer 
fitted : True 
values : (0.9890608787536621, 0.006443938706070185) 
  
o3 : type : Normalizer 
fitted : True 
values : (3.6597821235773154e-06, 4.7702924348413944e-06) 
  
pl : type : Normalizer 
fitted : True 
values : (30594.45703125, 36118.08203125) 
  
q : type : Zero_One 
fitted : True 
values : (0.020224308595061302, 1.8337337924560727e-15) 
  
qi : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ql : type : Zero_One 
fitted : True 
values : (0.0010000000474974513, 0.0) 
  
ri : type : Zero_One 
fitted : True 
values : (0.00010348010255256668, 1.4999999621068127e-05) 
  
rl : type : Zero_One 
fitted : True 
values : (2.099999983329326e-05, 4.999999873689376e-06) 
  
t : type : Normalizer 
fitted : True 
values : (243.3359832763672, 25.461942672729492) 
  
ts : type : Normalizer 
fitted : True 
values : (283.5641174316406, 6.850484848022461) 
  

o3 : type : Level_Normalizer 
fitted : True 
values : [ 1.5178547   0.4859575   0.13512056  0.00546122 -0.12304485 -0.2245656
 -0.28646666 -0.30685493 -0.29715014 -0.25675038 -0.18726334 -0.08862133
  0.04254093  0.20168397  0.396791    0.6326498   0.89178973  1.164369
  1.4541614   1.7227275   1.9611518   2.1315734   2.1997576   2.1855445
  2.1296737   2.0289721   1.8617861   1.6176039   1.3109899   0.9857326
  0.669009    0.3587962   0.07577984 -0.1339541  -0.30950537 -0.4462536
 -0.5478872  -0.60752857 -0.6411809  -0.6589909  -0.67667884 -0.69653
 -0.71816367 -0.7356652  -0.7453311  -0.7489238  -0.7501921  -0.75091916
 -0.75141084 -0.75185525 -0.7523236  -0.75278234 -0.7532052  -0.75363714
 -0.7539908  -0.754272   -0.7545589  -0.7548432  -0.7551413  -0.75541395
 -0.7556355  -0.7558373  -0.75604194 -0.75624406 -0.75643086 -0.75659657
 -0.75673807 -0.75684655 -0.7569279  -0.75699836 -0.7570599  -0.7571092 ] 
  
pl : type : Level_Normalizer 
fitted : True 
values : [-0.8469185  -0.8469151  -0.8469045  -0.84675324 -0.8467394  -0.8466971
 -0.84667975 -0.84662426 -0.8464538  -0.8459983  -0.8457733  -0.84564656
 -0.84500474 -0.84466666 -0.84376764 -0.84284407 -0.8418144  -0.84059626
 -0.83887076 -0.83691293 -0.8342804  -0.83134115 -0.82805306 -0.8235312
 -0.81843543 -0.81251466 -0.80543023 -0.7968753  -0.78686637 -0.7750721
 -0.7609886  -0.74478245 -0.7255684  -0.70310795 -0.67676324 -0.646176
 -0.61043346 -0.56877786 -0.51962286 -0.46191353 -0.39400518 -0.3140806
 -0.22035415 -0.11040513  0.01675914  0.13593628  0.23868622  0.34139135
  0.44405127  0.5466785   0.6492845   0.7518655   0.8544333   0.95698667
  1.042439    1.1107923   1.1791455   1.2474941   1.3158385   1.377349
  1.4251871   1.466188    1.5071874   1.5481895   1.5891905   1.6301885
  1.6711955   1.7121851   1.753188    1.7941831   1.835184    1.8762577 ] 
  
q : type : Level_Normalizer 
fitted : True 
values : [8.30325589e-05 9.93670474e-05 1.30244924e-04 1.53031724e-04
 1.66769518e-04 1.74681161e-04 1.80740142e-04 1.85819561e-04
 1.90293300e-04 1.94039778e-04 1.96783760e-04 1.98227193e-04
 1.98072798e-04 1.94902255e-04 1.89183353e-04 1.85522964e-04
 1.81042313e-04 1.76802831e-04 1.72134460e-04 1.67060280e-04
 1.61786709e-04 1.57398987e-04 1.54074020e-04 1.51035871e-04
 1.48050196e-04 1.45007260e-04 1.42327626e-04 1.40182528e-04
 1.38545467e-04 1.37245821e-04 1.35919297e-04 1.34164351e-04
 1.31694411e-04 1.28424886e-04 1.23427075e-04 1.19225697e-04
 1.19097116e-04 1.32865360e-04 1.77492111e-04 3.13013385e-04
 6.48844929e-04 1.42204168e-03 3.06227198e-03 6.15908206e-03
 1.13856578e-02 1.80197209e-02 2.53234413e-02 3.42310555e-02
 4.55139615e-02 5.96591048e-02 7.63898268e-02 9.44102332e-02
 1.13610178e-01 1.35784507e-01 1.56229064e-01 1.73917443e-01
 1.92157611e-01 2.11400241e-01 2.33589292e-01 2.57347316e-01
 2.80018628e-01 3.03705007e-01 3.30073327e-01 3.57465535e-01
 3.84411752e-01 4.10704106e-01 4.33816880e-01 4.52279001e-01
 4.66513813e-01 4.78091329e-01 4.89531875e-01 5.03859699e-01] 
  

type : Var Supression 
 values : ['ts', 'frocean', 'frlake', 'frland', 'frlandice', 'frseaice'] 

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 72, 10)            0         
_________________________________________________________________
up_sampling1d_4 (UpSampling1 (None, 360, 10)           0         
_________________________________________________________________
average_pooling1d_4 (Average (None, 72, 10)            0         
=================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
_________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Origin_Input (InputLayer)       (None, 72, 10)       0                                            
__________________________________________________________________________________________________
Conv_0 (Conv1D)                 (None, 72, 32)       3200        Origin_Input[0][0]               
__________________________________________________________________________________________________
elu_0 (ELU)                     (None, 72, 32)       0           Conv_0[0][0]                     
__________________________________________________________________________________________________
Conv_1 (Conv1D)                 (None, 72, 64)       20480       elu_0[0][0]                      
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 72, 64)       0           Conv_1[0][0]                     
__________________________________________________________________________________________________
Conv_2 (Conv1D)                 (None, 72, 64)       20480       elu_1[0][0]                      
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 72, 64)       0           Conv_2[0][0]                     
__________________________________________________________________________________________________
Conv_3 (Conv1D)                 (None, 72, 128)      40960       elu_2[0][0]                      
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 72, 128)      0           Conv_3[0][0]                     
__________________________________________________________________________________________________
AVG_100 (AveragePooling1D)      (None, 36, 128)      0           elu_3[0][0]                      
__________________________________________________________________________________________________
Conv_100 (Conv1D)               (None, 36, 30)       7710        AVG_100[0][0]                    
__________________________________________________________________________________________________
elu_100 (ELU)                   (None, 36, 30)       0           Conv_100[0][0]                   
__________________________________________________________________________________________________
Conv_110 (Conv1D)               (None, 36, 30)       4530        elu_100[0][0]                    
__________________________________________________________________________________________________
elu_110 (ELU)                   (None, 36, 30)       0           Conv_110[0][0]                   
__________________________________________________________________________________________________
AVG_101 (AveragePooling1D)      (None, 18, 30)       0           elu_110[0][0]                    
__________________________________________________________________________________________________
Conv_101 (Conv1D)               (None, 18, 50)       3050        AVG_101[0][0]                    
__________________________________________________________________________________________________
elu_101 (ELU)                   (None, 18, 50)       0           Conv_101[0][0]                   
__________________________________________________________________________________________________
Conv_111 (Conv1D)               (None, 18, 50)       12550       elu_101[0][0]                    
__________________________________________________________________________________________________
elu_111 (ELU)                   (None, 18, 50)       0           Conv_111[0][0]                   
__________________________________________________________________________________________________
AVG_102 (AveragePooling1D)      (None, 9, 50)        0           elu_111[0][0]                    
__________________________________________________________________________________________________
Conv_102 (Conv1D)               (None, 9, 128)       12928       AVG_102[0][0]                    
__________________________________________________________________________________________________
elu_102 (ELU)                   (None, 9, 128)       0           Conv_102[0][0]                   
__________________________________________________________________________________________________
Conv_112 (Conv1D)               (None, 9, 128)       65664       elu_102[0][0]                    
__________________________________________________________________________________________________
elu_112 (ELU)                   (None, 9, 128)       0           Conv_112[0][0]                   
__________________________________________________________________________________________________
Flatten (Flatten)               (None, 1152)         0           elu_112[0][0]                    
__________________________________________________________________________________________________
Dense_0 (Dense)                 (None, 360)          415080      Flatten[0][0]                    
__________________________________________________________________________________________________
tanh_d_0 (Activation)           (None, 360)          0           Dense_0[0][0]                    
__________________________________________________________________________________________________
Dense_1 (Dense)                 (None, 90)           32490       tanh_d_0[0][0]                   
__________________________________________________________________________________________________
tanh_d_1 (Activation)           (None, 90)           0           Dense_1[0][0]                    
__________________________________________________________________________________________________
Reshape (Reshape)               (None, 9, 10)        0           tanh_d_1[0][0]                   
__________________________________________________________________________________________________
Concat_300 (Concatenate)        (None, 9, 138)       0           Reshape[0][0]                    
                                                                 elu_112[0][0]                    
__________________________________________________________________________________________________
Ups_200 (UpSampling1D)          (None, 18, 138)      0           Concat_300[0][0]                 
__________________________________________________________________________________________________
Conv_200 (Conv1D)               (None, 18, 64)       26560       Ups_200[0][0]                    
__________________________________________________________________________________________________
elu_200 (ELU)                   (None, 18, 64)       0           Conv_200[0][0]                   
__________________________________________________________________________________________________
Conv_210 (Conv1D)               (None, 18, 64)       16448       elu_200[0][0]                    
__________________________________________________________________________________________________
elu_210 (ELU)                   (None, 18, 64)       0           Conv_210[0][0]                   
__________________________________________________________________________________________________
Concat_301 (Concatenate)        (None, 18, 114)      0           elu_210[0][0]                    
                                                                 elu_111[0][0]                    
__________________________________________________________________________________________________
Ups_201 (UpSampling1D)          (None, 36, 114)      0           Concat_301[0][0]                 
__________________________________________________________________________________________________
Conv_201 (Conv1D)               (None, 36, 128)      43904       Ups_201[0][0]                    
__________________________________________________________________________________________________
elu_201 (ELU)                   (None, 36, 128)      0           Conv_201[0][0]                   
__________________________________________________________________________________________________
Conv_211 (Conv1D)               (None, 36, 128)      82048       elu_201[0][0]                    
__________________________________________________________________________________________________
elu_211 (ELU)                   (None, 36, 128)      0           Conv_211[0][0]                   
__________________________________________________________________________________________________
Concat_302 (Concatenate)        (None, 36, 158)      0           elu_211[0][0]                    
                                                                 elu_110[0][0]                    
__________________________________________________________________________________________________
Ups_202 (UpSampling1D)          (None, 72, 158)      0           Concat_302[0][0]                 
__________________________________________________________________________________________________
Conv_202 (Conv1D)               (None, 72, 128)      60800       Ups_202[0][0]                    
__________________________________________________________________________________________________
elu_202 (ELU)                   (None, 72, 128)      0           Conv_202[0][0]                   
__________________________________________________________________________________________________
Conv_212 (Conv1D)               (None, 72, 128)      98432       elu_202[0][0]                    
__________________________________________________________________________________________________
elu_212 (ELU)                   (None, 72, 128)      0           Conv_212[0][0]                   
__________________________________________________________________________________________________
Conv3_300 (Conv1D)              (None, 72, 256)      327680      elu_212[0][0]                    
__________________________________________________________________________________________________
elu_300 (ELU)                   (None, 72, 256)      0           Conv3_300[0][0]                  
__________________________________________________________________________________________________
Conv3_301 (Conv1D)              (None, 72, 32)       40960       elu_300[0][0]                    
__________________________________________________________________________________________________
elu_301 (ELU)                   (None, 72, 32)       0           Conv3_301[0][0]                  
__________________________________________________________________________________________________
Conv3_302 (Conv1D)              (None, 72, 2)        192         elu_301[0][0]                    
__________________________________________________________________________________________________
linear_302 (Activation)         (None, 72, 2)        0           Conv3_302[0][0]                  
==================================================================================================
Total params: 1,336,146
Trainable params: 1,336,146
Non-trainable params: 0
__________________________________________________________________________________________________


Unet
list_of_filters_unet =  [[32, 64, 64, 128], [30, 30, 50, 50, 128, 128], [40, 10], [64, 64, 128, 128, 128, 128], [256, 32, 2]]
list_of_kernel_unet =  [[10, 10, 5, 5], [2, 5, 2, 5, 2, 4], [], [3, 4, 3, 5, 3, 6], [10, 5, 3]]
list_of_activations_unet =  [['elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['tanh', 'tanh', 'tanh'], ['elu', 'elu', 'elu', 'elu', 'elu', 'elu'], ['elu', 'elu', 'linear']]
loss
[0.0, 21.350535702803498, 15.940540203832304, 13.877278645833334, 12.465316960841049, 11.356021331661523, 9.949117275913066, 9.045912503215021, 8.323023666570217, 7.655244803722994, 7.139886047614454, 6.902327674897119, 6.511617778260031, 6.157511393229167, 6.0137708373521095, 5.760081601240998, 5.52111615467464, 5.285486291956018, 5.07215159223894, 4.988595216853138, 4.814255200295782, 4.664647231867284, 4.539639194315844, 4.557602619438015, 4.419284899048354, 4.177189830889918, 4.095792291586291, 4.053282435538837, 4.0058267224472734, 3.9382537716210133, 3.7397586524241255, 3.6696405606995883, 3.592023684654707, 3.5069738317418984, 3.4570531020929782, 3.454443158436214, 3.382424185796039, 3.301308463139789, 3.3253485283243314, 3.279685189203961, 3.246387622974537, 3.1896852092978394, 3.1288030176986883, 3.1132887852044755, 3.065629621592078, 3.0389934272923096, 2.99188031483089, 3.041534047067901, 3.029597529658565, 2.8847822024498457, 2.8793362590020575, 2.900970835744599, 2.9134734981835133, 2.8835358796296298, 2.749933690200617, 2.748749658404064, 2.733581040621785, 2.70061552573624, 2.683545022344393, 2.6939335575810186, 2.6701175391428755, 2.621740019370499, 2.668701171875, 2.6616110468106995, 2.659708407680684, 2.6666807323816872, 2.604693126286008, 2.5820561161747686, 2.5830736199524176, 2.569979695135674, 2.539347079555684, 2.580290868939686, 2.589248217672968, 2.4712984061535495, 2.4746322317869085, 2.5163019125353654, 2.5307782961998457, 2.5062921469103654, 2.4040715723861883, 2.412883491673097, 2.4066948282375256, 2.3878638499067644, 2.374607667020319, 2.3906722206147117, 2.380680790653935, 2.3485579628022117, 2.3919290927211936, 2.4059056411554782, 2.3973225409111367, 2.39087215470679, 2.353552547501929, 2.3390839502154064, 2.3456629372427984, 2.3303250285333075, 2.3136528862847223, 2.3512369791666665, 2.3662669491866, 282.5497]
